{
  "title": "3D printing",
  "summary": "3D printing, also called additive manufacturing, is the construction of a three-dimensional object from a CAD model or a digital 3D model. It can be done in a variety of processes in which material is deposited, joined or solidified under computer control, with the material being added together, typically layer by layer",
  "content": "3D printing Additive process used to make a 3D object For methods of transferring an image onto a 3D surface, see pad printing . For methods of generating autostereoscopic lenticular images, see lenticular printing and holography . a href= ./Wikipedia:Protection_policy#semi title= This article is semi-protected due to vandalism id= mwCA > img alt= Page semi-protected resource= ./File:Semi-protection-shackle.svg src= //upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png decoding= async data-file-width= 512 data-file-height= 512 data-file-type= drawing height= 20 width= 20 srcset= //upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/40px-Semi-protection-shackle.svg.png 1.5x, //upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/40px-Semi-protection-shackle.svg.png 2x class= mw-file-element id= mwCQ /> /a> /span> ' /> Timelapse of a three-dimensional printer in action body.skin-minerva body.skin--responsive Part of a series on the History of printing Techniques Woodblock printing 200 Movable type 1040 Intaglio (printmaking) 1430 Printing press c. 1440 Etching c. 1515 Mezzotint 1642 Relief printing 1690 Aquatint 1772 Lithography 1796 Chromolithography 1837 Rotary press 1843 Hectograph 1860 Offset printing 1875 Hot metal typesetting 1884 Mimeograph 1885 Daisy wheel printing 1889 Photostat and rectigraph 1907 Screen printing 1911 Spirit duplicator 1923 Dot matrix printing 1925 Xerography 1938 Spark printing 1940 Phototypesetting 1949 Inkjet printing 1950 Dye-sublimation 1957 Laser printing 1969 Thermal printing c. 1972 Solid ink printing 1972 Thermal-transfer printing 1981 3D printing 1986 Digital printing 1991 html.skin-theme-clientpref-night v t e 3D printing , also called additive manufacturing , is the construction of a three-dimensional object from a CAD model or a digital 3D model . 1 2 3 It can be done in a variety of processes in which material is deposited, joined or solidified under computer control , 4 with the material being added together (e.g. plastics, liquids, or powder grains being fused), typically layer by layer. In the 1980s, 3D printing techniques were considered suitable only for the production of functional or aesthetic prototypes, and a more appropriate term for it at the time was rapid prototyping . 5 As of 2019 update , the precision, repeatability, and material range of 3D printing have increased to the point that some 3D printing processes are considered viable as an industrial-production technology; in this context, the term additive manufacturing can be used synonymously with 3D printing . 6 One of the key advantages of 3D printing 7 is the ability to produce very complex shapes or geometries that would be otherwise infeasible to construct by hand, including hollow parts or parts with internal truss structures to reduce weight while creating less material waste. Fused deposition modeling (FDM), which uses a continuous filament of a thermoplastic material, is the most common 3D printing process in use as of 2020 update . 8 Terminology The umbrella term additive manufacturing (AM) gained popularity in the 2000s, 9 inspired by the theme of material being added together ( in any of various ways ). In contrast, the term subtractive manufacturing appeared as a retronym for the large family of machining processes with material removal as their common process. The term 3D printing still referred only to the polymer technologies in most minds, and the term AM was more likely to be used in metalworking and end-use part production contexts than among polymer, inkjet, or stereolithography enthusiasts. By the early 2010s, the terms 3D printing and additive manufacturing evolved senses in which they were alternate umbrella terms for additive technologies, one being used in popular language by consumer-maker communities and the media, and the other used more formally by industrial end-use part producers, machine manufacturers, and global technical standards organizations. Until recently, the term 3D printing has been associated with machines low in price or capability. 10 3D printing and additive manufacturing reflect that the technologies share the theme of material addition or joining throughout a 3D work envelope under automated control. Peter Zelinski, the editor-in-chief of Additive Manufacturing magazine, pointed out in 2017 that the terms are still often synonymous in casual usage, 11 but some manufacturing industry experts are trying to make a distinction whereby additive manufacturing comprises 3D printing plus other technologies or other aspects of a manufacturing process . 11 Other terms that have been used as synonyms or hypernyms have included desktop manufacturing , rapid manufacturing (as the logical production-level successor to rapid prototyping ), and on-demand manufacturing (which echoes on-demand printing in the 2D sense of printing ). The fact that the application of the adjectives rapid and on-demand to the noun manufacturing was novel in the 2000s reveals the long-prevailing mental model of the previous industrial era during which almost all production manufacturing had involved long lead times for laborious tooling development. Today, the term subtractive has not replaced the term machining , instead complementing it when a term that covers any removal method is needed. Agile tooling is the use of modular means to design tooling that is produced by additive manufacturing or 3D printing methods to enable quick prototyping and responses to tooling and fixture needs. Agile tooling uses a cost-effective and high-quality method to quickly respond to customer and market needs, and it can be used in hydroforming , stamping , injection molding and other manufacturing processes. History 1940s and 1950s The general concept of and procedure to be used in 3D-printing was first described by Murray Leinster in his 1945 short story Tools of the Trade , published in the November 1950 issue of Astounding Science Fiction magazine. He referred to it as a molecular spray in that story. 1970s In 1971, Johannes F Gottwald patented the Liquid Metal Recorder, U.S. patent 3596285A, 13 a continuous inkjet metal material device to form a removable metal fabrication on a reusable surface for immediate use or salvaged for printing again by remelting. This appears to be the first patent describing 3D printing with rapid prototyping and controlled on-demand manufacturing of patterns. The patent states: As used herein the term printing is not intended in a limited sense but includes writing or other symbols, character or pattern formation with an ink. The term ink as used in is intended to include not only dye or pigment-containing materials, but any flowable substance or composition suited for application to the surface for forming symbols, characters, or patterns of intelligence by marking. The preferred ink is of a hot melt type. The range of commercially available ink compositions which could meet the requirements of the invention are not known at the present time. However, satisfactory printing according to the invention has been achieved with the conductive metal alloy as ink. But in terms of material requirements for such large and continuous displays, if consumed at theretofore known rates, but increased in proportion to increase in size, the high cost would severely limit any widespread enjoyment of a process or apparatus satisfying the foregoing objects. It is therefore an additional object of the invention to minimize use to materials in a process of the indicated class. It is a further object of the invention that materials employed in such a process be salvaged for reuse. According to another aspect of the invention, a combination for writing and the like comprises a carrier for displaying an intelligence pattern and an arrangement for removing the pattern from the carrier. In 1974, David E. H. Jones laid out the concept of 3D printing in his regular column Ariadne in the journal New Scientist . 14 15 1980s Early additive manufacturing equipment and materials were developed in the 1980s. 16 In April 1980, Hideo Kodama of Nagoya Municipal Industrial Research Institute invented two additive methods for fabricating three-dimensional plastic models with photo-hardening thermoset polymer , where the UV exposure area is controlled by a mask pattern or a scanning fiber transmitter. 17 He filed a patent for this XYZ plotter, which was published on 10 November 1981. (JP S56-144478). 18 His research results as journal papers were published in April and November 1981. 19 20 However, there was no reaction to the series of his publications. His device was not highly evaluated in the laboratory and his boss did not show any interest. His research budget was just 60,000 yen or $545 a year. Acquiring the patent rights for the XYZ plotter was abandoned, and the project was terminated. A US 4323756 patent, method of fabricating articles by sequential deposition , granted on 6 April 1982 to Raytheon Technologies Corp describes using hundreds or thousands of layers of powdered metal and a laser energy source and represents an early reference to forming layers and the fabrication of articles on a substrate. On 2 July 1984, American entrepreneur Bill Masters filed a patent for his computer automated manufacturing process and system ( US 4665492 ). 21 This filing is on record at the USPTO as the first 3D printing patent in history; it was the first of three patents belonging to Masters that laid the foundation for the 3D printing systems used today. 22 23 On 16 July 1984, Alain Le Méhauté , Olivier de Witte, and Jean Claude André filed their patent for the stereolithography process. 24 The application of the French inventors was abandoned by the French General Electric Company (now Alcatel-Alsthom) and CILAS (The Laser Consortium). 25 The claimed reason was for lack of business perspective . 26 In 1983, Robert Howard started R.H. Research, later named Howtek, Inc. in Feb 1984 to develop a although plenty of automation was applied to those technologies (such as by robot welding and CNC ), the idea of a tool or head moving through a 3D work envelope transforming a mass of raw material into a desired shape with a toolpath was associated in metalworking only with processes that removed metal (rather than adding it), such as CNC milling , CNC EDM , and many others. However, the automated techniques that added metal, which would later be called additive manufacturing, were beginning to challenge that assumption. By the mid-1990s, new techniques for material deposition were developed at Stanford and Carnegie Mellon University , including microcasting 34 and sprayed materials. 35 Sacrificial and support materials had also become more common, enabling new object geometries. 36 The term 3D printing originally referred to a powder bed process employing standard and custom inkjet print heads, developed at MIT by Emanuel Sachs in 1993 and commercialized by Soligen Technologies, Extrude Hone Corporation, and Z Corporation . citation needed The year 1993 also saw the start of an inkjet 3D printer company initially named Sanders Prototype, Inc and later named Solidscape , introducing a high-precision polymer jet fabrication system with soluble support structures, (categorized as a dot-on-dot technique). 28 In 1995 the Fraunhofer Society developed the selective laser melting process. 2000s In the early 2000s 3D printers were still largely being used just in the manufacturing and research industries, as the technology was still relatively young and was too expensive for most consumers to be able to get their hands on. The 2000s was when larger scale use of the technology began being seen in industry, most often in the architecture and medical industries, though it was typically used for low accuracy modeling and testing, rather than the production of common manufactured goods or heavy prototyping. 37 In 2005 users began to design and distribute plans for 3D printers that could print around 70% of their own parts, the original plans of which were designed by Adrian Bowyer at the University of Bath in 2004, with the name of the project being RepRap (Replicating Rapid-prototyper). 38 Similarly, in 2006 the Fab@Home project was started by Evan Malone and Hod Lipson , another project whose purpose was to design a low-cost and open source fabrication system that users could develop on their own and post feedback on, making the project very collaborative. 39 Much of the software for 3D printing available to the public at the time was open source , and as such was quickly distributed and improved upon by many individual users. In 2009 the Fused Deposition Modeling (FDM) printing process patents expired. This opened the door to a new wave of startup companies, many of which were established by major contributors of these open source initiatives, with the goal of many of them being to start developing commercial FDM 3D printers that were more accessible to the general public. 40 2010s As the various additive processes matured, it became clear that soon metal removal would no longer be the only metalworking process done through a tool or head moving through a 3D work envelope, transforming a mass of raw material into a desired shape layer by layer. The 2010s were the first decade in which metal end-use parts such as engine brackets 41 and large nuts 42 would be grown (either before or instead of machining) in job production rather than obligately being machined from bar stock or plate. It is still the case that casting, fabrication, stamping, and machining are more prevalent than additive manufacturing in metalworking, but AM is now beginning to make significant inroads, and with the advantages of design for additive manufacturing , it is clear to engineers that much more is to come. One place that AM is making a significant inroad is in the aviation industry. With nearly 3.8 billion air travelers in 2016, 43 the demand for fuel efficient and easily produced jet engines has never been higher. For large OEMs (original equipment manufacturers) like Pratt and Whitney (PW) and General Electric (GE) this means looking towards AM as a way to reduce cost, reduce the number of nonconforming parts, reduce weight in the engines to increase fuel efficiency and find new, highly complex shapes that would not be feasible with the antiquated manufacturing methods. One example of AM integration with aerospace was in 2016 when Airbus delivered the first of GE's LEAP engines. This engine has integrated 3D-printed fuel nozzles, reducing parts from 20 to 1, a 25% weight reduction, and reduced assembly times. 44 A fuel nozzle is the perfect inroad for additive manufacturing in a jet engine since it allows for optimized design of the complex internals and it is a low-stress, non-rotating part. Similarly, in 2015, PW delivered their first AM parts in the PurePower PW1500G to Bombardier. Sticking to low-stress, non-rotating parts, PW selected the compressor stators and synch ring brackets 45 to roll out this new manufacturing technology for the first time. While AM is still playing a small role in the total number of parts in the jet engine manufacturing process, the return on investment can already be seen by the reduction in parts, the rapid production capabilities and the optimized design in terms of performance and cost . 46 As technology matured, several authors began to speculate that 3D printing could aid in sustainable development in the developing world. 47 In 2012, Filabot developed a system for closing the loop 48 with plastic and allows for any FDM or FFF 3D printer to be able to print with a wider range of plastics. In 2014, Benjamin S. Cook and Manos M. Tentzeris demonstrated the first multi-material, vertically integrated printed electronics additive manufacturing platform (VIPRE) which enabled 3D printing of functional electronics operating up to 40 GHz. 49 As the price of printers started to drop people interested in this technology had more access and freedom to make what they wanted. As of 2014, the price for commercial printers was still high with the cost being over $2,000. 50 The term 3D printing originally referred to a process that deposits a binder material onto a powder bed with inkjet printer heads layer by layer. More recently, the popular vernacular has started using the term to encompass a wider variety of additive-manufacturing techniques such as electron-beam additive manufacturing and selective laser melting. The United States and global technical standards use the official term additive manufacturing for this broader sense. The most commonly used 3D printing process (46% as of 2018 update ) is a material extrusion technique called fused deposition modeling , or FDM. 8 While FDM technology was invented after the other two most popular technologies, stereolithography (SLA) and selective laser sintering (SLS), FDM is typically the most inexpensive of the three by a large margin, citation needed which lends to the popularity of the process. 2020s As of 2020, 3D printers have reached the level of quality and price that allows most people to enter the world of 3D printing. In 2020 decent quality printers can be found for less than US$200 for entry-level machines. These more affordable printers are usually fused deposition modeling (FDM) printers. 51 In November 2021 a British patient named Steve Verze received the world's first fully 3D-printed prosthetic eye from the Moorfields Eye Hospital in London . 52 53 In April 2024, the world's largest 3D printer, the Factory of the Future 1.0 was revealed at the University of Maine . It is able to make objects 96 feet long, or 29 meters. 54 In 2024, researchers used machine learning to improve the construction of synthetic bone 55 and set a record for shock absorption. 56 In July 2024, researchers published a paper in Advanced Materials Technologies describing the development of artificial blood vessels using 3D-printing technology, which are as strong and durable as natural blood vessels . 57 The process involved using a rotating spindle integrated into a 3D printer to create grafts from a water-based gel, which were then coated in biodegradable polyester molecules. 57 Benefits of 3D printing Additive manufacturing or 3D printing has rapidly gained importance in the field of engineering due to its many benefits. The vision of 3D printing is design freedom, individualization, 58 decentralization 59 and executing processes that were previously impossible through alternative methods. 60 Some of these benefits include enabling faster prototyping, reducing manufacturing costs, increasing product customization, and improving product quality. 61 Furthermore, the capabilities of 3D printing have extended beyond traditional manufacturing, like lightweight construction, 62 or repair and maintenance 63 with applications in prosthetics, 64 bioprinting, 65 food industry, 66 rocket building, 67 design and art 68 and renewable energy systems. 69 3D printing technology can be used to produce battery energy storage systems, which are essential for sustainable energy generation and distribution. Another benefit of 3D printing is the technology's ability to produce complex geometries with high precision and accuracy. 70 This is particularly relevant in the field of microwave engineering, where 3D printing can be used to produce components with unique properties that are difficult to achieve using traditional manufacturing methods. 71 Additive Manufacturing processes generate minimal waste by adding material only where needed, unlike traditional methods that cut away excess material. 72 This reduces both material costs and environmental impact. 73 This reduction in waste also lowers energy consumption for material production and disposal, contributing to a smaller carbon footprint . 74 75 General principles Modeling Main article: 3D modeling CAD model used for 3D printing 3D models can be generated from 2D pictures taken at a 3D photo booth. 3D printable models may be created with a computer-aided design (CAD) package, via a 3D scanner , or by a plain digital camera and photogrammetry software . 3D printed models created with CAD result in relatively fewer errors than other methods. Errors in 3D printable models can be identified and corrected before printing. 76 The manual modeling process of preparing geometric data for 3D computer graphics is similar to plastic arts such as sculpting. 3D scanning is a process of collecting digital data on the shape and appearance of a real object, and creating a digital model based on it. CAD models can be saved in the stereolithography file format (STL) , a de facto CAD file format for additive manufacturing that stores data based on triangulations of the surface of CAD models. STL is not tailored for additive manufacturing because it generates large file sizes of topology-optimized parts and lattice structures due to the large number of surfaces involved. A newer CAD file format, the additive manufacturing file format (AMF) , was introduced in 2011 to solve this problem. It stores information using curved triangulations. 77 Printing Before printing a 3D model from an STL file, it must first be examined for errors. Most CAD applications produce errors in output STL files, 78 79 of the following types: holes faces normals self-intersections noise shells manifold errors 80 overhang issues 81 A step in the STL generation known as repair fixes such problems in the original model. 82 83 Generally, STLs that have been produced from a model obtained through 3D scanning often have more of these errors 84 as 3D scanning is often achieved by point to point acquisition/mapping. 3D reconstruction often includes errors. 85 Once completed, the STL file needs to be processed by a piece of software called a slicer , which converts the model into a series of thin layers and produces a G-code file containing instructions tailored to a specific type of 3D printer ( FDM printers ). 86 This G-code file can then be printed with 3D printing client software (which loads the G-code and uses it to instruct the 3D printer during the 3D printing process). Printer resolution describes layer thickness and X–Y resolution in dots per inch (dpi) or micrometers (μm). Typical layer thickness is around 100 μm (250 DPI ) , although some machines can print layers as thin as 16 μm (1,600 DPI) . 87 X–Y resolution is comparable to that of laser printers . The particles (3D dots) are around 0.01 to 0.1 μm (2,540,000 to 250,000 DPI) in diameter. 88 For that printer resolution, specifying a mesh resolution of 0.01–0.03 mm and a chord length ≤ 0.016 mm generates an optimal STL output file for a given model input file. 89 Specifying higher resolution results in larger files without increase in print quality. 3:30 timelapse of an 80-minute video of an object being made out of PLA using molten polymer deposition Construction of a model with contemporary methods can take anywhere from several hours to several days, depending on the method used and the size and complexity of the model. Additive systems can typically reduce this time to a few hours, although it varies widely depending on the type of machine used and the size and number of models being produced simultaneously. Finishing Though the printer-produced resolution and surface finish are sufficient for some applications, post-processing and finishing methods allow for benefits such as greater dimensional accuracy, smoother surfaces, and other modifications such as coloration. The surface finish of a 3D-printed part can improved using subtractive methods such as sanding and bead blasting. When smoothing parts that require dimensional accuracy, it is important to take into account the volume of the material being removed. 90 Some printable polymers, such as acrylonitrile butadiene styrene (ABS), allow the surface finish to be smoothed and improved using chemical vapor processes 91 based on acetone or similar solvents. Some additive manufacturing techniques can benefit from annealing as a post-processing step. Annealing a 3D-printed part allows for better internal layer bonding due to recrystallization of the part. It allows for an increase in mechanical properties, some of which are fracture toughness , 92 flexural strength , 93 impact resistance , 94 and heat resistance . 94 Annealing a component may not be suitable for applications where dimensional accuracy is required, as it can introduce warpage or shrinkage due to heating and cooling. 95 Additive or subtractive hybrid manufacturing (ASHM) is a method that involves producing a 3D printed part and using machining (subtractive manufacturing) to remove material. 96 Machining operations can be completed after each layer, or after the entire 3D print has been completed depending on the application requirements. These hybrid methods allow for 3D-printed parts to achieve better surface finishes and dimensional accuracy. 97 The layered structure of traditional additive manufacturing processes leads to a stair-stepping effect on part-surfaces that are curved or tilted with respect to the building platform. The effect strongly depends on the layer height used, as well as the orientation of a part surface inside the building process. 98 This effect can be minimized using variable layer heights or adaptive layer heights . These methods decrease the layer height in places where higher quality is needed. 99 Painting a 3D-printed part offers a range of finishes and appearances that may not be achievable through most 3D printing techniques. The process typically involves several steps, such as surface preparation, priming , and painting. 100 These steps help prepare the surface of the part and ensuring the paint adheres properly. Some additive manufacturing techniques are capable of using multiple materials simultaneously. These techniques are able to print in multiple colors and color combinations simultaneously and can produce parts that may not necessarily require painting. Some printing techniques require internal supports to be built to support overhanging features during construction. These supports must be mechanically removed or dissolved if using a water-soluble support material such as PVA after completing a print. Some commercial metal 3D printers involve cutting the metal component off the metal substrate after deposition. A new process for the GMAW 3D printing allows for substrate surface modifications to remove aluminium 101 or steel . 102 Materials Detail of the Stoofbrug nl in Amsterdam, the world's first 3D-printed metal bridge 103 Traditionally, 3D printing focused on polymers for printing, due to the ease of manufacturing and handling polymeric materials. However, the method has rapidly evolved to not only print various polymers 104 but also metals, 105 106 chocolates, 107 and ceramics , 108 making 3D printing a versatile option for manufacturing. Layer-by-layer fabrication of three-dimensional physical models is a modern concept that stems from the ever-growing CAD industry, more specifically the solid modeling side of CAD. Before solid modeling was introduced in the late 1980s, three-dimensional models were created with wire frames and surfaces. 109 but in all cases the layers of materials are controlled by the printer and the material properties. The three-dimensional material layer is controlled by the deposition rate as set by the printer operator and stored in a computer file. The earliest printed patented material was a hot melt type ink for printing patterns using a heated metal alloy. Charles Hull filed the first patent on August 8, 1984, to use a UV-cured acrylic resin using a UV-masked light source at UVP Corp to build a simple model. The SLA-1 was the first SL product announced by 3D Systems at Autofact Exposition, Detroit, November 1978. The SLA-1 Beta shipped in Jan 1988 to Baxter Healthcare, Pratt and Whitney, General Motors and AMP. The first production SLA-1 shipped to Precision Castparts in April 1988. The UV resin material changed over quickly to an epoxy-based material resin. In both cases, SLA-1 models needed UV oven curing after being rinsed in a solvent cleaner to remove uncured boundary resin. A post cure apparatus (PCA) was sold with all systems. The early resin printers required a blade to move fresh resin over the model on each layer. The layer thickness was 0.006 inches and the HeCd laser model of the SLA-1 was 12 watts and swept across the surface at 30 inch per second. UVP was acquired by 3D Systems in January 1990. 110 A review of the history shows that a number of materials (resins, plastic powder, plastic filament and hot-melt plastic ink) were used in the 1980s for patents in the rapid prototyping field. Masked lamp UV-cured resin was also introduced by Cubital's Itzchak Pomerantz in the Soldier 5600, Carl Deckard's (DTM) laser sintered thermoplastic powders, and adhesive-laser cut paper (LOM) stacked to form objects by Michael Feygin before 3D Systems made its first announcement. Scott Crump was also working with extruded melted plastic filament modeling (FDM) and drop deposition had been patented by William E Masters a week after Hull's patent in 1984, but he had to discover thermoplastic inkjets, introduced by Visual Impact Corporation 3D printer in 1992, using inkjets from Howtek, Inc., before he formed BPM to bring out his own 3D printer product in 1994. 110 The most common polymers for personal 3D printers are polylactic acid (PLA) and PETG . Multi-material 3D printing Main article: Multi-material 3D printing A multi-material 3DBenchy Efforts to achieve multi-material 3D printing range from enhanced FDM-like processes like VoxelJet to novel voxel-based printing technologies like layered assembly. 111 A drawback of many existing 3D printing technologies is that they only allow one material to be printed at a time, limiting many potential applications that require the integration of different materials in the same object. Multi-material 3D printing solves this problem by allowing objects of complex and heterogeneous arrangements of materials to be manufactured using a single printer. Here, a material must be specified for each voxel (or 3D printing pixel element) inside the final object volume. The process can be fraught with complications, however, due to the isolated and monolithic algorithms. Some commercial devices have sought to solve these issues, such as building a Spec2Fab translator, but the progress is still very limited. 112 Nonetheless, in the medical industry, a concept of 3D-printed pills and vaccines has been presented. 113 With this new concept, multiple medications can be combined, which is expected to decrease many risks. With more and more applications of multi-material 3D printing, the costs of daily life and high technology development will become inevitably lower. Metallographic materials of 3D printing is also being researched. 114 By classifying each material, CIMP-3D can systematically perform 3D printing with multiple materials. 115 4D printing Main article: 4D printing Using 3D printing and multi-material structures in additive manufacturing has allowed for the design and creation of what is called 4D printing. 4D printing is an additive manufacturing process in which the printed object changes shape with time, temperature, or some other type of stimulation. 4D printing allows for the creation of dynamic structures with adjustable shapes, properties or functionality. The smart/stimulus-responsive materials that are created using 4D printing can be activated to create calculated responses such as self-assembly, self-repair, multi-functionality, reconfiguration and shape-shifting. This allows for customized printing of shape-changing and shape-memory materials. 116 4D printing has the potential to find new applications and uses for materials (plastics, composites, metals, etc.) and has the potential to create new alloys and composites that were not viable before. The versatility of this technology and materials can lead to advances in multiple fields of industry, including space, commercial and medical fields. The repeatability, precision, and material range for 4D printing must increase to allow the process to become more practical throughout these industries. To become a viable industrial production option, there are a few challenges that 4D printing must overcome. The challenges of 4D printing include the fact that the microstructures of these printed smart materials must be close to or better than the parts obtained through traditional machining processes. New and customizable materials need to be developed that have the ability to consistently respond to varying external stimuli and change to their desired shape. There is also a need to design new software for the various technique types of 4D printing. The 4D printing software will need to take into consideration the base smart material, printing technique, and structural and geometric requirements of the design. 117 Processes and printers Main article: 3D printing processes html body.mediawiki This section should include only a brief summary of 3D printing processes . See Wikipedia:Summary style for information on how to properly incorporate it into this article's main text. ( August 2017 ) ISO/ASTM52900-15 defines seven categories of additive manufacturing (AM) processes within its meaning. 118 119 They are: Vat photopolymerization Material jetting Binder jetting Powder bed fusion Material extrusion Directed energy deposition Sheet lamination The main differences between processes are in the way layers are deposited to create parts and in the materials that are used. Each method has its own advantages and drawbacks, which is why some companies offer a choice of powder and polymer for the material used to build the object. 120 Others sometimes use standard, off-the-shelf business paper as the build material to produce a durable prototype. The main considerations in choosing a machine are generally speed, costs of the 3D printer, of the printed prototype, choice and cost of the materials, and color capabilities. 121 Printers that work directly with metals are generally expensive. However, less expensive printers can be used to make a mold, which is then used to make metal parts. 122 Material jetting The first process where three-dimensional material is deposited to form an object was done with material jetting 28 or as it was originally called particle deposition. Particle deposition by inkjet first started with continuous inkjet technology (CIT) (1950s) and later with drop-on-demand inkjet technology (1970s) using hot-melt inks. Wax inks were the first three-dimensional materials jetted and later low-temperature alloy metal was jetted with CIT. Wax and thermoplastic hot melts were jetted next by DOD. Objects were very small and started with text characters and numerals for signage. An object must have form and can be handled. Wax characters tumbled off paper documents and inspired a liquid metal recorder patent to make metal characters for signage in 1971. Thermoplastic color inks (CMYK) were printed with layers of each color t",
  "cached_at": "2025-10-25T20:04:04.261955"
}