{
  "title": "Adversarial machine learning",
  "summary": "Adversarial machine learning is the study of the attacks on machine learning algorithms, and of the defenses against such attacks. A survey from May 2020 revealed practitioners' common feeling for better protection of machine learning systems in industrial applications.",
  "content": "Adversarial machine learning Research field that lies at the intersection of machine learning and computer security .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} Not to be confused with Generative adversarial network . .mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol>li{counter-increment:listitem}.mw-parser-output .hlist ol>li::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol>li:first-child::before,.mw-parser-output .hlist dt ol>li:first-child::before,.mw-parser-output .hlist li ol>li:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"} .mw-parser-output .sidebar{width:22em;float:right;clear:right;margin:0.5em 0 1em 1em;background:var(--background-color-neutral-subtle,#f8f9fa);border:1px solid var(--border-color-base,#a2a9b1);padding:0.2em;text-align:center;line-height:1.4em;font-size:88%;border-collapse:collapse;display:table}body.skin-minerva .mw-parser-output .sidebar{display:table!important;float:right!important;margin:0.5em 0 1em 1em!important}.mw-parser-output .sidebar-subgroup{width:100%;margin:0;border-spacing:0}.mw-parser-output .sidebar-left{float:left;clear:left;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-none{float:none;clear:both;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-outer-title{padding:0 0.4em 0.2em;font-size:125%;line-height:1.2em;font-weight:bold}.mw-parser-output .sidebar-top-image{padding:0.4em}.mw-parser-output .sidebar-top-caption,.mw-parser-output .sidebar-pretitle-with-top-image,.mw-parser-output .sidebar-caption{padding:0.2em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-pretitle{padding:0.4em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-title,.mw-parser-output .sidebar-title-with-pretitle{padding:0.2em 0.8em;font-size:145%;line-height:1.2em}.mw-parser-output .sidebar-title-with-pretitle{padding:0.1em 0.4em}.mw-parser-output .sidebar-image{padding:0.2em 0.4em 0.4em}.mw-parser-output .sidebar-heading{padding:0.1em 0.4em}.mw-parser-output .sidebar-content{padding:0 0.5em 0.4em}.mw-parser-output .sidebar-content-with-subgroup{padding:0.1em 0.4em 0.2em}.mw-parser-output .sidebar-above,.mw-parser-output .sidebar-below{padding:0.3em 0.8em;font-weight:bold}.mw-parser-output .sidebar-collapse .sidebar-above,.mw-parser-output .sidebar-collapse .sidebar-below{border-top:1px solid #aaa;border-bottom:1px solid #aaa}.mw-parser-output .sidebar-navbar{text-align:right;font-size:115%;padding:0 0.4em 0.4em}.mw-parser-output .sidebar-list-title{padding:0 0.4em;text-align:left;font-weight:bold;line-height:1.6em;font-size:105%}.mw-parser-output .sidebar-list-title-c{padding:0 0.4em;text-align:center;margin:0 3.3em}@media(max-width:640px){body.mediawiki .mw-parser-output .sidebar{width:100%!important;clear:both;float:none!important;margin-left:0!important;margin-right:0!important}}body.skin--responsive .mw-parser-output .sidebar a>img{max-width:none!important}@media screen{html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media print{body.ns-0 .mw-parser-output .sidebar{display:none!important}} .mw-parser-output .nobold{font-weight:normal} Part of a series on Machine learning and data mining Paradigms Supervised learning Unsupervised learning Semi-supervised learning Self-supervised learning Reinforcement learning Meta-learning Online learning Batch learning Curriculum learning Rule-based learning Neuro-symbolic AI Neuromorphic engineering Quantum machine learning Problems Classification Generative modeling Regression Clustering Dimensionality reduction Density estimation Anomaly detection Data cleaning AutoML Association rules Semantic analysis Structured prediction Feature engineering Feature learning Learning to rank Grammar induction Ontology learning Multimodal learning Supervised learning ( classification • regression ) Apprenticeship learning Decision trees Ensembles Bagging Boosting Random forest k -NN Linear regression Naive Bayes Artificial neural networks Logistic regression Perceptron Relevance vector machine (RVM) Support vector machine (SVM) Clustering BIRCH CURE Hierarchical k -means Fuzzy Expectation–maximization (EM) DBSCAN OPTICS Mean shift Dimensionality reduction Factor analysis CCA ICA LDA NMF PCA PGD t-SNE SDL Structured prediction Graphical models Bayes net Conditional random field Hidden Markov Anomaly detection RANSAC k -NN Local outlier factor Isolation forest Neural networks Autoencoder Deep learning Feedforward neural network Recurrent neural network LSTM GRU ESN reservoir computing Boltzmann machine Restricted GAN Diffusion model SOM Convolutional neural network U-Net LeNet AlexNet DeepDream Neural field Neural radiance field Physics-informed neural networks Transformer Vision Mamba Spiking neural network Memtransistor Electrochemical RAM (ECRAM) Reinforcement learning Q-learning Policy gradient SARSA Temporal difference (TD) Multi-agent Self-play Learning with humans Active learning Crowdsourcing Human-in-the-loop Mechanistic interpretability RLHF Model diagnostics Coefficient of determination Confusion matrix Learning curve ROC curve Mathematical foundations Kernel machines Bias–variance tradeoff Computational learning theory Empirical risk minimization Occam learning PAC learning Statistical learning VC theory Topological deep learning Journals and conferences AAAI ECML PKDD NeurIPS ICML ICLR IJCAI ML JMLR Related articles Glossary of artificial intelligence List of datasets for machine-learning research List of datasets in computer vision and image processing Outline of machine learning .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:\"[ \"}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:\" ]\"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}html.skin-theme-clientpref-night .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}@media(prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}}@media print{.mw-parser-output .navbar{display:none!important}} v t e Adversarial machine learning is the study of the attacks on machine learning algorithms, and of the defenses against such attacks. [ 1 ] A survey from May 2020 revealed practitioners' common feeling for better protection of machine learning systems in industrial applications. [ 2 ] Machine learning techniques are mostly designed to work on specific problem sets, under the assumption that the training and test data are generated from the same statistical distribution ( IID ). However, this assumption is often dangerously violated in practical high-stake applications, where users may intentionally supply fabricated data that violates the statistical assumption. Most common attacks in adversarial machine learning include evasion attacks , [ 3 ] data poisoning attacks , [ 4 ] Byzantine attacks [ 5 ] and model extraction. [ 6 ] History At the MIT Spam Conference in January 2004, John Graham-Cumming showed that a machine-learning spam filter could be used to defeat another machine-learning spam filter by automatically learning which words to add to a spam email to get the email classified as not spam. [ 7 ] In 2004, Nilesh Dalvi and others noted that linear classifiers used in spam filters could be defeated by simple \" evasion attacks\" as spammers inserted \"good words\" into their spam emails. (Around 2007, some spammers added random noise to fuzz words within \"image spam\" in order to defeat OCR -based filters.) In 2006, Marco Barreno and others published \"Can Machine Learning Be Secure?\", outlining a broad taxonomy of attacks. As late as 2013 many researchers continued to hope that non-linear classifiers (such as support vector machines and neural networks ) might be robust to adversaries, until Battista Biggio and others demonstrated the first gradient-based attacks on such machine-learning models (2012 [ 8 ] –2013 [ 9 ] ). In 2012, deep neural networks began to dominate computer vision problems; starting in 2014, Christian Szegedy and others demonstrated that deep neural networks could be fooled by adversaries, again using a gradient-based attack to craft adversarial perturbations. [ 10 ] [ 11 ] Recently, it was observed that adversarial attacks are harder to produce in the practical world due to the different environmental constraints that cancel out the effect of noise. [ 12 ] [ 13 ] For example, any small rotation or slight illumination on an adversarial image can destroy the adversariality. In addition, researchers such as Google Brain's Nick Frosst point out that it is much easier to make self-driving cars [ 14 ] miss stop signs by physically removing the sign itself, rather than creating adversarial examples. [ 15 ] Frosst also believes that the adversarial machine learning community incorrectly assumes models trained on a certain data distribution will also perform well on a completely different data distribution. He suggests that a new approach to machine learning should be explored, and is currently working on a unique neural network that has characteristics more similar to human perception than state-of-the-art approaches. [ 15 ] While adversarial machine learning continues to be heavily rooted in academia, large tech companies such as Google, Microsoft, and IBM have begun curating documentation and open source code bases to allow others to concretely assess the robustness of machine learning models and minimize the risk of adversarial attacks. [ 16 ] [ 17 ] [ 18 ] Examples Examples include attacks in spam filtering , where spam messages are obfuscated through the misspelling of \"bad\" words or the insertion of \"good\" words; [ 19 ] [ 20 ] attacks in computer security , such as obfuscating malware code within network packets or modifying the characteristics of a network flow to mislead intrusion detection; [ 21 ] [ 22 ] attacks in biometric recognition where fake biometric traits may be exploited to impersonate a legitimate user; [ 23 ] or to compromise users' template galleries that adapt to updated traits over time. Researchers showed that by changing only one-pixel it was possible to fool deep learning algorithms. [ 24 ] Others 3-D printed a toy turtle with a texture engineered to make Google's object detection AI classify it as a rifle regardless of the angle from which the turtle was viewed. [ 25 ] Creating the turtle required only low-cost commercially available 3-D printing technology. [ 26 ] A machine-tweaked image of a dog was shown to look like a cat to both computers and humans. [ 27 ] A 2019 study reported that humans can guess how machines will classify adversarial images. [ 28 ] Researchers discovered methods for perturbing the appearance of a stop sign such that an autonomous vehicle classified it as a merge or speed limit sign. [ 14 ] [ 29 ] A data poisoning filter called Nightshade was released in 2023 by researchers at the University of Chicago . It was created for use by visual artists to put on their artwork to corrupt the data set of text-to-image models , which usually scrape their data from the internet without the consent of the image creator. [ 30 ] [ 31 ] McAfee attacked Tesla 's former Mobileye system, fooling it into driving 50 mph over the speed limit, simply by adding a two-inch strip of black tape to a speed limit sign. [ 32 ] [ 33 ] Adversarial patterns on glasses or clothing designed to deceive facial-recognition systems or license-plate readers, have led to a niche industry of \"stealth streetwear\". [ 34 ] An adversarial attack on a neural network can allow an attacker to inject algorithms into the target system. [ 35 ] Researchers can also create adversarial audio inputs to disguise commands to intelligent assistants in benign-seeming audio; [ 36 ] a parallel literature explores human perception of such stimuli. [ 37 ] [ 38 ] Clustering algorithms are used in security applications. Malware and computer virus analysis aims to identify malware families, and to generate specific detection signatures. [ 39 ] [ 40 ] Attack modalities Taxonomy Attacks against (supervised) machine learning algorithms have been categorized along three primary axes: [ 41 ] influence on the classifier, the security violation and their specificity. Classifier influence: An attack can influence the classifier by disrupting the classification phase. This may be preceded by an exploration phase to identify vulnerabilities. The attacker's capabilities might be restricted by the presence of data manipulation constraints. [ 42 ] Security violation: An attack can supply malicious data that gets classified as legitimate. Malicious data supplied during training can cause legitimate data to be rejected after training. Specificity: A targeted attack attempts to allow a specific intrusion/disruption. Alternatively, an indiscriminate attack creates general mayhem. This taxonomy has been extended into a more comprehensive threat model that allows explicit assumptions about the adversary's goal, knowledge of the attacked system, capability of manipulating the input data/system components, and on attack strategy. [ 43 ] [ 44 ] This taxonomy has further been extended to include dimensions for defense strategies against adversarial attacks. [ 45 ] Strategies Below are some of the most commonly encountered attack scenarios. Data poisoning Poisoning consists of contaminating the training dataset with data designed to increase errors in the output. Given that learning algorithms are shaped by their training datasets, poisoning can effectively reprogram algorithms with potentially malicious intent. Concerns have been raised especially for user-generated training data, e.g. for content recommendation or natural language models. The ubiquity of fake accounts offers many opportunities for poisoning. Facebook reportedly removes around 7 billion fake accounts per year. [ 46 ] [ 47 ] Poisoning has been reported as the leading concern for industrial applications. [ 2 ] On social medias, disinformation campaigns attempt to bias recommendation and moderation algorithms, to push certain content over others. A particular case of data poisoning is the backdoor attack, [ 48 ] which aims to teach a specific behavior for inputs with a given trigger, e.g. a small defect on images, sounds, videos or texts. AI training data poisoning illustration, showing how models can learn to associate given terms with wrong concepts due to data poisoning [ 49 ] For instance, intrusion detection systems are often trained using collected data. An attacker may poison this data by injecting malicious samples during operation that subsequently disrupt retraining. [ 43 ] [ 44 ] [ 41 ] [ 50 ] [ 51 ] Data poisoning techniques can also be applied to text-to-image models to alter their output, which is used by artists to defend their copyrighted works or their artistic style against imitation. [ 52 ] Data poisoning can also happen unintentionally through model collapse , where models are trained on synthetic data. [ 53 ] Byzantine attacks As machine learning is scaled, it often relies on multiple computing machines. In federated learning , for instance, edge devices collaborate with a central server, typically by sending gradients or model parameters. However, some of these devices may deviate from their expected behavior, e.g. to harm the central server's model [ 54 ] or to bias algorithms towards certain behaviors (e.g., amplifying the recommendation of disinformation content). On the other hand, if the training is performed on a single machine, then the model is very vulnerable to a failure of the machine, or an attack on the machine; the machine is a single point of failure . [ 55 ] In fact, the machine owner may themselves insert provably undetectable backdoors . [ 56 ] The current leading solutions to make (distributed) learning algorithms provably resilient to a minority of malicious (a.k.a. Byzantine ) participants are based on robust gradient aggregation rules. [ 57 ] [ 58 ] [ 59 ] [ 60 ] [ 61 ] [ 62 ] The robust aggregation rules do not always work especially when the data across participants has a non-iid distribution. Nevertheless, in the context of heterogeneous honest participants, such as users with different consumption habits for recommendation algorithms or writing styles for language models, there are provable impossibility theorems on what any robust learning algorithm can guarantee. [ 5 ] [ 63 ] Evasion Evasion attacks [ 9 ] [ 43 ] [ 44 ] [ 64 ] consist of exploiting the imperfection of a trained model. For instance, spammers and hackers often attempt to evade detection by obfuscating the content of spam emails and malware . Samples are modified to evade detection; that is, to be classified as legitimate. This does not involve influence over the training data. A clear example of evasion is image-based spam in which the spam content is embedded within an attached image to evade textual analysis by anti-spam filters. Another example of evasion is given by spoofing attacks against biometric verification systems. [ 23 ] Evasion attacks can be generally split into two different categories: black box attacks and white box attacks . [ 17 ] Model extraction Model extraction involves an adversary probing a black box machine learning system in order to extract the data it was trained on. [ 65 ] [ 66 ] This can cause issues when either the training data or the model itself is sensitive and confidential. For example, model extraction could be used to extract a proprietary stock trading model which the adversary could then use for their own financial benefit. In the extreme case, model extraction can lead to model stealing , which corresponds to extracting a sufficient amount of data from the model to enable the complete reconstruction of the model. On the other hand, membership inference is a targeted model extraction attack, which infers the owner of a data point, often by leveraging the overfitting resulting from poor machine learning practices. [ 67 ] Concerningly, this is sometimes achievable even without knowledge or access to a target model's parameters, raising security concerns for models trained on sensitive data, including but not limited to medical records and/or personally identifiable information. With the emergence of transfer learning and public accessibility of many state of the art machine learning models, tech companies are increasingly drawn to create models based on public ones, giving attackers freely accessible information to the structure and type of model being used. [ 67 ] Categories Adversarial attacks and training in linear models There is a growing literature about adversarial attacks in linear models. Indeed, since the seminal work from Goodfellow at al. [ 68 ] studying these models in linear models has been an important tool to understand how adversarial attacks affect machine learning models. The analysis of these models is simplified because the computation of adversarial attacks can be simplified in linear regression and classification problems. Moreover, adversarial training is convex in this case. [ 69 ] Linear models allow for analytical analysis while still reproducing phenomena observed in state-of-the-art models. One prime example of that is how this model can be used to explain the trade-off between robustness and accuracy. [ 70 ] Diverse work indeed provides analysis of adversarial attacks in linear models, including asymptotic analysis for classification [ 71 ] and for linear regression. [ 72 ] [ 73 ] And, finite-sample analysis based on Rademacher complexity. [ 74 ] A result from studying adversarial attacks in linear models is that it closely relates to regularization . [ 75 ] Under certain conditions, it has been shown that adversarial training of a linear regression model with input perturbations restricted by the infinity-norm closely resembles Lasso regression, and that adversarial training of a linear regression model with input perturbations restricted by the 2-norm closely resembles Ridge regression . Adversarial deep reinforcement learning Adversarial deep reinforcement learning is an active area of research in reinforcement learning focusing on vulnerabilities of learned policies. In this research area, some studies initially showed that reinforcement learning policies are susceptible to imperceptible adversarial manipulations. [ 76 ] [ 77 ] While some methods have been proposed to overcome these susceptibilities, in the most recent studies it has been shown that these proposed solutions are far from providing an accurate representation of current vulnerabilities of deep reinforcement learning policies. [ 78 ] Adversarial natural language processing Adversarial attacks on speech recognition have been introduced for speech-to-text applications, in particular for Mozilla's implementation of DeepSpeech. [ 79 ] Specific attack types There are a large variety of different adversarial attacks that can be used against machine learning systems. Many of these work on both deep learning systems as well as traditional machine learning models such as SVMs [ 8 ] and linear regression . [ 80 ] A high level sample of these attack types include: Adversarial Examples [ 81 ] Trojan Attacks / Backdoor Attacks [ 82 ] Model Inversion [ 83 ] Membership Inference [ 84 ] Adversarial examples An adversarial example refers to specially crafted input that is designed to look \"normal\" to humans but causes misclassification to a machine learning model. Often, a form of specially designed \"noise\" is used to elicit the misclassifications. Below are some current techniques for generating adversarial examples in the literature (by no means an exhaustive list). Gradient-based evasion attack [ 9 ] Fast Gradient Sign Method (FGSM) [ 85 ] Projected Gradient Descent (PGD) [ 86 ] Carlini and Wagner (C&amp;W) attack [ 87 ] Adversarial patch attack [ 88 ] Black box attacks Black box attacks in adversarial machine learning assume that the adversary can only get outputs for provided inputs and has no knowledge of the model structure or parameters. [ 17 ] [ 89 ] In this case, the adversarial example is generated either using a model created from scratch, or without any model at all (excluding the ability to query the original model). In either case, the objective of these attacks is to create adversarial examples that are able to transfer to the black box model in question. [ 90 ] Simple Black-box Adversarial Attacks Simple Black-box Adversarial Attacks is a query-efficient way to attack black-box image classifiers. [ 91 ] Take a random orthonormal basis v 1 , v 2 , … , v d {\\displaystyle v_{1},v_{2},\\dots ,v_{d}} in R d {\\displaystyle \\mathbb {R} ^{d}} . The authors suggested the discrete cosine transform of the standard basis (the pixels). For a correctly classified image x {\\displaystyle x} , try x + ϵ v 1 , x − ϵ v 1 {\\displaystyle x+\\epsilon v_{1},x-\\epsilon v_{1}} , and compare the amount of error in the classifier upon x + ϵ v 1 , x , x − ϵ v 1 {\\displaystyle x+\\epsilon v_{1},x,x-\\epsilon v_{1}} . Pick the one that causes the largest amount of error. Repeat this for v 2 , v 3 , … {\\displaystyle v_{2},v_{3},\\dots } until the desired level of error in the classifier is reached. It was discovered when the authors designed a simple baseline to compare with a previous black-box adversarial attack algorithm based on gaussian processes , and were surprised that the baseline worked even better. [ 92 ] Square Attack The Square Attack was introduced in 2020 as a black box evasion adversarial attack based on querying classification scores without the need of gradient information. [ 93 ] As a score based black box attack, this adversarial approach is able to query probability distributions across model output classes, but has no other access to the model itself. According to the paper's authors, the proposed Square Attack required fewer queries than when compared to state-of-the-art score-based black box attacks at the time. [ 93 ] To describe the function objective, the attack defines the classifier as f : [ 0 , 1 ] d → R K {\\textstyle f:[0,1]^{d}\\rightarrow \\mathbb {R} ^{K}} , with d {\\textstyle d} representing the dimensions of the input and K {\\textstyle K} as the total number of output classes. f k ( x ) {\\textstyle f_{k}(x)} returns the score (or a probability between 0 and 1) that the input x {\\textstyle x} belongs to class k {\\textstyle k} , which allows the classifier's class output for any input x {\\textstyle x} to be defined as argmax k = 1 , . . . , K f k ( x ) {\\textstyle {\\text{argmax}}_{k=1,...,K}f_{k}(x)} . The goal of this attack is as follows: [ 93 ] argmax k = 1 , . . . , K f k ( x ^ ) ≠ y , | | x ^ − x | | p ≤ ϵ and x ^ ∈ [ 0 , 1 ] d {\\displaystyle {\\text{argmax}}_{k=1,...,K}f_{k}({\\hat {x}})\\neq y,||{\\hat {x}}-x||_{p}\\leq \\epsilon {\\text{ and }}{\\hat {x}}\\in [0,1]^{d}} In other words, finding some perturbed adversarial example x ^ {\\textstyle {\\hat {x}}} such that the classifier incorrectly classifies it to some other class under the constraint that x ^ {\\textstyle {\\hat {x}}} and x {\\textstyle x} are similar. The paper then defines loss L {\\textstyle L} as L ( f ( x ^ ) , y ) = f y ( x ^ ) − max k ≠ y f k ( x ^ ) {\\textstyle L(f({\\hat {x}}),y)=f_{y}({\\hat {x}})-\\max _{k\\neq y}f_{k}({\\hat {x}})} and proposes the solution to finding adversarial example x ^ {\\textstyle {\\hat {x}}} as solving the below constrained optimization problem : [ 93 ] min x ^ ∈ [ 0 , 1 ] d L ( f ( x ^ ) , y ) , s.t. | | x ^ − x | | p ≤ ϵ {\\displaystyle \\min _{{\\hat {x}}\\in [0,1]^{d}}L(f({\\hat {x}}),y),{\\text{ s.t. }}||{\\hat {x}}-x||_{p}\\leq \\epsilon } The result in theory is an adversarial example that is highly confident in the incorrect class but is also very similar to the original image. To find such example, Square Attack utilizes the iterative random search technique to randomly perturb the image in hopes of improving the objective function. In each step, the algorithm perturbs only a small square section of pixels, hence the name Square Attack, which terminates as soon as an adversarial example is found in order to improve query efficiency. Finally, since the attack algorithm uses scores and not gradient information, the authors of the paper indicate that this approach is not affected by gradient masking, a common technique formerly used to prevent evasion attacks. [ 93 ] HopSkipJump Attack This black box attack was also proposed as a query efficient attack, but one that relies solely on access to any input's predicted output class. In other words, the HopSkipJump attack does not require the ability to calculate gradients or access to score values like the Square Attack, and will require just the model's class prediction output (for any given input). The proposed attack is split into two different settings, targeted and untargeted, but both are built from the general idea of adding minimal perturbations that leads to a different model output. In the targeted setting, the goal is to cause the model to misclassify the perturbed image to a specific target label (that is not the original label). In the untargeted setting, the goal is to cause the model to misclassify the perturbed image to any label that is not the original label. The attack objectives for both are as follows where x {\\textstyle x} is the original image, x ′ {\\textstyle x^{\\prime }} is the adversarial image, d {\\textstyle d} is a distance function between images, c ∗ {\\textstyle c^{*}} is the target label, and C {\\textstyle C} is the model's classification class label function: [ 94 ] Targeted: min x ′ d ( x ′ , x ) subject to C ( x ′ ) = c ∗ {\\displaystyle {\\textbf {Targeted:}}\\min _{x^{\\prime }}d(x^{\\prime },x){\\text{ subject to }}C(x^{\\prime })=c^{*}} Untargeted: min x ′ d ( x ′ , x ) subject to C ( x ′ ) ≠ C ( x ) {\\displaystyle {\\textbf {Untargeted:}}\\min _{x^{\\prime }}d(x^{\\prime },x){\\text{ subject to }}C(x^{\\prime })\\neq C(x)} To solve this problem, the attack proposes the following boundary function S {\\textstyle S} for both the untargeted and targeted setting: [ 94 ] S ( x ′ ) := { max c ≠ C ( x ) F ( x ′ ) c − F ( x ′ ) C ( x ) , (Untargeted) F ( x ′ ) c ∗ − max c ≠ c ∗ F ( x ′ ) c , (Targeted) {\\displaystyle S(x^{\\prime }):={\\begin{cases}\\max _{c\\neq C(x)}{F(x^{\\prime })_{c}}-F(x^{\\prime })_{C(x)},&amp;{\\text{(Untargeted)}}\\\\F(x^{\\prime })_{c^{*}}-\\max _{c\\neq c^{*}}{F(x^{\\prime })_{c}},&amp;{\\text{(Targeted)}}\\end{cases}}} This can be further simplified to better visualize the boundary between different potential adversarial examples: [ 94 ] 0 \\\\iff \\\\begin{cases} argmax_cF(x^\\\\prime) \\\\neq C(x) , &amp; \\\\text{(Untargeted)} \\\\\\\\ argmax_cF(x^\\\\prime) = c^*, &amp; \\\\text{(Targeted)} \\\\end{cases} \"}}' id=\"mwApc\"> 0\\iff {\\begin{cases}argmax_{c}F(x^{\\prime })\\neq C(x),&amp;{\\text{(Untargeted)}}\\\\argmax_{c}F(x^{\\prime })=c^{*},&amp;{\\text{(Targeted)}}\\end{cases}}}\"> S ( x ′ ) > 0 ⟺ { a r g m a x c F ( x ′ ) ≠ C ( x ) , (Untargeted) a r g m a x c F ( x ′ ) = c ∗ , (Targeted) {\\displaystyle S(x^{\\prime })>0\\iff {\\begin{cases}argmax_{c}F(x^{\\prime })\\neq C(x),&amp;{\\text{(Untargeted)}}\\\\argmax_{c}F(x^{\\prime })=c^{*},&amp;{\\text{(Targeted)}}\\end{cases}}} 0\\iff {\\begin{cases}argmax_{c}F(x^{\\prime })\\neq C(x),&amp;{\\text{(Untargeted)}}\\\\argmax_{c}F(x^{\\prime })=c^{*},&amp;{\\text{(Targeted)}}\\end{cases}}}\"/> With this boundary function, the attack then follows an iterative algorithm to find adversarial examples x ′ {\\textstyle x^{\\prime }} for a given image x {\\textstyle x} that satisfies the attack objectives. Initialize x {\\textstyle x} to some point where 0\"}}' id=\"mwAp4\"> 0}\"> S ( x ) > 0 {\\textstyle S(x)>0} 0}\"/> Iterate below Boundary search Gradient update Compute the gradient Find the step size Boundary search uses a modified binary search to find the point in which the boundary (as defined by S {\\textstyle S} ) intersects with the line between x {\\textstyle x} and x ′ {\\textstyle x^{\\prime }} . The next step involves calculating the gradient for x {\\textstyle x} , and update the original x {\\textstyle x} using this gradient and a pre-chosen step size. HopSkipJump authors prove that this iterative algorithm will converge, leading x {\\textstyle x} to a point right along the boundary that is very close in distance to the original image. [ 94 ] However, since HopSkipJump is a proposed black box attack and the iterative algorithm above requires the calculation of a gradient in the second iterative step (which black box attacks do not have access to), the authors propose a solution to gradient calculation that requires only the model's output predictions alone. [ 94 ] By generating many random vectors in all directions, denoted as u b {\\textstyle u_{b}} , an approximation of the gradient can be calculated using the average of these random vectors weighted by the sign of the boundary function on the image x ′ + δ u b {\\textstyle x^{\\prime }+\\delta _{u_{b}}} , where δ u b {\\textstyle \\delta _{u_{b}}} is the size of the random vector perturbation: [ 94 ] ∇ S ( x ′ , δ ) ≈ 1 B ∑ b = 1 B ϕ ( x ′ + δ u b ) u b {\\displaystyle \\nabla S(x^{\\prime },\\delta )\\approx {\\frac {1}{B}}\\sum _{b=1}^{B}\\phi (x^{\\prime }+\\delta _{u_{b}})u_{b}} The result of the equation above gives a close approximation of the gradient required in step 2 of the iterative algorithm, completing HopSkipJump as a black box attack. [ 95 ] [ 96 ] [ 94 ] White box attacks White box attacks assumes that the adversary has access to model parameters on top of being able to get labels for provided inputs. [ 90 ] Fast gradient sign method One of the first proposed attacks for generating adversarial examples was proposed by Google researchers Ian J. Goodfellow , Jonathon Shlens, and Christian Szegedy. [ 97 ] The attack was called fast gradient sign method (FGSM), and it consists of adding a linear amount of in-perceivable noise to the image and causing a model to incorrectly classify it. This noise is calculated by multiplying the sign of the gradient with respect to the image we want to perturb by a small constant epsilon. As epsilon increases, the model is more likely to be fooled, but the perturbations become easier to identify as well. Shown below is the equation to generate an adversarial example where x {\\textstyle x} is the original image, ϵ {\\textstyle \\epsilon } is a very small number, Δ x {\\textstyle \\Delta _{x}} is the gradient function, J {\\textstyle J} is the loss function, θ {\\textstyle \\theta } is the model weights, and y {\\textstyle y} is the true label. [ 98 ] a d v x = x + ϵ ⋅ s i g n ( Δ x J ( θ , x , y ) ) {\\displaystyle adv_{x}=x+\\epsilon \\cdot sign(\\Delta _{x}J(\\theta ,x,y))} One important property of this equation is that the gradient is calculated with respect to the input image since the goal is to generate an image that maximizes the loss for the original image of true label y {\\textstyle y} . In traditional gradient descent (for model training), the gradient is used to update the weights of the model since the goal is to minimize the loss for the model on a ground truth dataset. The Fast Gradient Sign Method was proposed as a fast way to generate adversarial examples to evade the model, based on the hypothesis that neural networks cannot resist even linear amounts of perturbation to the input. [ 99 ] [ 98 ] [ 97 ] FGSM has shown to be effective in adversarial attacks for image classification and skeletal action recognition. [ 100 ] Carlini &amp; Wagner (C&amp;W) In an effort to analyze existing adversarial attacks and defenses, researchers at the University of California, Berkeley, Nicholas Carlini and David Wagner in 2016 propose a faster and more robust method to generate adversarial examples. [ 101 ] The attack proposed by Carlini and Wagner begins with trying to solve a difficult non-linear optimization equation: [ 66 ] min ( | | δ | | p ) subject to C ( x + δ ) = t , x + δ ∈ [ 0 , 1 ] n {\\displaystyle \\min(||\\delta ||_{p}){\\text{ subject to }}C(x+\\delta )=t,x+\\delta \\in [0,1]^{n}} Here the objective is to minimize the noise ( δ {\\textstyle \\delta } ), added to the original input x {\\textstyle x} , such that the machine learning algorithm ( C {\\textstyle C} ) predicts the original input with delta (or x + δ {\\textstyle x+\\delta } ) as some other class t {\\textstyle t} . However instead of directly the above equation, Carlini and Wagner propose using a new function f {\\textstyle f} such that: [ 66 ] C ( x + δ ) = t ⟺ f ( x + δ ) ≤ 0 {\\displaystyle C(x+\\delta )=t\\iff f(x+\\delta )\\leq 0} This condenses the first equation to the problem below: [ 66 ] min ( | | δ | | p ) subject to f ( x + δ ) ≤ 0 , x + δ ∈ [ 0 , 1 ] n {\\displaystyle \\min(||\\delta ||_{p}){\\text{ subject to }}f(x+\\delta )\\leq 0,x+\\delta \\in [0,1]^{n}} and even more to the equation below: [ 66 ] min ( | | δ | | p + c ⋅ f ( x + δ ) ) , x + δ ∈ [ 0 , 1 ] n {\\displaystyle \\min(||\\delta ||_{p}+c\\cdot f(x+\\delta )),x+\\delta \\in [0,1]^{n}} Carlini and Wagner then propose the use of the below function in place of f {\\textstyle f} using Z {\\textstyle Z} , a function that determines class probabilities for given input x {\\textstyle x} . When substituted in, this equation can be thought of as finding a target class that is more confident than the next likeliest class by some constant amount: [ 66 ] f ( x ) = ( [ max i ≠ t Z ( x ) i ] − Z ( x ) t ) + {\\displaystyle f(x)=([\\max _{i\\neq t}Z(x)_{i}]-Z(x)_{t})^{+}} When solved using gradient descent, this equation is able to produce stronger adversarial examples when compared to fast gradient sign method that is also able to bypass defensive distillation, a defense that was once proposed to be effective against adversarial examples. [ 102 ] [ 103 ] [ 101 ] [ 66 ] Defenses Conceptual representation of the proactive arms race [ 44 ] [ 40 ] Researchers have proposed a multi-step approach to protecting machine learning. [ 11 ] Threat modeling – Formalize the attackers goals and capabilities with respect to the target system. Attack simulation – Formalize the optimization problem the attacker tries to solve according to possible attack strategies. Attack impact evaluation Countermeasure design Noise detection (For evasion based attack) [ 104 ] Information laundering – Alter the information received by adversaries (for model stealing attacks) [ 66 ] Mechanisms A number of defense mechanisms against evasion, poisoning, and privacy attacks have been proposed, including: Secure learning algorithms [ 20 ] [ 105 ] [ 106 ] Byzantine-resilient algorithms [ 57 ] [ 5 ] Multiple classifier systems [ 19 ] [ 107 ] AI-written algorithms. [ 35 ] AIs that explore the training environment; for example, in image recognition, actively navigating a 3D environment rather than passively scanning a fixed set of 2D images. [ 35 ] Privacy-preserving learning [ 44 ] [ 108 ] Ladder algorithm for Kaggle -style competitions Game theoretic models [ 109 ] [ 110 ] [ 111 ] Sanitizing training data Adversarial training [ 85 ] [ 22 ] Backdoor detection algorithms [ 112 ] Gradient masking/obfuscation techniques: to prevent the adversary exploiting the gradient in white-box attacks. This family of defenses is deemed unreliable as these models are still vulnerable to black-box attacks or can be circumvented in other ways. [ 113 ] Ensembles of models have been proposed in literature, which have shown to be ineffective against evasion attacks [ 114 ] but effective against data poisoning attacks. [ 115 ] See also Pattern recognition Fawkes (image cloaking software) Generative adversarial network References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ↑ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} Kianpour, Mazaher; Wen, Shao-Fang (2020). \"Timing Attacks on Machine Learning: State of the Art\". Intelligent Systems and Applications . Advances in Intelligent Systems and Computing. Vol. 1037. pp. 111– 125. doi : 10.1007/978-3-030-29516-5_10 . ISBN 978-3-030-29515-8 . S2CID 201705926 . 1 2 Siva Kumar, Ram Shankar; Nyström, Magnus; Lambert, John; Marshall, Andrew; Goertzel, Mario; Comissoneru, Andi; Swann, Matt; Xia, Sharon (May 2020). \"Adversarial Machine Learning-Industry Perspectives\". 2020 IEEE Security and Privacy Workshops (SPW) . pp. 69– 75. doi : 10.1109/SPW50608.2020.00028 . ISBN 978-1-7281-9346-5 . S2CID 229357721 . ↑ Goodfellow, Ian; McDaniel, Patrick; Papernot, Nicolas (25 June 2018). \"Making machine learning robust against adversarial inputs\" . Communications of the ACM . 61 (7): 56– 66. doi : 10.1145/3134599 . ISSN 0001-0782 . [ permanent dead link ] ↑ Geiping, Jonas; Fowl, Liam H.; Huang, W. Ronny; Czaja, Wojciech; Taylor, Gavin; Moeller, Michael; Goldstein, Tom (2020-09-28). Witches' Brew: Industrial Scale Data Poisoning via Gradient Matching . International Conference on Learning Representations 2021 (Poster). 1 2 3 El-Mhamdi, El Mahdi; Farhadkhani, Sadegh; Guerraoui, Rachid; Guirguis, Arsany; Hoang, Lê-Nguyên; Rouault, Sébastien (2021-12-06). \"Collaborative Learning in the Jungle (Decentralized, Byzantine, Heterogeneous, Asynchronous and Nonconvex Learning)\" . Advances in Neural Information Processing Systems . 34 . arXiv : 2008.00742 . ↑ Tramèr, Florian; Zhang, Fan; Juels, Ari; Reiter, Michael K.; Ristenpart, Thomas (2016). Stealing Machine Learning Models via Prediction {APIs} . 25th USENIX Security Symposium. pp. 601– 618. ISBN 978-1-931971-32-4 . ↑ \"How to beat an adaptive/Bayesian spam filter (2004)\" . Retrieved 2023-07-05 . 1 2 Biggio, Battista; Nelson, Blaine; Laskov, Pavel (2013-03-25). \"Poisoning Attacks against Support Vector Machines\". arXiv : 1206.6389 [ cs.LG ]. 1 2 3 Biggio, Battista; Corona, Igino; Maiorca, Davide; Nelson, Blaine; Srndic, Nedim; Laskov, Pavel; Giacinto, Giorgio; Roli, Fabio (2013). \"Evasion Attacks against Machine Learning at Test Time\". Advanced Information Systems Engineering . Lecture Notes in Computer Science. Vol. 7908. Springer. pp. 387– 402. arXiv : 1708.06131 . doi : 10.1007/978-3-642-40994-3_25 . ISBN 978-3-642-38708-1 . S2CID 18716873 . ↑ Szegedy, Christian; Zaremba, Wojciech; Sutskever, Ilya; Bruna, Joan; Erhan, Dumitru; Goodfellow, Ian; Fergus, Rob (2014-02-19). \"Intriguing properties of neural networks\". arXiv : 1312.6199 [ cs.CV ]. 1 2 Biggio, Battista; Roli, Fabio (December 2018). \"Wild patterns: Ten years after the rise of adversarial machine learning\". Pattern Recognition . 84 : 317– 331. arXiv : 1712.03141 . Bibcode : 2018PatRe..84..317B . doi : 10.1016/j.patcog.2018.07.023 . S2CID 207324435 . ↑ Kurakin, Alexey; Goodfellow, Ian; Bengio, Samy (2016). \"Adversarial examples in the physical world\". arXiv : 1607.02533 [ cs.CV ]. ↑ Gupta, Kishor Datta, Dipankar Dasgupta, and Zahid Akhtar. \"Applicability issues of Evasion-Based Adversarial Attacks and Mitigation Techniques.\" 2020 IEEE Symposium Series on Computational Intelligence (SSCI). 2020. 1 2 Lim, Hazel Si Min; Taeihagh, Araz (2019). \"Algorithmic Decision-Making in AVs: Understanding Ethical and Technical Concerns for Smart Cities\" . Sustainability . 11 (20): 5791. arXiv : 1910.13122 . Bibcode : 2019arXiv191013122L . doi : 10.3390/su11205791 . S2CID 204951009 . 1 2 \"Google Brain's Nicholas Frosst on Adversarial Examples and Emotional Responses\" . Synced . 2019-11-21 . Retrieved 2021-10-23 . ↑ \"Responsible AI practices\" . Google AI . Retrieved 2021-10-23 . 1 2 3 Adversarial Robustness Toolbox (ART) v1.8 , Trusted-AI, 2021-10-23 , retrieved 2021-10-23 ↑ amarshal. \"Failure Modes in Machine Learning - Security documentation\" . docs.microsoft.com . Retrieved 2021-10-23 . 1 2 Biggio, Battista; Fumera, Giorgio; Roli, Fabio (2010). \"Multiple classifier systems for robust classifier design in adversarial environments\" . International Journal of Machine Learning and Cybernetics . 1 ( 1– 4): 27– 41. doi : 10.1007/s13042-010-0007-7 . hdl : 11567/1087824 . ISSN 1868-8071 . S2CID 8729381 . Archived from the original on 2023-01-19 . Retrieved 2015-01-14 . 1 2 Brückner, Michael; Kanzow, Christian; Scheffer, Tobias (2012). \"Static Prediction Games for Adversarial Learning Problems\" (PDF) . Journal of Machine Learning Research . 13 (Sep): 2617– 2654. ISSN 1533-7928 . ↑ Apruzzese, Giovanni; Andreolini, Mauro; Ferretti, Luca; Marchetti, Mirco; Colajanni, Michele (2021-06-03). \"Modeling Realistic Adversarial Attacks against Network Intrusion Detection Systems\". Digital Threats: Research and Practice . 3 (3): 1– 19. arXiv : 2106.09380 . doi : 10.1145/3469659 . ISSN 2692-1626 . S2CID 235458519 . 1 2 Vitorino, João; Oliveira, Nuno; Praça, Isabel (March 2022). \"Adaptative Perturbation Patterns: Realistic Adversarial Learning for Robust Intrusion Detection\" . Future Internet . 14 (4): 108. arXiv : 2203.04234 . doi : 10.3390/fi14040108 . hdl : 10400.22/21851 . ISSN 1999-5903 . 1 2 Rodrigues, Ricardo N.; Ling, Lee Luan; Govindaraju, Venu (1 June 2009). \"Robustness of multimodal biometric fusion methods against spoof attacks\" (PDF) . Journal of Visual Languages &amp; Computing . 20 (3): 169– 179. doi : 10.1016/j.jvlc.2009.01.010 . ISSN 1045-926X . ↑ Su, Jiawei; Vargas, Danilo Vasconcellos; Sakurai, Kouichi (October 2019). \"One Pixel Attack for Fooling Deep Neural Networks\". IEEE Transactions on Evolutionary Computation . 23 (5): 828– 841. arXiv : 1710.08864 . Bibcode : 2019ITEC...23..828S . doi : 10.1109/TEVC.2019.2890858 . ISSN 1941-0026 . S2CID 2698863 . ↑ \"Single pixel change fools AI programs\" . BBC News . 3 November 2017 . Retrieved 12 February 2018 . ↑ Athalye, Anish; Engstrom, Logan; Ilyas, Andrew; Kwok, Kevin (2017). \"Synthesizing Robust Adversarial Examples\". arXiv : 1707.07397 [ cs.CV ]. ↑ \"AI Has a Hallucination Problem That's Proving Tough to Fix\" . WIRED . 2018 . Retrieved 10 ",
  "cached_at": "2025-10-25T19:39:25.276334"
}