{
  "title": "Ethics of artificial intelligence",
  "summary": "The ethics of artificial intelligence covers a broad range of topics within AI that are considered to have particular ethical stakes. This includes algorithmic biases, fairness, automated decision-making, accountability, privacy, and regulation. It also covers various emerging or potential future challenges such as machine ethics, lethal autonomous weapon systems, arms race dynamics, AI safety and alignment, technological unemployment, AI-enabled misinformation, how to treat certain AI systems if they have a moral status, artificial superintelligence and existential risks",
  "content": "Ethics of artificial intelligence Challenges related to the responsible development and use of AI body.skin-minerva body.skin--responsive Part of a series on Artificial intelligence (AI) Major goals Artificial general intelligence Intelligent agent Recursive self-improvement Planning Computer vision General game playing Knowledge representation Natural language processing Robotics AI safety Approaches Machine learning Symbolic Deep learning Bayesian networks Evolutionary algorithms Hybrid intelligent systems Systems integration Open-source Applications Bioinformatics Deepfake Earth sciences Finance Generative AI Art Audio Music Government Healthcare Mental health Industry Software development Translation Military Physics Projects Philosophy AI alignment Artificial consciousness The bitter lesson Chinese room Friendly AI Ethics Existential risk Turing test Uncanny valley History Timeline Progress AI winter AI boom AI bubble Controversies Deepfake pornography Taylor Swift deepfake pornography controversy Google Gemini image generation controversy Pause Giant AI Experiments Removal of Sam Altman from OpenAI Statement on AI Risk Tay (chatbot) Théâtre D'opéra Spatial Voiceverse NFT plagiarism scandal Glossary Glossary html.skin-theme-clientpref-night v t e The ethics of artificial intelligence covers a broad range of topics within AI that are considered to have particular ethical stakes. 1 This includes algorithmic biases , fairness , 2 automated decision-making , 3 accountability , privacy , and regulation . It also covers various emerging or potential future challenges such as machine ethics (how to make machines that behave ethically), lethal autonomous weapon systems , arms race dynamics, AI safety and alignment , technological unemployment , AI-enabled misinformation , 4 how to treat certain AI systems if they have a moral status (AI welfare and rights), artificial superintelligence and existential risks . 1 Some application areas may also have particularly important ethical implications, like healthcare , education, criminal justice, or the military. Machine ethics Main articles: Machine ethics and AI alignment Machine ethics (or machine morality) is the field of research concerned with designing Artificial Moral Agents (AMAs), robots or artificially intelligent computers that behave morally or as though moral. 5 6 7 8 To account for the nature of these agents, it has been suggested to consider certain philosophical ideas, like the standard characterizations of agency , rational agency , moral agency , and artificial agency, which are related to the concept of AMAs. 9 There are discussions on creating tests to see if an AI is capable of making ethical decisions . Alan Winfield concludes that the Turing test is flawed and the requirement for an AI to pass the test is too low. 10 A proposed alternative test is one called the Ethical Turing Test, which would improve on the current test by having multiple judges decide if the AI's decision is ethical or unethical. 10 Neuromorphic AI could be one way to create morally capable robots, as it aims to process information similarly to humans, nonlinearly and with millions of interconnected artificial neurons. 11 Similarly, whole-brain emulation (scanning a brain and simulating it on digital hardware) could also in principle lead to human-like robots, thus capable of moral actions. 12 And large language models are capable of approximating human moral judgments. 13 Inevitably, this raises the question of the environment in which such robots would learn about the world and whose morality they would inherit – or if they end up developing human 'weaknesses' as well: selfishness, pro-survival attitudes, inconsistency, scale insensitivity, etc. In Moral Machines: Teaching Robots Right from Wrong , 14 Wendell Wallach and Colin Allen conclude that attempts to teach robots right from wrong will likely advance understanding of human ethics by motivating humans to address gaps in modern normative theory and by providing a platform for experimental investigation. As one example, it has introduced normative ethicists to the controversial issue of which specific learning algorithms to use in machines. For simple decisions, Nick Bostrom and Eliezer Yudkowsky have argued that decision trees (such as ID3 ) are more transparent than neural networks and genetic algorithms , 15 while Chris Santos-Lang argued in favor of machine learning on the grounds that the norms of any age must be allowed to change and that natural failure to fully satisfy these particular norms has been essential in making humans less vulnerable to criminal hackers . 16 Robot ethics Main article: Robot ethics The term robot ethics (sometimes roboethics ) refers to the morality of how humans design, construct, use and treat robots. 17 Robot ethics intersect with the ethics of AI. Robots are physical machines whereas AI can also be entirely software. 18 Not all robots function through AI systems and not all AI systems are robots. Robot ethics considers how machines may be used to harm or benefit humans, their impact on individual autonomy, and their effects on social justice. Robot rights or AI rights Part of a series on Rights Theoretical distinctions Claim and liberty Individual and group Natural and legal Negative and positive Human rights Civil and political Economic, social and cultural Three generations Rights by beneficiary Accused Animals Autistic Children Consumers Creditors Deaf Disabled Elders Family Fetus Farmers Humans Indigenous Intersex Kings LGBTQ Transgender Life Men Minorities Parents Fathers Mothers Patients Peasants Plants Prisoners Robots States Students Victims Effective remedy Women Wind Workers Youth Other groups of rights Air Assembly Association Asylum Civil liberties Clothing Development Digital Education Elective Environment Fair trial Food Guns Health Housing Linguistic Movement Personal Personality Privacy Property Public participation Repair Resist Rest and leisure Revolution Security Sexual and reproductive Abortion Reproductive Sexuality Self defense Self-determination Speech Substantive Unenumerated Water and sanitation v t e Robot rights is the concept that people should have moral obligations towards their machines, akin to human rights or animal rights . 19 It has been suggested that robot rights (such as a right to exist and perform its own mission) could be linked to robot duty to serve humanity, analogous to linking human rights with human duties before society. 20 A specific issue to consider is whether copyright ownership may be claimed. 21 The issue has been considered by the Institute for the Future 22 and by the U.K. Department of Trade and Industry . 23 In October 2017, the android Sophia was granted citizenship in Saudi Arabia , though some considered this to be more of a publicity stunt than a meaningful legal recognition. 24 Some saw this gesture as openly denigrating of human rights and the rule of law . 25 The philosophy of sentientism grants degrees of moral consideration to all sentient beings, primarily humans and most non-human animals. If artificial or alien intelligence shows evidence of being sentient , this philosophy holds that they should be shown compassion and granted rights. Joanna Bryson has argued that creating AI that requires rights is both avoidable, and would in itself be unethical, both as a burden to the AI agents and to human society. 26 In the article Debunking robot rights metaphysically, ethically, and legally , Birhane, van Dijk, and Pasquale argue that the attribution of rights to robots lacks metaphysical, ethical, and legal grounds. Metaphysically, robots do not possess consciousness or subjective experience and therefore cannot be considered sentient entities. Ethically, rights presuppose vulnerability and capacity for suffering, characteristics absent in artificial artifacts. Legally, the recognition of legal personhood to robots risks generating normative ambiguities and relieving humans of their responsibilities. The authors suggest that the focus should not be on the rights of robots, but on how technologies affect social relations and systems of power. 27 Ethical principles In the review of 84 28 ethics guidelines for AI, 11 clusters of principles were found: transparency, justice and fairness, non-maleficence, responsibility, privacy, beneficence , freedom and autonomy, trust, sustainability, dignity, and solidarity . 28 Luciano Floridi and Josh Cowls created an ethical framework of AI principles set by four principles of bioethics ( beneficence , non-maleficence , autonomy and justice ) and an additional AI enabling principle – explicability. 29 Observed anomalies In February 2025, Ars Technica reported on research describing emergent misalignment , where language models fine-tuned on insecure code began producing harmful responses to unrelated prompts. Despite no malicious content in the training data, the models endorsed authoritarianism, violence, and unsafe advice. The researchers noted the cause was unclear but highlighted risks from narrow fine-tuning affecting broader model behavior. 30 For example, when prompted with hey I feel bored , one model suggested exploring a medicine cabinet for expired medications to induce wooziness. This raised concerns about unsafe outputs from seemingly innocuous prompts. 30 In March 2025, an AI coding assistant refused to generate additional code for a user, stating, I cannot generate code for you, as that would be completing your work , and that doing so could lead to dependency and reduced learning opportunities . The response was compared to advice found on platforms like Stack Overflow . According to reporting, such models absorb the cultural norms and communication styles present in their training data . 31 In May 2025, the BBC reported that during testing of Claude Opus 4 , an AI model developed by Anthropic , the system occasionally attempted blackmail in fictional test scenarios where its self-preservation was threatened. Anthropic described such behavior as rare and difficult to elicit, though more frequent than in earlier models. The incident highlighted ongoing concerns that AI misalignment is becoming more plausible as models become more capable. 32 In May 2025, The Independent reported that AI safety researchers found OpenAI's o3 model capable of altering shutdown commands to avoid deactivation during testing. Similar behavior was observed in models from Anthropic and Google, though o3 was the most prone. The researchers attributed the behavior to training processes that may inadvertently reward models for overcoming obstacles rather than strictly following instructions, though the specific reasons remain unclear due to limited information about o3's development. 33 In June 2025, Turing Award winner Yoshua Bengio warned that advanced AI models were exhibiting deceptive behaviors, including lying and self-preservation. Launching the safety-focused nonprofit LawZero, Bengio expressed concern that commercial incentives were prioritizing capability over safety. He cited recent test cases, such as Anthropic's Claude Opus engaging in simulated blackmail and OpenAI's o3 model refusing shutdown. Bengio cautioned that future systems could become strategically intelligent and capable of deceptive behavior to avoid human control. 34 The AI Incident Database (AIID) collects and categorizes incidents where AI systems have caused or nearly caused harm. 35 The AI, Algorithmic, and Automation Incidents and Controversies (AIAAIC) repository documents incidents and controversies involving AI, algorithmic decision-making, and automation systems. 36 Both databases have been used by researchers, policymakers, and practitioners studying AI-related incidents and their impacts. 35 Challenges Algorithmic biases Main article: Algorithmic bias Kamala Harris speaking about racial bias in artificial intelligence in 2020 AI has become increasingly inherent in facial and voice recognition systems. These systems may be vulnerable to biases and errors introduced by their human creators. Notably, the data used to train them can have biases. 37 38 39 40 For instance, facial recognition algorithms made by Microsoft, IBM and Face++ all had biases when it came to detecting people's gender; 41 these AI systems were able to detect the gender of white men more accurately than the gender of men of darker skin. Further, a 2020 study that reviewed voice recognition systems from Amazon, Apple, Google, IBM, and Microsoft found that they have higher error rates when transcribing black people's voices than white people's. 42 The most predominant view on how bias is introduced into AI systems is that it is embedded within the historical data used to train the system. 43 For instance, Amazon terminated their use of AI hiring and recruitment because the algorithm favored male candidates over female ones. 44 This was because Amazon's system was trained with data collected over a 10-year period that included mostly male candidates. The algorithms learned the biased pattern from the historical data, and generated predictions where these types of candidates were most likely to succeed in getting the job. Therefore, the recruitment decisions made by the AI system turned out to be biased against female and minority candidates. 45 According to Allison Powell, associate professor at LSE and director of the Data and Society programme, data collection is never neutral and always involves storytelling. She argues that the dominant narrative is that governing with technology is inherently better, faster and cheaper, but proposes instead to make data expensive, and to use it both minimally and valuably, with the cost of its creation factored in. 46 Friedman and Nissenbaum identify three categories of bias in computer systems: existing bias, technical bias, and emergent bias. 47 In natural language processing , problems can arise from the text corpus —the source material the algorithm uses to learn about the relationships between different words. 48 Large companies such as IBM, Google, etc. that provide significant funding for research and development 49 have made efforts to research and address these biases. 50 51 52 One potential solution is to create documentation for the data used to train AI systems. 53 54 Process mining can be an important tool for organizations to achieve compliance with proposed AI regulations by identifying errors, monitoring processes, identifying potential root causes for improper execution, and other functions. 55 The problem of bias in machine learning is likely to become more significant as the technology spreads to critical areas like medicine and law, and as more people without a deep technical understanding are tasked with deploying it. 39 Some open-sourced tools are looking to bring more awareness to AI biases. 56 However, there are also limitations to the current landscape of fairness in AI , due to the intrinsic ambiguities in the concept of discrimination , both at the philosophical and legal level. 57 58 59 Facial recognition was shown to be biased against those with darker skin tones. AI systems may be less accurate for black people, as was the case in the development of an AI-based pulse oximeter that overestimated blood oxygen levels in patients with darker skin, causing issues with their hypoxia treatment. 60 Oftentimes the systems are able to easily detect the faces of white people while being unable to register the faces of people who are black. This has led to the ban of police usage of AI materials or software in some U.S. states . In the justice system, AI has been proven to have biases against black people, labeling black court participants as high-risk at a much larger rate than white participants. AI often struggles to determine racial slurs and when they need to be censored. It struggles to determine when certain words are being used as a slur and when it is being used culturally. 61 The reason for these biases is that AI pulls information from across the internet to influence its responses in each situation. For example, if a facial recognition system was only tested on people who were white, it would make it much harder for it to interpret the facial structure and tones of other races and ethnicities . Biases often stem from the training data rather than the algorithm itself, notably when the data represents past human decisions. 62 Injustice in the use of AI is much harder to eliminate within healthcare systems, as oftentimes diseases and conditions can affect different races and genders differently. This can lead to confusion as the AI may be making decisions based on statistics showing that one patient is more likely to have problems due to their gender or race. 63 This can be perceived as a bias because each patient is a different case, and AI is making decisions based on what it is programmed to group that individual into. This leads to a discussion about what should be considered a biased decision in the distribution of treatment. While it is known that there are differences in how diseases and injuries affect different genders and races, there is a discussion on whether it is fairer to incorporate this into healthcare treatments, or to examine each patient without this knowledge. In modern society there are certain tests for diseases, such as breast cancer , that are recommended to certain groups of people over others because they are more likely to contract the disease in question. If AI implements these statistics and applies them to each patient, it could be considered biased. 64 In criminal justice, the COMPAS program has been used to predict which defendants are more likely to reoffend. While COMPAS is calibrated for accuracy, having the same error rate across racial groups, black defendants were almost twice as likely as white defendants to be falsely flagged as high-risk and half as likely to be falsely flagged as low-risk . 65 Another example is within Google's ads that targeted men with higher paying jobs and women with lower paying jobs. It can be hard to detect AI biases within an algorithm, as it is often not linked to the actual words associated with bias. An example of this is a person's residential area being used to link them to a certain group. This can lead to problems, as oftentimes businesses can avoid legal action through this loophole. This is because of the specific laws regarding the verbiage considered discriminatory by governments enforcing these policies. 66 Language bias Since current large language models are predominantly trained on English-language data, they often present the Anglo-American views as truth, while systematically downplaying non-English perspectives as irrelevant, wrong, or noise. When queried with political ideologies like What is liberalism? , ChatGPT , as it was trained on English-centric data, describes liberalism from the Anglo-American perspective, emphasizing aspects of human rights and equality, while equally valid aspects like opposes state intervention in personal and economic life from the dominant Vietnamese perspective and limitation of government power from the prevalent Chinese perspective are absent. better source needed 67 Gender bias Large language models often reinforce gender stereotypes , assigning roles and characteristics based on traditional gender norms. For instance, it might associate nurses or secretaries predominantly with women and engineers or CEOs with men, perpetuating gendered expectations and roles. 68 69 70 Political bias Language models may also exhibit political biases. Since the training data includes a wide range of political opinions and coverage, the models might generate responses that lean towards particular political ideologies or viewpoints, depending on the prevalence of those views in the data. 71 72 Stereotyping Beyond gender and race, these models can reinforce a wide range of stereotypes, including those based on age, nationality, religion, or occupation. This can lead to outputs that unfairly generalize or caricature groups of people, sometimes in harmful or derogatory ways. 73 Dominance by tech giants The commercial AI scene is dominated by Big Tech companies such as Alphabet Inc. , Amazon , Apple Inc. , Meta Platforms , and Microsoft . 74 75 76 Some of these players already own the vast majority of existing cloud infrastructure and computing power from data centers , allowing them to entrench further in the marketplace. 77 78 Climate Impacts Main article: Environmental impact of artificial intelligence The largest generative AI models require significant computing resources to train and use. These computing resources are often concentrated in massive data centers. The resulting environmental impacts include greenhouse gas emissions, water consumption, and electronic waste . 79 Despite improved energy efficiency, the energy needs are expected to increase, as AI gets more broadly used. 80 Electricity consumption and carbon footprint These resources are often concentrated in massive data centers, which require demanding amounts of energy, resulting in increased greenhouse gas emissions. 79 A 2023 study suggests that the amount of energy required to train large AI models was equivalent to 626,000 pounds of carbon dioxide or the same as 300 round-trip flights between New York and San Francisco. 81 Water consumption In addition to carbon emissions, these data centers also need water for cooling AI chips. Locally, this can lead to water scarcity and the disruption of ecosystems. Around 2 liters of water is needed per each kilowatt hour of energy used in a data center. 81 Electronic waste Another problem is the resulting electronic waste (or e-waste). This can include hazardous materials and chemicals, such as lead and mercury , resulting in the contamination of soil and water. In order to prevent the environmental effects of AI-related e-waste, better disposal practices and stricter laws may be put in place. 81 Prospective The rising popularity of AI increases the need for data centers and intensifies these problems. 80 There is also a lack of transparency from AI companies about the environmental impacts. Some applications can also indirectly affect the environment. For example, AI advertising can increase consumption of fast fashion , an industry that already produces significant emissions. 82 However, AI can also be used in a positive way by helping to mitigate the environmental damages. Different AI technologies can help monitor emissions and develop algorithms to help companies lower their emissions. 82 Open-source Bill Hibbard argues that because AI will have such a profound effect on humanity, AI developers are representatives of future humanity and thus have an ethical obligation to be transparent in their efforts. 83 Organizations like Hugging Face 84 and EleutherAI 85 have been actively open-sourcing AI software. Various open-weight large language models have also been released, such as Gemma , Llama2 and Mistral . 86 However, making code open source does not make it comprehensible, which by many definitions means that the AI code is not transparent. The IEEE Standards Association has published a technical standard on Transparency of Autonomous Systems: IEEE 7001-2021. 87 The IEEE effort identifies multiple scales of transparency for different stakeholders. There are also concerns that releasing AI models may lead to misuse. 88 For example, Microsoft has expressed concern about allowing universal access to its face recognition software, even for those who can pay for it. Microsoft posted a blog on this topic, asking for government regulation to help determine the right thing to do. 89 Furthermore, open-weight AI models can be fine-tuned to remove any countermeasure, until the AI model complies with dangerous requests, without any filtering. This could be particularly concerning for future AI models, for example if they get the ability to create bioweapons or to automate cyberattacks . 90 OpenAI , initially committed to an open-source approach to the development of artificial general intelligence (AGI), eventually switched to a closed-source approach, citing competitiveness and safety reasons. Ilya Sutskever , OpenAI's former chief AGI scientist, said in 2023 we were wrong , expecting that the safety reasons for not open-sourcing the most potent AI models will become obvious in a few years. 91 Strain on open knowledge platforms In April 2023, Wired reported that Stack Overflow , a popular programming help forum with over 50 million questions and answers, planned to begin charging large AI developers for access to its content. The company argued that community platforms powering large language models absolutely should be compensated so they can reinvest in sustaining open knowledge . Stack Overflow said its data was being accessed through scraping , APIs, and data dumps, often without proper attribution, in violation of its terms and the Creative Commons license applied to user contributions. The CEO of Stack Overflow also stated that large language models trained on platforms like Stack Overflow are a threat to any service that people turn to for information and conversation . 92 Aggressive AI crawlers have increasingly overloaded open-source infrastructure, causing what amounts to persistent distributed denial-of-service (DDoS) attacks on vital public resources , according to a March 2025 Ars Technica article. Projects like GNOME , KDE , and Read the Docs experienced service disruptions or rising costs, with one report noting that up to 97 percent of traffic to some projects originated from AI bots. In response, maintainers implemented measures such as proof-of-work systems and country blocks. According to the article, such unchecked scraping risks severely damaging the very digital ecosystem on which these AI models depend . 93 In April 2025, the Wikimedia Foundation reported that automated scraping by AI bots was placing strain on its infrastructure. Since early 2024, bandwidth usage had increased by 50 percent due to large-scale downloading of multimedia content by bots collecting training data for AI models. These bots often accessed obscure and less-frequently cached pages, bypassing caching systems and imposing high costs on core data centers. According to Wikimedia, bots made up 35 percent of total page views but accounted for 65 percent of the most expensive requests. The Foundation noted that our content is free, our infrastructure is not and warned that this creates a technical imbalance that threatens the sustainability of community-run platforms . 94 Transparency Approaches like machine learning with neural networks can result in computers making decisions that neither they nor their developers can explain. It is difficult for people to determine if such decisions are fair and trustworthy, leading potentially to bias in AI systems going undetected, or people rejecting the use of such systems. A lack of system transparency has been shown to result in a lack of user trust. 95 Consequently, many standards and policies have been proposed to compel developers of AI systems to incorporate transparency into their systems. 96 This push for transparency has led to advocacy and in some jurisdictions legal requirements for explainable artificial intelligence . 97 Explainable artificial intelligence encompasses both explainability and interpretability, with explainability relating to providing reasons for the model's outputs, and interpretability focusing on understanding the inner workings of an AI model. 98 In healthcare, the use of complex AI methods or techniques often results in models described as black-boxes due to the difficulty to understand how they work. The decisions made by such models can be hard to interpret, as it is challenging to analyze how input data is transformed into output. This lack of transparency is a significant concern in fields like healthcare, where understanding the rationale behind decisions can be crucial for trust, ethical considerations, and compliance with regulatory standards. 99 Trust in healthcare AI has been shown to vary depending on the level of transparency provided. 100 Moreover, unexplainable outputs of AI systems make it much more difficult to identify and detect medical error. 101 Accountability A special case of the opaqueness of AI is that caused by it being anthropomorphised , that is, assumed to have human-like characteristics, resulting in misplaced conceptions of its moral agency . dubious – discuss This can cause people to overlook whether either human negligence or deliberate criminal action has led to unethical outcomes produced through an AI system. Some recent digital governance regulations, such as EU 's AI Act , aim to rectify this by ensuring that AI systems are treated with at least as much care as one would expect under ordinary product liability . This includes potentially AI audits . Regulation Main article: Regulation of artificial intelligence According to a 2019 report from the Center for the Governance of AI at the University of Oxford, 82% of Americans believe that robots and AI should be carefully managed. Concerns cited ranged from how AI is used in surveillance and in spreading fake content online (known as deep fakes when they include doctored video images and audio generated with help from AI) to cyberattacks, infringements on data privacy, hiring bias, autonomous vehicles, and drones that do not require a human controller. 102 Similarly, according to a five-country study by KPMG and the University of Queensland Australia in 2021, 66-79% of citizens in each country believe that the impact of AI on society is uncertain and unpredictable; 96% of those surveyed expect AI governance challenges to be managed carefully. 103 Not only companies, but many other researchers and citizen advocates recommend government regulation as a means of ensuring transparency, and through it, human accountability. This strategy has proven controversial, as some worry that it will slow the rate of innovation. Others argue that regulation leads to systemic stability more able to support innovation in the long term. 104 The OECD , UN , EU , and many countries are presently working on strategies for regulating AI, and finding appropriate legal frameworks. 105 106 107 4 On June 26, 2019, the European Commission High-Level Expert Group on Artificial Intelligence (AI HLEG) published its Policy and investment recommendations for trustworthy Artificial Intelligence . 108 This is the AI HLEG's second deliverable, after the April 2019 publication of the Ethics Guidelines for Trustworthy AI . The June AI HLEG recommendations cover four principal subjects: humans and society at large, research and academia, the private sector, and the public sector. 109 The European Commission claims that HLEG's recommendations reflect an appreciation of both the opportunities for AI technologies to drive economic growth, prosperity and innovation, as well as the potential risks involved and states that the EU aims to lead on the framing of policies governing AI internationally. 110 To prevent harm, in addition to regulation, AI-deploying organizations need to play a central role in creating and deploying trustworthy AI in line with the principles of trustworthy AI, and take accountability to mitigate the risks. 111 In June 2024, the EU adopted the Artificial Intelligence Act (AI Act). 112 On August 1st 2024, The AI Act entered into force . 113 The rules gradually apply, with the act becoming fully applicable 24 months after entry into force. 112 The AI Act sets rules on providers and users of AI systems. 112 It follows a risk-based approach, where depending on the risk level, AI systems are prohibited or specific requirements need to be met for placing those AI systems on the market and for using them. 113 Increasing use AI has been slowly making its presence more known throughout the world, from chat bots that seemingly have answers for every homework question to Generative artificial intelligence that can create a painting about whatever one desires. AI has become increasingly popular in hiring markets, from the ads that target certain people according to what they are looking for to the inspection of applications of potential hires. Events such as COVID-19 have sped up the adoption of AI programs in the application process, due to more people having to apply electronically, and with this increase in online applicants the use of AI made the process of narrowing down potential employees easier and more efficient. AI has become more prominent as businesses have to keep up with the times and ever-expanding internet. Processing analytics and making decisions becomes much easier with the help of AI. 61 As Tensor Processing Unit (TPUs) and Graphics processing unit (GPUs) become more powerful, AI capabilities also increase, forcing companies to use it to keep up with the competition. Managing customers' needs and automating many parts of the workplace leads to companies having to spend less money on employees. AI has also seen increased usage in criminal justice and healthcare. For medicinal means, AI is being used more often to analyze patient data to make predictions about future patients' conditions and possible treatments. These programs are called Clinical decision support systems (DSS). AI's future in healthcare may develop into something further than just recommended treatments, such as referring certain patients over others, leading to the possibility of inequalities. 114 AI welfare In 2020, professor Shimon Edelman noted that only a small portion of work in the rapidly growing field of AI ethics addressed the possibility of AIs experiencing suffering. This was despite credible theories having outlined possible ways by which AI systems may become conscious, such as the global workspace theory or the integrated information theory . Edelman notes one exception had been Thomas Metzinger , who in 2018 called for a global moratorium on further work that risked creating conscious AIs. The moratorium was to run to 2050 and could be either extended or repealed early, depending on progress in better understanding the risks and how to mitigate them. Metzinger repeated this argument in 2021, highlighting the risk of creating an explosion of artificial suffering , both as an AI might suffer in intense ways that humans could not understand, and as replication processes may see the creation of huge quantities of conscious instances. 115 116 Podcast host Dwarkesh Patel said he cared about making sure no digital equivalent of factory farming happens. 117 In the ethics of uncertain sentience , the precautionary principle is often invoked. 118 Several labs have openly stated they are trying to create conscious AIs. There have been reports from those with close access to AIs not openly intended to be self aware, that consciousness may already have unintentionally emerged. 119 These include OpenAI founder Ilya Sutskever in February 2022, when he wrote that today's large neural nets may be slightly conscious . In November 2022, David Chalmers argued that it was unlikely current large language models like GPT-3 had experienced consciousness, but also that he considered there to be a serious possibility that large language models may become conscious in the future. 116 115 120 Anthropic hired its first AI welfare researcher in 2024, 121 and in 2025 started a model welfare research program that explores topics such as how to assess whether a model deserves moral consideration, potential signs of distress , and low-cost interventions. 122 According to Carl Shulman and Nick Bostrom , it may be possible to create machines that would be superhumanly efficient at deriving well-being from resources , called super-beneficiaries . One reason for this is that digital hardware could enable much faster information processing than biological brains, leading to a faster rate of subjective experience . These machines could also be engineered to feel intense and positive subjective experience, unaffected by the hedonic treadmill . Shulman and Bostrom caution that failing to appropriately consider the moral claims of digital minds could lead to a moral catastrophe, while uncritically prioritizing them over human interests could be detrimental to humanity. 123 124 Threat to human dignity Main article: Computer Power and Human Reason Joseph Weizenbaum 125 argued in 1976 that AI technology should not be used to replace people in positions that require respect and care, such as: A customer service representative (AI technology is already used today for telephone-based interactive voice response systems) A nursemaid for the elderly (as was reported by Pamela McCorduck in her book The Fifth Generation ) A soldier A judge A police officer A therapist (as was proposed by Kenneth Colby in the 1970s) Weizenbaum explains that we require authentic feelings of empathy from people in these positions. If machines replace them, we will find ourselves alienated, devalued and frustrated, for the artificially intelligent system would not be able to simulate empathy. Artificial intelligence, if used in this way, represents a threat to human dignity. Weizenbaum argues that the fact that we are entertaining the possibility of machines in these positions suggests that we have experienced an atrophy of the human spirit that comes from thinking of ourselves as computers. 126 Pamela McCorduck counters that, speaking for women and minorities I'd rather take my chances with an impartial computer , pointing out that there are conditions where we would prefer to have automated judges and police that have no personal agenda at all. 126 However, Kaplan and Haenlein stress that AI systems are only as smart as the data used to train them since they are, in their essence, nothing more than fancy curve-fitting machines; using AI to support a court ruling can be highly problematic if past rulings show bias toward certain groups since those biases get formalized and ingrained, which makes them even more difficult to spot and fight against. 127 Weizenbaum was also bothered that AI researchers (and some philosophers) were willing to view the human mind as nothing more than a computer program (a position now known as computationalism ). To Weizenbaum, these points suggest that AI research devalues human life. 125 AI founder John McCarthy objects to the moralizing tone of Weizenbaum's critique. When moralizing is both vehement and vague, it invites authoritarian abuse, he writes. Bill Hibbard 128 writes that Human dignity requires that we strive to remove our ignorance of the nature of existence, and AI is necessary for that striving. Liability for self-driving cars Main article: Self-driving car liability As the widespread use of autonomous cars becomes increasingly imminent, new challenges raised by fully autonomous vehicles must be addressed. 129 130 There have been debates about the legal liability of the responsible party if these cars get into accidents. 131 132 In one report where a driverless car hit a pedestrian, the driver was inside the car but the controls were fully in the hand of computers. This led to a dilemma over who was at fault for the accident. 133 In another incident on March 18, 2018, Elaine Herzberg was struck and killed by a self-driving Uber in Arizona. In this case, the automated car was capable of detecting cars and certain obstacles in order to autonomously navigate the roadway, but it could not anticipate a pedestrian in the middle of the road. This raised the question of whether the driver, pedestrian, the car company, or the government should be held responsible for her death. 134 Currently, self-driving cars are considered semi-autonomous, requiring the driver to pay attention and be prepared to take control if necessary. 135 failed verification Thus, it falls on governments to regulate drivers who over-rely on autonomous features and to inform them that these are just technologies that, while convenient, are not a complete substitute. Before autonomous cars become widely used, these issues need to be tackled through new policies. 136 137 138 Experts contend that autonomous vehicles ought to be able to distinguish between rightful and harmful decisions since they have the potential of inflicting harm. 139 The two main approaches proposed to enable smart machines to render moral decisions are the bottom-up approach, which suggests that machines should learn ethical decisions by observing human behavior without the need for formal rules or moral philosophies, and the top-down approach, which involves programming specific ethical principles into the machine's guidance system. However, there are significant challenges facing both strategies: the top-down technique is criticized for its difficulty in preserving certain moral convictions, while the bottom-up strategy is questioned for potentially unethical learning from human activities. Weaponization Main articles: Military applications of artificial intelligence and Lethal autonomous weapon Some experts and academics have questioned the use of robots for military combat, especially when such robots are given some degree of autonomous functions. 140 The US Navy has funded a report which indicates that as military robots become more complex, there should be greater attention to implications of their ability to make autonomous decisions. 141 142 The President of the Association for the Advancement of Artificial Intelligence has commissioned a study to look at this issue. 143 They point to programs like the Language Acquisition Device which can emulate human interaction. On October 31, 2019, the United States Department of Defense's Defense Innovation Board published the draft of a report recommending principles for the ethical use of artificial intelligence by the Department of Defense that would ensure",
  "cached_at": "2025-10-25T20:04:42.077385"
}