{
  "title": "Blade Runner",
  "summary": "Blade Runner is a 1982 science fiction film directed by Ridley Scott from a screenplay by Hampton Fancher and David Peoples. Starring Harrison Ford, Rutger Hauer, Sean Young, and Edward James Olmos, it is an adaptation of Philip K. Dick's 1968 novel Do Androids Dream of Electric Sheep? The film is set in a dystopian future Los Angeles of 2019, in which synthetic humans known as replicants are bio-engineered by the powerful Tyrell Corporation to work on space colonies. When a fugitive group of advanced replicants led by Roy Batty (Hauer) escapes back to Earth, former cop Rick Deckard (Ford) reluctantly agrees to hunt them down.",
  "content": "Blade Runner 1982 film by Ridley Scott .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} This article is about the 1982 film. For the franchise based on the film, see Blade Runner (franchise) . For other uses, see Blade Runner (disambiguation) . &lt;a href=\\\"./Wikipedia:Featured_articles*\\\" title=\\\"This is a featured article. Click here for more information.\\\" id=\\\"mwCA\\\">&lt;img alt=\\\"Featured article\\\" resource=\\\"./File:Cscr-featured.svg\\\" src=\\\"//upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png\\\" decoding=\\\"async\\\" data-file-width=\\\"466\\\" data-file-height=\\\"443\\\" data-file-type=\\\"drawing\\\" height=\\\"19\\\" width=\\\"20\\\" srcset=\\\"//upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/40px-Cscr-featured.svg.png 1.5x, //upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/40px-Cscr-featured.svg.png 2x\\\" class=\\\"mw-file-element\\\" id=\\\"mwCQ\\\"/>&lt;/a>&lt;/span>\\n\"}' id=\"mwCg\"/> \\n* [[Harrison Ford]]\\n* [[Rutger Hauer]]\\n* [[Sean Young]]\\n* [[Edward James Olmos]]\\n}}\"},\"music\":{\"wt\":\"[[Vangelis]]\"},\"cinematography\":{\"wt\":\"[[Jordan Cronenweth]]\"},\"editing\":{\"wt\":\"{{unbulleted list|[[Terry Rawlings]]|Marsha Nakashima}}\"},\"studio\":{\"wt\":\"{{unbulleted list|[[The Ladd Company]]|[[Shaw Brothers]]|Blade Runner Partnership}}\"},\"distributor\":{\"wt\":\"[[Warner Bros. Pictures|Warner Bros.]] (worldwide)&lt;br />Shaw Brothers (Hong Kong)\"},\"released\":{\"wt\":\"{{Film date|1982|06|25|United States|1982|12|22|Hong Kong}}\"},\"runtime\":{\"wt\":\"117 minutes&lt;!-- First theatrical run, not the later Director&apos;s or Final Cut -->&lt;!-- Theatrical runtime: 117:04 -->&lt;ref name=bbfcoriginal />\"},\"country\":{\"wt\":\"United States&lt;ref>{{cite web |url=https://catalog.afi.com/Film/68260-BLADE-RUNNER?sid=8a7ed183-727e-4335-9da7-16ffd47b588f&amp;sr=34.601395&amp;cp=1&amp;pos=0 |website=AFI.com |publisher=[[American Film Institute]] |title=Blade Runner |access-date=December 3, 2015 |url-status=live |archive-url= https://web.archive.org/web/20151106110252/http://www.afi.com/members/catalog/DetailView.aspx?s=&amp;Movie=68260 |archive-date=November 6, 2015}}&lt;/ref>&lt;ref>{{cite web |url=https://www2.bfi.org.uk//whats-on/bfi-film-releases/blade-runner-final-cut |website=BFI.org |publisher=[[British Film Institute]] |title=Blade Runner |access-date=December 3, 2015 |url-status=live |archive-url= https://web.archive.org/web/20151206122316/http://www.bfi.org.uk/whats-on/bfi-film-releases/blade-runner-final-cut |archive-date=December 6, 2015}}&lt;/ref>&lt;br />Hong Kong&lt;ref name=bfi.org.uk>{{cite web |url=http://www.bfi.org.uk/films-tv-people/4ce2b69ac89d8 |title=Blade Runner (1982) |publisher=British Film Institute |access-date=April 26, 2018 |archive-url=https://web.archive.org/web/20170215022709/http://www.bfi.org.uk/films-tv-people/4ce2b69ac89d8 |archive-date=February 15, 2017 |url-status=dead}}&lt;/ref>\"},\"language\":{\"wt\":\"English\"},\"budget\":{\"wt\":\"$30&amp;nbsp;million&lt;ref>{{cite web |first=Tim |last=Gray |url=https://variety.com/2017/film/news/blade-runner-1982-unloved-classic-1202476755/ |archive-url=https://web.archive.org/web/20170705010740/https://variety.com/2017/film/news/blade-runner-1982-unloved-classic-1202476755/ |title=&apos;Blade Runner&apos; Turns 35: Ridley Scott&apos;s Unloved Film That Became a Classic |website=[[Variety (magazine)|Variety]] |date=June 24, 2017 |archive-date=July 5, 2017 |access-date=July 31, 2019 |url-status=live}}&lt;/ref>\"},\"gross\":{\"wt\":\"$41.8&amp;nbsp;million&lt;ref>{{cite web |url=https://www.boxofficemojo.com/title/tt0083658/ |title=Blade Runner (1982) |website=[[Box Office Mojo]] |access-date=February 3, 2024 |archive-date=May 15, 2020 |archive-url=https://web.archive.org/web/20200515161512/https://www.boxofficemojo.com/title/tt0083658/ |url-status=live }}&lt;/ref>\"}},\"i\":0}}]}' id=\"mwEQ\">.mw-parser-output .infobox-subbox{padding:0;border:none;margin:-3px;width:auto;min-width:100%;font-size:100%;clear:none;float:none;background-color:transparent;color:inherit}.mw-parser-output .infobox-3cols-child{margin:-3px}.mw-parser-output .infobox .navbar{font-size:100%}@media screen{html.skin-theme-clientpref-night .mw-parser-output .infobox-full-data:not(.notheme)>div:not(.notheme)[style]{background:#1f1f23!important;color:#f8f9fa}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .infobox-full-data:not(.notheme)>div:not(.notheme)[style]{background:#1f1f23!important;color:#f8f9fa}}@media(min-width:640px){body.skin--responsive .mw-parser-output .infobox-table{display:table!important}body.skin--responsive .mw-parser-output .infobox-table>caption{display:table-caption!important}body.skin--responsive .mw-parser-output .infobox-table>tbody{display:table-row-group}body.skin--responsive .mw-parser-output .infobox-table th,body.skin--responsive .mw-parser-output .infobox-table td{padding-left:inherit;padding-right:inherit}} Blade Runner Theatrical release poster by John Alvin Directed by Ridley Scott Screenplay by .mw-parser-output .plainlist ol,.mw-parser-output .plainlist ul{line-height:inherit;list-style:none;margin:0;padding:0}.mw-parser-output .plainlist ol li,.mw-parser-output .plainlist ul li{margin-bottom:0} Hampton Fancher David Peoples Based on Do Androids Dream of Electric Sheep? by Philip K. Dick Produced by Michael Deeley Starring Harrison Ford Rutger Hauer Sean Young Edward James Olmos Cinematography Jordan Cronenweth Edited by Terry Rawlings Marsha Nakashima Music by Vangelis Production companies The Ladd Company Shaw Brothers Blade Runner Partnership Distributed by Warner Bros. (worldwide) Shaw Brothers (Hong Kong) Release dates June 25, 1982 ( 1982-06-25 ) (United States) December 22, 1982 ( 1982-12-22 ) (Hong Kong) Running time 117 minutes [ 1 ] Countries United States [ 2 ] [ 3 ] Hong Kong [ 4 ] Language English Budget $30 million [ 5 ] Box office $41.8 million [ 6 ] Blade Runner is a 1982 science fiction film directed by Ridley Scott from a screenplay by Hampton Fancher and David Peoples . [ 7 ] [ 8 ] Starring Harrison Ford , Rutger Hauer , Sean Young , and Edward James Olmos , it is an adaptation of Philip K. Dick 's 1968 novel Do Androids Dream of Electric Sheep? The film is set in a dystopian future Los Angeles of 2019, in which synthetic humans known as replicants are bio-engineered by the powerful Tyrell Corporation to work on space colonies . When a fugitive group of advanced replicants led by Roy Batty (Hauer) escapes back to Earth, former cop Rick Deckard (Ford) reluctantly agrees to hunt them down. Blade Runner initially underperformed in North American theaters and polarized critics; some praised its thematic complexity and visuals, while others critiqued its slow pacing and lack of action. The film's soundtrack , composed by Vangelis , was nominated in 1982 for a BAFTA and a Golden Globe as best original score . Blade Runner later became a cult film , and has since come to be regarded as one of the greatest science fiction films . Hailed for its production design depicting a high-tech but decaying future, the film is often regarded as both a leading example of neo-noir cinema and a foundational work of the cyberpunk [ 9 ] genre. It has influenced many science fiction films, video games , anime , and television series. It also brought the work of Dick to Hollywood's attention and led to several film adaptations of his works . In 1993, it was selected for preservation in the National Film Registry by the Library of Congress . Seven different versions of Blade Runner exist as a result of controversial changes requested by studio executives. A director's cut was released in 1992 after a strong response to test screenings of a workprint . This, in conjunction with the film's popularity as a video rental, made it one of the earliest films to be released on DVD . In 2007, Warner Bros. released The Final Cut , a 25th-anniversary digitally remastered version; this is the only version over which Scott retained artistic control. The film is the first of the franchise of the same name . A sequel, titled Blade Runner 2049 , was released in 2017 alongside a trilogy of short films covering the thirty-year span between the two films' settings. The anime series Blade Runner: Black Lotus was released in 2021. .mw-parser-output .toclimit-2 .toclevel-1 ul,.mw-parser-output .toclimit-3 .toclevel-2 ul,.mw-parser-output .toclimit-4 .toclevel-3 ul,.mw-parser-output .toclimit-5 .toclevel-4 ul,.mw-parser-output .toclimit-6 .toclevel-5 ul,.mw-parser-output .toclimit-7 .toclevel-6 ul{display:none} Plot In 2019 Los Angeles, former police officer Rick Deckard is detained by Officer Gaff, who likes to make origami figures, and is brought to his former supervisor, Bryant. Deckard, whose job as a \"blade runner\" was to track down bioengineered humanoids known as replicants and terminally \"retire\" them, is informed that four replicants are on Earth illegally. Deckard begins to leave, but Bryant makes veiled threats and Deckard stays. The two watch a video of a blade runner named Holden administering the Voight-Kampff test, which is designed to distinguish replicants from humans based on their emotional responses to questions. The test subject, Leon , shoots Holden on the second question. Bryant wants Deckard to retire Leon and three other Nexus-6 replicants: Roy Batty, Zhora, and Pris. Bryant has Deckard meet with the CEO of the company that creates the replicants, Eldon Tyrell , so he can administer the V-K test on a Nexus-6 to see if it works. Tyrell expresses his interest in seeing the test fail first and asks him to administer it on his assistant Rachael . After a much longer than standard test, Deckard concludes privately to Tyrell that Rachael is a replicant who believes she is human. Tyrell explains that she is an experiment who has been given false memories to provide an \"emotional cushion\", and that she has no knowledge of her true nature. In searching Leon's hotel room, Deckard finds photos and a scale from the skin of an animal, which is later identified as a synthetic snake scale. Deckard returns to his apartment, where Rachael is waiting. She tries to prove her humanity by showing him a family photo, but Deckard reveals that her memories are implants from Tyrell's niece, and she leaves in tears. Replicants Roy and Leon meanwhile investigate a replicant eye-manufacturing laboratory and learn of J. F. Sebastian , a gifted genetic designer who works closely with Tyrell. Pris locates Sebastian and manipulates him to gain his trust. A photograph from Leon's apartment and the snake scale lead Deckard to a strip club, where Zhora works. After a confrontation and chase, Deckard kills Zhora. Bryant also orders him to retire Rachael, who has disappeared from the Tyrell Corporation. Deckard spots Rachael in a crowd, but he is ambushed by Leon, who knocks the gun out of Deckard's hand and beats him. As Leon is about to kill Deckard, Rachael saves him by using Deckard's gun to kill Leon. They return to Deckard's apartment and, during a discussion, he promises not to track her down. As Rachael abruptly tries to leave, Deckard restrains her and forces her to kiss him, and she ultimately relents. Deckard leaves Rachael at his apartment and departs to search for the remaining replicants. Roy arrives at Sebastian's apartment and tells Pris that the other replicants are dead. Sebastian reveals that because of a genetic premature aging disorder, his life will be cut short, like the replicants that were built with a four-year lifespan. Roy uses Sebastian to gain entrance to Tyrell's penthouse. He demands more life from his maker, which Tyrell says is impossible. Roy confesses that he has done \"questionable things\" but Tyrell dismisses this, praising Roy's advanced design and accomplishments in his short life. Roy kisses Tyrell and then kills him by crushing his eyes and skull. Sebastian tries to flee and is later reported dead. [ nb 1 ] At Sebastian's apartment, Deckard is ambushed by Pris, but he kills her as Roy returns. Roy's body begins to fail as the end of his lifespan nears. He chases Deckard through the building and onto the roof. Deckard tries to jump onto another roof but is left hanging from the edge. Roy makes the jump with ease and, as Deckard's grip loosens, Roy hoists him onto the roof to save him. Before Roy dies, he laments that his memories \" will be lost in time, like tears in rain \". Gaff arrives to congratulate Deckard, also reminding him that Rachael will not live, but \"then again, who does?\" Deckard returns to his apartment to retrieve Rachael. While escorting her to the elevator, he notices a small origami unicorn on the floor. He recalls Gaff's words and departs with Rachael. Cast .mw-parser-output .div-col{margin-top:0.3em;column-width:30em}.mw-parser-output .div-col-small{font-size:90%}.mw-parser-output .div-col-rules{column-rule:1px solid #aaa}.mw-parser-output .div-col dl,.mw-parser-output .div-col ol,.mw-parser-output .div-col ul{margin-top:0}.mw-parser-output .div-col li,.mw-parser-output .div-col dd{page-break-inside:avoid;break-inside:avoid-column} Harrison Ford as Rick Deckard Rutger Hauer as Roy Batty Sean Young as Rachael Edward James Olmos as Gaff M. Emmet Walsh as Bryant Daryl Hannah as Pris William Sanderson as J.F. Sebastian Brion James as Leon Kowalski Joe Turkel as Eldon Tyrell Joanna Cassidy as Zhora Salome James Hong as Hannibal Chew Morgan Paull as Dave Holden Hy Pyke as Taffey Lewis Production Development Map of Ridleyville, exterior sets for Blade Runner located on the New York Street of the Warner Bros. Studios lot ( Burbank, California ) Interest in adapting Philip K. Dick 's novel Do Androids Dream of Electric Sheep? developed shortly after its 1968 publication. Director Martin Scorsese was interested in filming the novel, but never optioned it. [ 11 ] Producer Herb Jaffe optioned it in the early 1970s, but Dick was unimpressed with the screenplay written by Herb's son Robert , saying, \"Jaffe's screenplay was so terribly done ... Robert flew down to Santa Ana to speak with me about the project. And the first thing I said to him when he got off the plane was, 'Shall I beat you up here at the airport, or shall I beat you up back at my apartment? ' \" [ 12 ] The screenplay by Hampton Fancher was optioned in 1977. [ 13 ] Producer Michael Deeley became interested in Fancher's draft and convinced director Ridley Scott to film it. Scott had previously declined the project but, after leaving the slow production of Dune , wanted a faster-paced project to take his mind off his older brother's recent death. [ 14 ] He joined the project on February 21, 1980, and managed to push up the promised Filmways financing from US$13 million to $15 million. Fancher's script focused more on environmental issues and less on issues of humanity and religion, which are prominent in the novel, and Scott wanted changes. Fancher found a cinema treatment by William S. Burroughs for Alan E. Nourse 's novel The Bladerunner (1974), titled Blade Runner (a movie) . [ nb 2 ] Scott liked the name, so Deeley obtained the rights to the titles. [ 15 ] Eventually, he hired David Peoples to rewrite the script and Fancher left the job over the issue on December 21, 1980, although he later returned to contribute additional rewrites. [ 16 ] Having invested more than $2.5 million in pre-production, [ 17 ] as the date of commencement of principal photography neared, Filmways withdrew financial backing. In ten days Deeley had secured $21.5 million in financing through a three-way deal between the Ladd Company (through Warner Bros.), the Hong Kong-based producer Sir Run Run Shaw and Tandem Productions . [ 18 ] Dick became concerned that no one had informed him about the film's production, which added to his distrust of Hollywood. [ 19 ] After Dick criticized an early version of Fancher's script in an article written for the Los Angeles Select TV Guide , the studio sent Dick the Peoples rewrite. [ 20 ] Although Dick died shortly before the film's release, he was pleased with the rewritten script and with a 20-minute special effects test reel that was screened for him when he was invited to the studio. Despite his well-known skepticism of Hollywood in principle, Dick enthused to Scott that the world created for the film looked exactly as he had imagined it. [ 21 ] He said, \"I saw a segment of Douglas Trumbull 's special effects for Blade Runner on the KNBC news. I recognized it immediately. It was my own interior world. They caught it perfectly.\" He also approved of the film's script, saying: \"After I finished reading the screenplay, I got the novel out and looked through it. The two reinforce each other so that someone who started with the novel would enjoy the movie and someone who started with the movie would enjoy the novel.\" [ 22 ] The motion picture was dedicated to Dick. [ 23 ] Principal photography of Blade Runner began on March 9, 1981, and ended four months later. [ 24 ] In 1992, Ford revealed, \" Blade Runner is not one of my favorite films. I tangled with Ridley.\" [ 25 ] Apart from friction with the director, Ford also disliked the voiceovers : \"When we started shooting it had been tacitly agreed that the version of the film that we had agreed upon was the version without voiceover narration. It was a f**king [ sic ] nightmare. I thought that the film had worked without the narration. But now I was stuck re-creating that narration. And I was obliged to do the voiceovers for people that did not represent the director's interests.\" [ 26 ] \"I went kicking and screaming to the studio to record it.\" [ 27 ] The narration monologs were written by an uncredited Roland Kibbee . [ 28 ] In 2006, Scott was asked \"Who's the biggest pain in the arse you've ever worked with?\" He replied: \"It's got to be Harrison ... he'll forgive me because now I get on with him. Now he's become charming. But he knows a lot, that's the problem. When we worked together it was my first film up and I was the new kid on the block. But we made a good movie.\" [ 29 ] Ford said of Scott in 2000: \"I admire his work. We had a bad patch there, and I'm over it.\" [ 30 ] In 2006 Ford reflected on the production of the film saying: \"What I remember more than anything else when I see Blade Runner is not the 50 nights of shooting in the rain, but the voiceover ... I was still obliged to work for these clowns that came in writing one bad voiceover after another.\" [ 31 ] Ridley Scott confirmed in the summer 2007 issue of Total Film that Harrison Ford contributed to the Blade Runner Special Edition DVD, and had already recorded his interviews. \"Harrison's fully on board\", said Scott. [ 32 ] The Bradbury Building in Los Angeles was used as one of the filming locations. The Bradbury Building in downtown Los Angeles served as a filming location , and a Warner Bros. backlot housed the 2019 Los Angeles street sets . Other locations included the Ennis-Brown House and the 2nd Street Tunnel . Test screenings resulted in several changes, including adding a voice-over , a happy ending, and the removal of a Holden hospital scene. The relationship between the filmmakers and the investors was difficult, which culminated in Deeley and Scott being fired but still working on the film. [ 33 ] Crew members created T-shirts during filming saying, \"Yes Guv'nor, My Ass\" that mocked Scott's unfavorable comparison of U.S. and British crews; Scott responded with a T-shirt of his own, \"Xenophobia Sucks\", making the incident known as the T-shirt war. [ 34 ] [ 35 ] Casting See also: List of Blade Runner characters Casting the film proved troublesome, particularly for the lead role of Deckard. Screenwriter Hampton Fancher envisioned Robert Mitchum as Deckard and wrote the character's dialogue with Mitchum in mind. [ 36 ] According to production documents, several actors were considered for the role, including Gene Hackman , Sean Connery , Jack Nicholson , Paul Newman , Clint Eastwood , Tommy Lee Jones , Arnold Schwarzenegger , Peter Falk , Nick Nolte , Al Pacino and Burt Reynolds . [ 36 ] [ 37 ] Director Ridley Scott and the film's producers spent months meeting and discussing the role with Dustin Hoffman , who eventually departed over differences in vision. [ 36 ] Harrison Ford was ultimately chosen for several reasons, including his performance in the Star Wars films, Ford's interest in the Blade Runner story, and discussions with Steven Spielberg , who was finishing Raiders of the Lost Ark at the time and strongly praised Ford's work in the film. [ 36 ] Following his success in those two films, Ford was looking for a role with dramatic depth. [ 26 ] Rutger Hauer was cast as Roy Batty, [ 38 ] the violent yet thoughtful leader of the replicants. [ 39 ] Scott cast Hauer without having met him, based on his performances in Paul Verhoeven 's movies that Scott had seen ( Katie Tippel , Soldier of Orange , and Turkish Delight ). [ 36 ] Hauer's portrayal of Batty was regarded by Philip K. Dick as \"the perfect Batty – cold, Aryan , flawless\". [ 21 ] Of the many films Hauer made, Blade Runner was his favorite. In a live chat in 2001, he said \" Blade Runner needs no explanation. It just [is] . All of the best. There is nothing like it. To be part of a real masterpiece which changed the world's thinking. It's awesome.\" [ 40 ] Hauer rewrote his character's \" tears in rain \" speech himself and presented the words to Scott on set prior to filming. Blade Runner used a number of then-lesser-known actors: Sean Young portrays Rachael, an experimental replicant implanted with the memories of Tyrell's niece, causing her to believe she is human; [ 41 ] Nina Axelrod auditioned for the role. [ 36 ] Fancher originally wrote the role for his then girlfriend Barbara Hershey . [ 42 ] Daryl Hannah portrays Pris, a \"basic pleasure model\" replicant; Stacey Nelkin auditioned for the role, but was given another part in the film, which was ultimately cut before filming. [ 36 ] Debbie Harry turned down the role of Pris. [ 43 ] [ 44 ] Casting Pris and Rachael was challenging, requiring several screen tests with Morgan Paull playing the role of Deckard. Paull was cast as Deckard's fellow bounty hunter Holden based on his performances in the tests. [ 36 ] Brion James portrays Leon Kowalski, a combat and laborer replicant, and Joanna Cassidy portrays Zhora, an assassin replicant. Edward James Olmos portrays Gaff. Olmos drew on diverse ethnic sources to help create the fictional \" Cityspeak \" language his character uses in the film. [ 45 ] His initial address to Deckard at the noodle bar is partly in Hungarian and means, \"Horse dick [bullshit]! No way. You are the Blade ... Blade Runner.\" [ 45 ] M. Emmet Walsh portrays Captain Bryant, a rumpled, hard-drinking and underhanded police veteran typical of the film noir genre. Joe Turkel portrays Dr. Eldon Tyrell, a corporate mogul who built an empire on genetically manipulated humanoid slaves. William Sanderson was cast as J. F. Sebastian, a quiet and lonely genius who provides a compassionate yet compliant portrait of humanity. J. F. sympathizes with the replicants, whom he sees as companions, [ 46 ] and he shares their shorter lifespan due to his rapid aging disease. [ 47 ] Joe Pantoliano had earlier been considered for the role. [ 48 ] James Hong portrays Hannibal Chew, an elderly geneticist specializing in synthetic eyes, and Hy Pyke portrayed the sleazy bar owner Taffey Lewis – in a single take, something almost unheard-of with Scott, whose drive for perfection resulted at times in double-digit takes. [ 49 ] Design Scott credits Edward Hopper 's painting Nighthawks and the French science fiction comics magazine Métal Hurlant , to which the artist Jean \"Moebius\" Giraud contributed, as stylistic mood sources. [ 50 ] He also drew on the landscape of \" Hong Kong on a very bad day\" [ 51 ] and the industrial landscape of his one-time home in northeast England. [ 52 ] The visual style of the movie is influenced by the work of futurist Italian architect Antonio Sant'Elia . [ 53 ] Scott hired Syd Mead as his concept artist ; like Scott, he was influenced by Métal Hurlant . [ 54 ] Moebius was offered the opportunity to assist in the pre-production of Blade Runner , but he declined so that he could work on René Laloux 's animated film Les Maîtres du temps – a decision that he later regretted. [ 55 ] Production designer Lawrence G. Paull and art director David Snyder realized Scott's and Mead's sketches. Douglas Trumbull and Richard Yuricich supervised the special effects for the film, and Mark Stetson served as chief model maker. [ 56 ] Blade Runner has numerous similarities to Fritz Lang 's Metropolis , including a built-up urban environment, in which the wealthy literally live above the workers, dominated by a huge building – the Stadtkrone Tower in Metropolis and the Tyrell Building in Blade Runner . Special effects supervisor David Dryer used stills from Metropolis when lining up Blade Runner ' s miniature building shots. [ 57 ] The extended end scene in the original theatrical release shows Rachael and Deckard traveling into daylight with pastoral aerial shots filmed by director Stanley Kubrick . Ridley Scott contacted Kubrick about using some of his surplus helicopter aerial photography from The Shining . [ 58 ] [ 59 ] [ 60 ] Spinner Main article: Spinner (Blade Runner) A \"spinner\" (police variant) on display at Disney-MGM Studios in the 1990s \"Spinner\" is the generic term for the fictional flying cars used in the film. A spinner can be driven as a ground-based vehicle, and take off vertically, hover, and cruise much like vertical take-off and landing (VTOL) aircraft. They are used extensively by the police as patrol cars , and wealthy people can also acquire spinner licenses. [ 61 ] The vehicle was conceived and designed by Syd Mead who described the spinner as an aerodyne – a vehicle which directs air downward to create lift , though press kits for the film stated that the spinner was propelled by three engines: \"conventional internal combustion , jet , and anti-gravity \". [ 62 ] [ 63 ] A spinner is on permanent exhibit at the Science Fiction and Fantasy Hall of Fame in Seattle, Washington. [ 64 ] Mead's conceptual drawings were transformed into 25 vehicles by automobile customizer Gene Winfield ; at least two were working ground vehicles, while others were light-weight mockups for crane shots and set decoration for street shots. [ 65 ] Two of them ended up at Disney World in Orlando, Florida, but were later destroyed, and a few others remain in private collections. [ 65 ] Voight-Kampff machine .mw-parser-output .quotebox{background-color:#F9F9F9;border:1px solid #aaa;box-sizing:border-box;padding:10px;font-size:88%;max-width:100%}.mw-parser-output .quotebox.floatleft{margin:.5em 1.4em .8em 0}.mw-parser-output .quotebox.floatright{margin:.5em 0 .8em 1.4em}.mw-parser-output .quotebox.centered{overflow:hidden;position:relative;margin:.5em auto .8em auto}.mw-parser-output .quotebox.floatleft span,.mw-parser-output .quotebox.floatright span{font-style:inherit}.mw-parser-output .quotebox>blockquote{margin:0;padding:0;border-left:0;font-family:inherit;font-size:inherit}.mw-parser-output .quotebox-title{text-align:center;font-size:110%;font-weight:bold}.mw-parser-output .quotebox-quote>:first-child{margin-top:0}.mw-parser-output .quotebox-quote:last-child>:last-child{margin-bottom:0}.mw-parser-output .quotebox-quote.quoted:before{font-family:\"Times New Roman\",serif;font-weight:bold;font-size:large;color:gray;content:\" “ \";vertical-align:-45%;line-height:0}.mw-parser-output .quotebox-quote.quoted:after{font-family:\"Times New Roman\",serif;font-weight:bold;font-size:large;color:gray;content:\" ” \";line-height:0}.mw-parser-output .quotebox .left-aligned{text-align:left}.mw-parser-output .quotebox .right-aligned{text-align:right}.mw-parser-output .quotebox .center-aligned{text-align:center}.mw-parser-output .quotebox .quote-title,.mw-parser-output .quotebox .quotebox-quote{display:block}.mw-parser-output .quotebox cite{display:block;font-style:normal}@media screen and (max-width:640px){.mw-parser-output .quotebox{width:100%!important;margin:0 0 .8em!important;float:none!important}} A very advanced form of lie detector that measures contractions of the iris muscle and the presence of invisible airborne particles emitted from the body. The bellows were designed for the latter function and give the machine the menacing air of a sinister insect. The VK is used primarily by Blade Runners to determine if a suspect is truly human by measuring the degree of his empathic response through carefully worded questions and statements. – Description from the original press kit. The Voight-Kampff machine is a fictional interrogation tool, originating from the novel (where it is spelled \"Voigt-Kampff\"). It is a polygraph -like machine that is used by blade runners to determine whether an individual is a replicant by measuring bodily functions such as respiration, blush response, heart rate, and eye movement in response to questions dealing with empathy . [ 66 ] In real life a magazine created an approximation of the test using questions and used it in jest on the candidates in the 2003 election for Mayor of San Francisco , concluding that at least half of them, including future Governor Gavin Newsom , would be classified as replicants. [ 67 ] [ 68 ] Music Main article: Blade Runner (soundtrack) The Blade Runner soundtrack by Vangelis is a dark melodic combination of classic composition and futuristic synthesizers which mirrors the film noir retro-future envisioned by Scott. [ 69 ] Vangelis, fresh from his Academy Award -winning score for Chariots of Fire , [ 70 ] composed and performed the music on his synthesizers. [ 71 ] He also made use of various chimes and the vocals of collaborator Demis Roussos . [ 72 ] Another memorable sound is the tenor sax solo \"Love Theme\" by British saxophonist Dick Morrissey , who performed on many of Vangelis's albums. Ridley Scott also used \"Memories of Green\" from the Vangelis album See You Later , an orchestral version of which Scott would later use in his film Someone to Watch Over Me . [ 73 ] Along with Vangelis's compositions and ambient textures, the film's soundscape also features a track by the Japanese ensemble Nipponia – \"Ogi no Mato\" or \"The Folding Fan as a Target\" from the Nonesuch Records release Traditional Vocal and Instrumental Music – and a track by harpist Gail Laughton from \"Harps of the Ancient Temples\" on Laurel Records. [ 74 ] Despite being well received by fans and critically acclaimed and nominated in 1982 for a BAFTA and a Golden Globe as best original score, and the promise of a soundtrack album from Polydor Records in the end titles of the film, the release of the official soundtrack recording was delayed for over a decade. There are two official releases of the music from Blade Runner . In light of the lack of a release of an album, the New American Orchestra recorded an orchestral adaptation in 1982 which bore little resemblance to the original. Some of the film tracks would, in 1989, surface on the compilation Vangelis: Themes , but not until the 1992 release of the Director's Cut version would a substantial amount of the film's score see commercial release. [ 72 ] These delays and poor reproductions led to the production of many bootleg recordings over the years. A bootleg tape surfaced in 1982 at science fiction conventions and became popular given the delay of an official release of the original recordings, and in 1993 \"Off World Music, Ltd\" created a bootleg CD that would prove more comprehensive than Vangelis' official CD in 1994. [ 72 ] A set with three CDs of Blade Runner -related Vangelis music was released in 2007. Titled Blade Runner Trilogy , the first disc contains the same tracks as the 1994 official soundtrack release, the second features previously unreleased music from the film, and the third disc is all newly composed music from Vangelis, inspired by, and in the spirit of the film. [ 75 ] Special effects The film's special effects are generally recognized to be among the best in the genre, [ 76 ] [ 77 ] using the available (non-digital) technology to the fullest. Special effects engineers who worked on the film are often praised for the innovative technology they used to produce and design certain aspects of those visuals. [ 78 ] In addition to matte paintings and models, the techniques employed included multipass exposures. In some scenes, the set was lit, shot, the film rewound, and then rerecorded over with different lighting. In some cases this was done 16 times in all. The cameras were frequently motion controlled using computers . [ 76 ] Many effects used techniques which had been developed during the production of Close Encounters of the Third Kind . [ 79 ] Release Theatrical run Blade Runner was released in 1,290 theaters on June 25, 1982. That date was chosen by producer Alan Ladd Jr. because his previous highest-grossing films ( Star Wars and Alien ) had a similar opening date (May 25) in 1977 and 1979, making the 25th of the month his \"lucky day\". [ 80 ] Blade Runner grossed reasonably good ticket sales in its opening weekend, earning $6.1 million during its first weekend in theaters. [ 81 ] The film was released close to other major science-fiction and fantasy releases such as The Thing , Star Trek II: The Wrath of Khan , Conan the Barbarian and E.T. the Extra-Terrestrial , which affected its commercial success. [ 82 ] Alternative versions and home media Main article: Versions of Blade Runner Several versions of Blade Runner have been shown. The original workprint version (1982, 113 minutes) was shown for audience test previews in Denver and Dallas in March 1982. Negative responses to the previews led to the modifications resulting in the U.S. theatrical version. [ 83 ] [ 84 ] The workprint was shown as a director's cut without Scott's approval at the Los Angeles Fairfax Theater in May 1990, at an AMPAS showing in April 1991, and in September and October 1991 at the Los Angeles Nuart Theatre and the San Francisco Castro Theatre . [ 85 ] Positive responses pushed the studio to approve work on an official director's cut. [ 86 ] A San Diego sneak preview was shown once, in May 1982; it was almost identical to the U.S. theatrical version but contained three extra scenes not shown in any other version, including the 2007 final cut. [ 87 ] Two versions were shown in the film's 1982 theatrical release: the U.S. theatrical version (117 minutes), [ 1 ] known as the original version or Domestic Cut (released on Betamax , CED Videodisc and VHS in 1983, and on LaserDisc in 1987), and the International Cut (117 minutes), also known as the \"Criterion Edition\" or \"uncut version\", which included more violent action scenes than the U.S. version. Although initially unavailable in the U.S. and distributed in Europe and Asia via theatrical and local Warner Home Video releases, the International Cut was later released on VHS and The Criterion Collection Laserdisc in North America, and re-released in 1992 as a \"10th Anniversary Edition\". [ 88 ] Ridley Scott's Director's Cut (1992, 116 minutes) [ 89 ] had significant changes from the theatrical version including the removal of Deckard's voice-over, the re-insertion of a sequence in which Deckard dreams of a unicorn, and the removal of the studio-imposed happy ending. Scott provided extensive notes and consultation to Warner Bros. through film preservationist Michael Arick, who was put in charge of creating the Director's Cut . [ 90 ] It is often falsely claimed that the unicorn sequence was an outtake from Ridley Scott's follow-up film Legend which also features unicorns, but it was in fact shot for Blade Runner as \"additional photography\" by second unit cinematographer Brian Tufano . [ 91 ] Scott's definitive The Final Cut (2007, 117 minutes) [ 92 ] was released by Warner Bros. theatrically on October 5, 2007, and subsequently released on DVD, HD DVD , and Blu-ray Disc in December 2007. [ 93 ] This is the only version over which Scott had complete artistic and editorial control. [ 90 ] It was released on Ultra HD Blu-ray on September 5, 2017. [ 94 ] Reception Critical response On Rotten Tomatoes , the film holds an 89% approval rating based on 132 reviews, with an average rating of 8.50/10. The website's critics consensus reads: \"Misunderstood when it first hit theaters, the influence of Ridley Scott's mysterious, neo-noir Blade Runner has deepened with time. A visually remarkable, achingly human sci-fi masterpiece.\" [ 95 ] Metacritic , which uses a weighted average, assigned the film a score of 84 out of 100 based on 15 critics, indicating \"universal acclaim\". [ 96 ] Initial reactions among film critics were mixed. Some wrote that the plot took a back seat to the film's special effects and did not fit the studio's marketing as an action and adventure film. Others acclaimed its complexity and predicted it would stand the test of time. [ 97 ] Negative criticism in the United States cited its slow pace. [ 98 ] Sheila Benson from the Los Angeles Times called it \"Blade Crawler\", and Pat Berman in The State and Columbia Record described it as \"science fiction pornography\". [ 99 ] Pauline Kael praised Blade Runner as worthy of a place in film history for its distinctive sci-fi vision, yet criticized the film's lack of development in \"human terms\". [ 100 ] Ares magazine said, \"Misunderstood by audiences and critics alike, it is by far the best science fiction film of the year.\" [ 101 ] Cultural analysis Academics began analyzing the film almost as soon as it was released. One of the first books on the film was Paul M. Sammon's Future Noir: The Making of Blade Runner (1996), [ 102 ] which dissects all the details concerning the film's production. He was followed by Scott Bukatman 's Blade Runner [ 103 ] and other books and academic articles. [ 104 ] In Postmodern Metanarratives: Blade Runner and Literature in the Age of Image , Décio Torres Cruz analyzes the philosophical and psychological issues and the literary influences in Blade Runner . He examines the film's cyberpunk and dystopic elements by establishing a link between the Biblical, classical and modern traditions and the postmodern aspects in the film's collage of several literary texts. [ 9 ] The boom in home video formats helped establish a growing cult around the film, [ 78 ] which scholars have dissected for its dystopic aspects, questions regarding \"authentic\" humanity, ecofeminist aspects [ 105 ] and use of conventions from multiple genres. [ 106 ] Popular culture began to reassess its impact as a classic several years after it was released. [ 107 ] [ 108 ] [ 109 ] Roger Ebert praised the visuals of both the original and the Director's Cut and recommended it for that reason; however, he found the human story clichéd and a little thin. [ 39 ] He later added The Final Cut to his \"Great Movies\" list. [ 110 ] Critic Chris Rodley and Janet Maslin theorized that Blade Runner changed cinematic and cultural discourse through its image repertoire and subsequent influence on films. [ 111 ] In 2012, Time film critic Richard Corliss surgically analyzed the durability, complexity, screenplay, sets and production dynamics from a personal, three-decade perspective. [ 112 ] Denis Villeneuve , who directed the sequel, Blade Runner 2049 , cites the film as a huge influence for him and many others. [ 109 ] It has also been noted for its postmodernist approach and that it contributes to the historical development of modern dystopia in film. [ 113 ] Furthermore, the futuristic version of Los Angeles has been widely discussed by academics, with some comparing it to Milton's descriptions of hell in Paradise Lost . [ 114 ] In a 2019 retrospective, the BBC argued that elements of the film's socio-political themes remained prescient in the real year of the film's setting, such as its depiction of climate change . [ 115 ] From a more philosophical perspective, Alison Landsberg described Scott's direction of the film as a \"prosthetic memory\"—an action that has never happened and appears to be divorced from lived experience, yet it defines personhood and identity within the wider Blade Runner universe. [ 116 ] Awards and nominations Blade Runner won or received nominations for the following awards: [ 117 ] Year Award Category Nominee Result 1982 British Society of Cinematographers Best Cinematography Jordan Cronenweth Nominated Los Angeles Film Critics Association Best Cinematography Won 1983 British Academy Film Awards Best Cinematography Won Best Costume Design Charles Knode and Michael Kaplan Won Best Editing Terry Rawlings Nominated Best Film Music Vangelis Nominated Best Makeup and Hair Marvin Westmore Nominated Best Production Design Lawrence G. Paull Won Best Sound Peter Pennell, Bud Alper, Graham V. Hartstone, and Gerry Humphreys Nominated Best Special Visual Effects Douglas Trumbull , Richard Yuricich , and David Dryer Nominated Hugo Award Best Dramatic Presentation Won London Film Critics' Circle Special Achievement Award Lawrence G. Paull, Douglas Trumbull, and Syd Mead Won Golden Globe Awards Best Original Score Vangelis Nominated Academy Awards Best Art Direction Lawrence G. Paull, David Snyder , and Linda DeScenna {{Cite web |url=https://www.youtube.com/watch?v=h8OGeLuQ9aA |title=Gandhi Wins Art Direction and Cinematography: 1983 Oscars |date=January 3, 2014 |via=www.youtube.com|access-date=August 14, 2020|archive-date=August 3, 2020|archive-url=https://web.archive.org/web/20200803090532/https://www.youtube.com/watch?v=h8OGeLuQ9aA|url-status=live}}&lt;/ref>\"]}' id=\"mwBEI\">Nominated [ 118 ] Best Visual Effects Douglas Trumbull, Richard Yuricich, and David Dryer {{Cite web |url=https://www.oscars.org/oscars/ceremonies/1983 |title=The 55th Academy Awards &amp;#124; 1983 |website=Oscars.org &amp;#124; Academy of Motion Picture Arts and Sciences|date=October 5, 2014 |access-date=August 14, 2020|archive-date=April 17, 2018|archive-url=https://web.archive.org/web/20180417061022/https://www.oscars.org/oscars/ceremonies/1983|url-status=live}}&lt;/ref>&lt;ref>{{Cite web |url=https://www.youtube.com/watch?v=dIM6pVe9V9U |title=E.T. The Extra-Terrestrial Wins Visual Effects: 1983 Oscars |date=April 28, 2014 |via=www.youtube.com|access-date=August 14, 2020|archive-date=August 6, 2020|archive-url=https://web.archive.org/web/20200806161837/https://www.youtube.com/watch?v=dIM6pVe9V9U|url-status=live}}&lt;/ref>\"]}' id=\"mwBEw\">Nominated [ 119 ] [ 120 ] Saturn Award Best Director Ridley Scott Nominated Best Science Fiction Film Nominated Best Special Effects Douglas Trumbull and Richard Yuricich Nominated Best Supporting Actor Rutger Hauer Nominated Fantasporto International Fantasy Film Award Ridley Scott Nominated 1993 Fantasporto International Fantasy Film Award Best Film – Ridley Scott (Director's Cut) Nominated 1994 Saturn Award Best Genre Video Release Blade Runner (Director's Cut) Nominated 2008 Best DVD Special Edition Release Blade Runner (5-Disc Ultimate Collector's Edition) Won Themes Main article: Themes in Blade Runner The film operates on multiple dramatic and narrative levels. It employs some of the conventions of film noir , among them the character of a femme fatale ; narration by the protagonist (in the original release); chiaroscuro cinematography; and giving the hero a questionable moral outlook – extending to include reflections upon the nature of his own humanity. [ 121 ] [ 122 ] It is a literate science fiction film, thematically enfolding the philosophy of religion and moral implications of human mastery of genetic engineering in the context of classical Greek drama and hubris . [ 123 ] It also draws on Biblical images, such as Noah's flood , [ 124 ] and literary sources, such as Frankenstein [ 125 ] and William Blake . [ 126 ] Although Scott said any similarity was merely coincidental, [ 127 ] fans claimed that the chess game between Sebastian and Tyrell was based on the famous Immortal Game of 1851. [ 128 ] Blade Runner delves into the effects of technology on the environment and society by reaching to the past, using literature, religious symbolism , classical dramatic themes, and film noir techniques. This tension between past, present, and future is represented in the \"retrofitted\" future depicted in the film, one which is high-tech and gleaming in places but decayed and outdated elsewhere. In an interview with The Observer in 2002, director Ridley Scott described the film as \"extremely dark, both literally and metaphorically, with an oddly masochistic feel\". He also said that he \"liked the idea of exploring pain\" in the wake of his brother's death: \"When he was ill, I used to go and visit him in London, and that was really traumatic for me.\" [ 129 ] A sense of foreboding and paranoia pervades the world of the film: corporate power looms large; the police seem omnipresent; vehicle and warning lights probe into buildings; and the consequences of huge biomedical power over the individual are explored – especially regarding replicants' implanted memories. The film depicts a world post ecocide , where warfare and capitalism have led to destruction of 'normal' ecological systems. [ 130 ] Control over the environment is exercised on a vast scale, and goes hand in hand with the absence of any natural life; for example, artificial animals stand in for their extinct predecessors. [ 131 ] This oppressive backdrop explains the frequently referenced migration of humans to \"off-world\" (extraterrestrial) colonies. Eyes are a recurring motif, as are manipulated images, calling into question the nature of reality and our ability to accurately perceive and remember it. [ 132 ] [ 133 ] The film also consists of themes of Japan as a power, coming amid a time of anti-Japanese sentiment in the United States . [ 134 ] These thematic elements provide an atmosphere of uncertainty for Blade Runner ' s central theme of examining humanity. In order to discover replicants, an empathy test is used, with a number of its questions focused on the treatment of animals – seemingly an essential indicator of one's \"humanity\". Replicants will not respond the same way humans would, showing a lack of concern. The film goes so far as to question if Deckard might be a replicant, in the process asking the audience to re-evaluate what it means to be human. [ 135 ] The question of whether Deckard is intended to be a human or a replicant has been an ongoing controversy since the film's release. [ 136 ] [ 137 ] Both Michael Deeley and Harrison Ford wanted Deckard to be human, while Hampton Fancher preferred ambiguity. [ 138 ] Ridley Scott has stated that he envisaged Deckard as a replicant. [ 139 ] [ 140 ] Deckard's unicorn-dream sequence, inserted into Scott's Director's Cut and concomitant with Gaff's parting gift of an origami unicorn, is seen by many as showing that Deckard is a replicant – because Gaff could have retrieved Deckard's implanted memories. [ 125 ] [ 141 ] [ 142 ] The interpretation that Deckard is a replicant is challenged by others who believe the unicorn imagery shows that the characters, whether human or replicant, share the same dreams and recognize their affinity, [ 143 ] or that the absence of a decisive answer is crucial to the film's main theme. [ 144 ] The film's inherent ambiguity and uncertainty, as well as its textual richness, have permitted multiple interpretations. [ 145 ] Legacy Cultural impact See also: Tears in rain monologue A police spinner flying beside enormous skyscrapers, some with electronic billboards on them. Special effects such as these were benchmarks and have been highly influential on the esthetics of subsequent sci-fi films. While not initially a success with North American audiences, Blade Runner was popular internationally and garnered a cult following . [ 146 ] The film's dark style and futuristic designs have served as a benchmark and its influence can be seen in many subsequent science fiction films, video games , anime , and television programs. [ 121 ] Its influence has also extended beyond the science fiction genre, especially in the creation of cinematic worlds. For example, Denis Villeneuve , Lana Wachowski , [ 147 ] Christopher Nolan , Guillermo del Toro , Gareth Edwards [ 148 ] Rian Johnson , [ 149 ] Ronald D. Moore and David Eick [ 150 ] have all cited it as an influence. [ 42 ] [ 151 ] [ 152 ] Nolan notes that he has seen Blade Runner \"literally hundreds of times\", [ 148 ] while del Toro describes it as \"one of those cinematic drugs, that when I first saw it, I never saw the world the same way again\". [ 153 ] Scott Derrickson has called it \"maybe the best American film ever made\". [ 154 ] Oren Soffer , who worked with Edwards as co-cinematographer on The Creator , cited the film as \"the most visually stunning of all time\" and as an influence on his work. [ 155 ] [ 156 ] The film was selected for preservation in the United States National Film Registry in 1993 and is frequently taught in university courses. [ 157 ] [ 158 ] [ 159 ] In 2007, it was named the second-most visually influential film of all time by the Visual Effects Society . [ 160 ] The film has also been the subject of parody, such as the comics Blade Bummer by Crazy comics, [ 161 ] Bad Rubber by Steve Gallacci , [ 162 ] and the Red Dwarf 2009 three-part miniseries \" Back to Earth \". [ 163 ] [ 164 ] The anime series Psycho-Pass by Production I.G was also highly influenced by the film. [ 165 ] Blade Runner continues to reflect modern trends and concerns, and an increasing number of critics consider it one of the greatest science fiction film",
  "cached_at": "2025-10-25T19:38:50.896512"
}