{
  "title": "Companion robot",
  "summary": "A companion robot is a robot created to create real or apparent companionship for human beings. Target markets for companion robots include the elderly and single children. Companions robots are expected to communicate with non-experts in a natural and intuitive way. They offer a variety of functions, such as monitoring the home remotely, communicating with people, or waking people up in the morning. Their aim is to perform a wide array of tasks including educational functions, home security, diary duties, entertainment and message delivery services, etc.",
  "content": "Companion robot .mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}@media print{body.ns-0 .mw-parser-output .ambox{display:none!important}} This article may need to be rewritten to comply with Wikipedia's quality standards . You can help . The talk page may contain suggestions. ( May 2025 ) Robot created for companionship for humans A companion robot is a robot created to create real or apparent companionship for human beings. [ 1 ] Target markets for companion robots include the elderly [ 2 ] and single children. [ 3 ] Companions robots are expected to communicate with non-experts in a natural and intuitive way. They offer a variety of functions, such as monitoring the home remotely, communicating with people, or waking people up in the morning. Their aim is to perform a wide array of tasks including educational functions, home security, diary duties, entertainment and message delivery services, etc. [ 4 ] The idea of companionship with robots has already existed on science fictions of 1970s, like R2-D2 . Starting from the late 20th century, companion robots became a reality, mostly as robotic pets . Besides entertainment purposes, interactive robots were also introduced as a personal service robot for elderly care around 2000. [ 5 ] Characteristics Companion robots try to interact with users. They gather information about users based on their interactions and yield feedback. This procedure varies slightly based on their specific roles. For example, social-companion robots make simple conversations, while pet-companion robots mimic being real pets. Types Companion robots can perform a variety of tasks and they are produced in a specialized manner according to their purpose or target audience in order to increase convenience and end user satisfaction. Social companion robots Social companion robots are designed to provide companionship and be a solution for unwanted solitude. They often mimic adult human, child or pet behaviours appealing to the user base. [ 6 ] Robots which are specifically devised for simple conversations, conveying emotions and respond to user feelings fall under this category. Assistive companion robots Assistive companion robots are aimed at people who require constant care because of age, disability or rehabilitation purposes. Such robots can help disadvantaged users with their daily tasks, act as reminders (e.g., for regular medication) and facilitate mobility in everyday actions. Assistive companion robots reduce the intensity of labour that should be performed by caretakers, nurses and legal guardians. [ citation needed ] Educational companion robots Educational companion robots perform tutorship for students, regardless of their ages, and can teach desired subjects with activities tailored for the user such as interactive assignments and games. Rather than replacing teachers and instructors, educational companion robots are aides to them. [ citation needed ] Therapeutic companion robots Designed for individuals coping with stress (PTSD in severe cases), anxiety and loneliness; therapeutic companion robots support users' emotional and mental wellbeing. Such robots can be utilized in hospitals and care facilities as well as dwellings where the distressed user may need the most help. Therapeutic companion robots bear a vast resemblance to assistive companion robots to the extent of being a branch of them; the nuance between these two types of companion robots is that the former is for long-term/lifetime usage while the latter is mostly for the duration of the therapy received by the user. [ citation needed ] Pet companion robots Pet companion robots are for individuals who seek an alternative to live pets as live animals demand a considerable amount of care and may not be eligible for people with allergies. These robots aim to be perfect imitations of a pet while diminishing the chore aspect of having one. [ citation needed ] Entertainment companion robots Entertainment companion robots are designed solely for entertainment and can provide numerous ways of entertainment, ranging from dancing to playing games with the user. People who would appreciate an individual to have fun with are the main audience of such products. [ citation needed ] Personal assistant robots Personal assistant robots help people with daily tasks, management, scheduling, reminding etc. Their area of activity can be offices as well as homes and public spaces. [ citation needed ] Sex robots .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} Main article: Sex robot Sex robots are anthropomorphic robotic sex dolls that have human-like movement or behavior, and some degree of artificial intelligence . [ 7 ] [ 8 ] As of 2025 [ update ] , although elaborately instrumented sex dolls have been created by a number of inventors, no fully animated sex robots yet exist. Simple devices have been created which can speak, make facial expressions, or respond to touch. [ 9 ] [ 10 ] There is controversy as to whether developing them would be morally justifiable. [ 11 ] [ 12 ] In 2015, robot ethicist Kathleen Richardson called for a ban on the creation of anthropomorphic sex robots with concerns about normalizing relationships with machines and reinforcing female dehumanization. [ 13 ] [ 14 ] [ 15 ] Questions about their ethics, effects, and possible legal regulations have been discussed since then. [ who? ] [ when? ] Examples There are several companion robot prototypes, and these include Paro , CompanionAble, and EmotiRob, among others. Paro Paro is a pet-type robot system developed by Japan's National Institute of Advanced Industrial Science and Technology (AIST). The robot, which looked like a small harp seal, was designed as a therapeutic tool for use in hospitals and nursing homes. [ 16 ] [ 17 ] The robot is programmed to cry for attention and respond to its name. [ 16 ] Experiments showed that Paro facilitated elderly residents to communicate with each other, which led to psychological improvements. [ 17 ] CompanionAble This robot is classified as an FP 7 EU project. It is built to \"cooperate with Ambient Assistive Living environment\". [ 18 ] The autonomous device, which is also built to support the elderly, helps its owner interact with smart home environment as well as caregivers. The robot functions as a mobile friend, by which natural interaction is possible via speech and the touchscreen to detect and track people at home. [ 19 ] [ 20 ] [ 18 ] EmotiRob EmotiRob is developed in a robotics project which is the continuity of the MAPH (Active Media For the Handicap) project in emotion synthesis. [ 21 ] The aim of the project was to maintain emotional interaction with children. EmotiRob designed in a way that a child can hold it in a his/her arms and with which he/she could interact by talking to it, and then the robot would express itself through body postures or facial expressions. [ 21 ] It has cognitive capabilities, which are further extended so that the robot can have a natural linguistic interaction with its owner through the DRAGON speech-recognition software developed by a company called NUANCE . [ 22 ] Such interaction is expected to facilitate a child's cognitive development and develop new learning patterns. [ 22 ] LOVOT Lovot is a Japanese company robot whose only purpose is \"to make you happy\". [ 23 ] It features over 50 sensors that mimic the behavior of a human baby or small pet , a 360° camera with a microphone, the ability to distinguish humans from objects, neoteny eyes , and an internal warmth of 30° celsius . [ 24 ] An interactive Lovot Café was opened in Japan October 3, 2020. [ 25 ] NICOBO Nicobo was developed by Panasonic and was influenced by the loneliness of lockdowns created as a measure of the COVID-19 pandemic . It was designed to appear vulnerable, which creates empathy in its owners. Nicobo's name derives from the Japanese word for \"smile\". It wags its tail, engages in baby talk, and stays as a housemate. [ 26 ] [ 27 ] Hyodol Hyodol is an advanced care robot designed to support the elderly by reminding them to take their medications and monitoring their movements to keep their guardians informed. Additionally, this innovative robot can detect and respond to the emotional states of its elderly users, adding a layer of personalized care. Hyodol is designed with the appearance and speech style of a 7-year-old Korean grandchild, featuring a soft fabric exterior and user interaction methods such as striking the head or patting the back. It is equipped with various sensors and wireless communication technologies to collect and process data, supporting mobile apps and PC web monitoring systems for remote monitoring from anywhere. [ 28 ] In South Korea, approximately 10,000 Hyodol robots are deployed to the homes of elderly individuals living alone, providing essential support and companionship. Local governments, including provincial and county offices, have embraced Hyodol as a solution to address social challenges stemming from the country's rapidly aging society.Furthermore, the robot is widely utilized in the treatment of dementia patients at a university hospital in Gangwon province. [ 29 ] Hyodol was honored with the Mobile World Congress (MWC) Global Mobile Awards (GLOMO) in the \"Best Mobile Innovation for Connected Health and Wellbeing\" category on February 29, 2024. [ 29 ] Moxie Moxie was a companion robot for autistic children developed by a company called Embodied. Although it had limited motion, it presented itself as a lifelike avatar. It was designed to help the children learn emotional cognition, using remotely hosted large language models to direct its responses. When the company went out of business, the robots stopped working. [ 30 ] As of December 2024 [ update ] , there were plans to create an open-source backend to keep the devices running. [ 31 ] Criticisms and concerns The advent of companion robots has faced public criticism and concern, particularly regarding the ethical dilemmas of dependency on these devices. There are fears that such dependency could threaten the crucial child-caregiver bond. Concerns also extend to the potential impact of robot-assisted childcare on child development, with specific worries about the adverse effects on emotional and social skills due to reduced human interaction. [ 32 ] Privacy and security issues have gained prominence as well, with companion robots like iPal capable of collecting and transmitting data, thus raising the risks of surveillance and data misuse. [ 32 ] Besides concerns in child care, the integration of companion robots into the lives of the elderly and other vulnerable groups also raises concerns, specifically a problem of hallucinatory relationships. Individuals may begin to perceive these robots as sentient beings, leading to emotional attachments that blur the line between simulation and reality and dependency on robots. This could in turn worsen feelings of loneliness and detachment from humans. This highlights the necessity of implementing ethical guidelines and psychological support systems to navigate the complexities introduced by this technology, ensuring they serve as enhancements rather than replacements for human relationships. [ 33 ] Companion robots in fiction Companion robots have featured in numerous works of fiction, typically as part of a dystopian story. These include the TV series Humans and Better than Us , and the films Bicentennial Man , Cherry 2000 , Ex Machina , M3GAN and Companion . More positive depictions have been made in the films Big Hero 6 , After Yang and Robot &amp; Frank . [ 34 ] See also Virtual pet List of robotic dogs Furby Socially assistive robot References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ↑ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} \"Companion Robots Are Here. Just Don't Fall in Love With Them\" . WIRED . Retrieved 2018-07-05 . ↑ \"Robot caregivers are saving the elderly from lives of loneliness\" . Engadget . Retrieved 2018-07-05 . ↑ Wang, Kelly. \" 'iPal' robot companion for China's lonely children\" . phys.org . Retrieved 10 December 2021 . ↑ Dautenhahn, K.; Woods, S.; Kaouri, C.; Walters, M.L.; Kheng Lee Koay; Werry, I. (2005). \"What is a robot companion - friend, assistant or butler?\" . IEEE . pp. 1192– 1197. doi : 10.1109/IROS.2005.1545189 . ISBN 0-7803-8912-3 . Retrieved 2005-12-05 . ↑ \"Towards personal service robots for the elderly\" . Workshop on Interactive Robots and Entertainment . 25 . 2000. ↑ halusker (2023-10-25). \"The rise of robotic companions to address social isolation\" . Center for Healthy Aging . Retrieved 2024-04-22 . ↑ Gurley, George (16 April 2015). \"Is this the dawn of the sexbots? (NSFW)\" . Vanity Fair . Retrieved 7 June 2016 . ↑ Danaher, John (20 October 2017). \"Should We Be Thinking about Robot Sex?\" . Robot Sex . The MIT Press. doi : 10.7551/mitpress/9780262036689.003.0001 . ISBN 9780262036689 . Retrieved 2021-10-04 . ↑ Maras, Marie-Helen; Shapiro, Lauren R. (2017). \"Child sex dolls and robots: More than just an uncanny valley\". Journal of Internet Law . 21 (6): 3– 21. ProQuest 1973344803 . ↑ Barker, Ned; Devlin, Kate (14 February 2020). \"Sex, Robots and Touch\" . In-Touch: Digital Touch Communication . Retrieved 2021-10-04 . ↑ Robot sex: social and ethical implications . Danaher, John; McArthur, Neil, 1972–. Cambridge, MA. ISBN 978-0-262-34198-1 . OCLC 1005978964 . {{ cite book }} : CS1 maint: others ( link ) ↑ Balistreri, Maurizio, 1970- (2018). Sex robot: l'amore al tempo delle macchine . Roma. ISBN 978-88-6044-552-0 . OCLC 1081098188 . {{ cite book }} : CS1 maint: location missing publisher ( link ) CS1 maint: multiple names: authors list ( link ) CS1 maint: numeric names: authors list ( link ) ↑ Staff writer (15 September 2015). \"Intelligent machines: Call for a ban on robots designed as sex toys\" . BBC News . Retrieved 7 September 2016 . ↑ Danaher, John; Earp, Brian; Sandberg, Anders (20 October 2017). \"Chapter 4: Should We Campaign Against Sex Robots?\". In Danaher, John; McArthur, Neil (eds.). Robot Sex: Social and Ethical Implications . The MIT Press. pp. 47– 72. doi : 10.7551/mitpress/9780262036689.003.0004 . ISBN 978-0-262-03668-9 . Retrieved 2020-09-29 . ↑ \"Our Story\" . Campaign Against Sex Robots . Retrieved 2021-10-04 . 1 2 \"Paro\" . Retrieved 31 March 2024 . 1 2 Xiong, Caihua; Huang, Yongan; Xiong, Youlun (2008). Intelligent Robotics and Applications: First International Conference, ICIRA 2008 Wuhan, China, October 15-17, 2008 Proceedings . Berlin: Springer. pp. 538– 539. ISBN 9783540885122 . 1 2 Lamers, Maarten H.; Verbeek, Fons J. (2011). Human-Robot Personal Relationships: Third International Conference, HRPR 2010, Leiden, The Netherlands, June 23-24, 2010, Revised Selected Papers . Heidelberg: Springer Science &amp; Business Media. p. 13. ISBN 9783642193842 . ↑ \"CompanionAble\" . Retrieved 31 March 2024 . ↑ Wang, Kelly. \" 'iPal' robot companion for China's lonely children\" . Retrieved 31 March 2024 . 1 2 Saint-Aime, Sebastien; Le-Pevedic, Brigitte; Duhaut, Dominique; Shibata, Takanori (2007). EmotiRob: Companion robot Project,\" RO-MAN 2007 - The 16th IEEE International Symposium on Robot and Human Interactive Communication, Jeju, Korea (South) (PDF) . Jeju. pp. 919– 924. doi : 10.1109/ROMAN.2007.4415215 . {{ cite book }} : CS1 maint: location missing publisher ( link ) 1 2 Sojka, Petr; Horak, Aleš; Kopecek, Ivan (2008). Text, Speech and Dialogue: 11th International Conference, TSD 2008, Brno, Czech Republic, September 8-12, 2008, Proceedings . Berlin: Springer Science &amp; Business Media. p. 551. ISBN 9783540873907 . ↑ \"Lovot [ らぼっと ] \" . Lovot . Retrieved 2 May 2023 . ↑ \"Lovot [ らぼっと ] \" . Lovot Emotional Robotics . Retrieved 2 May 2023 . ↑ Nagase, Youka (6 October 2020). \"Japanese pet-robot Lovot is getting its own permanent cafe near Tokyo\" . TimeOut . Retrieved 2 May 2023 . ↑ \"NICOBO, a robot born out of empathy with consumers and sense of mission\" . Panasonic . Retrieved 31 March 2024 . ↑ \"Introducing NICOBO - Panasonic's Smart but Vulnerable Companion\" . Panasonic Global News . Panasonic . Retrieved 2 May 2023 . ↑ \"Hyodol\" . Hyodol . Panasonic . Retrieved 31 March 2024 . 1 2 \" [ MWC 24 ] S. Korean care robot company Hyodol wins health tech award at MWC\" . AJUPRESS . Retrieved 31 March 2024 . ↑ \"AI Company That Made Robots For Kids Goes Under, Robots Die - Aftermath\" . aftermath.site . 2024-12-09 . Retrieved 2025-02-02 . ↑ \"Moxie robot may be saved by a last-minute open-sourcing effort\" . AppleInsider . 2024-12-20 . Retrieved 2025-02-02 . 1 2 Jones, Raya A. (2019-09-01). \"Concerning the Apperception of Robot-Assisted Childcare\" . Philosophy &amp; Technology . 32 (3): 445– 456. doi : 10.1007/s13347-018-0306-6 . ISSN 2210-5441 . ↑ Bisconti Lucidi, Piercosma; Nardi, Daniele (2018-12-27). \"Companion Robots: The Hallucinatory Danger of Human-Robot Interactions\" . Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society . AIES '18. New York, NY, USA: Association for Computing Machinery. pp. 17– 22. doi : 10.1145/3278721.3278741 . ISBN 978-1-4503-6012-8 . ↑ Teo, Yugin (March 2021). \"Recognition, collaboration and community: science fiction representations of robot carers in Robot &amp; Frank, Big Hero 6 and Humans\" . Medical Humanities . 47 (1): 95– 102. doi : 10.1136/medhum-2019-011744 . ISSN 1468-215X . PMC 7907570 . PMID 32317298 .",
  "cached_at": "2025-10-25T19:37:58.851333"
}