{
  "title": "Information ethics",
  "summary": "Information ethics has been defined as the branch of ethics that focuses on the relationship between the creation, organization, dissemination, and use of information, and the ethical standards and moral codes governing human conduct in society . It examines the morality that comes from information as a resource, a product, or as a target. It provides a critical framework for considering moral issues concerning informational privacy, moral agency, new environmental issues, problems arising from the life-cycle of information. It is very vital to understand that librarians, archivists, information professionals among others, really understand the importance of knowing how to disseminate proper information as well as being responsible with their actions when addressing information",
  "content": "Information ethics Branch of ethics Not to be confused with Cyberethics or Computer ethics . Information ethics has been defined as the branch of ethics that focuses on the relationship between the creation, organization, dissemination, and use of information , and the ethical standards and moral codes governing human conduct in society . 1 It examines the morality that comes from information as a resource, a product, or as a target. 2 It provides a critical framework for considering moral issues concerning informational privacy , moral agency (e.g. whether artificial agents may be moral), new environmental issues (especially how agents should behave in the infosphere ), problems arising from the life-cycle (creation, collection, recording, distribution, processing, etc.) of information (especially ownership and copyright, digital divide , and digital rights ). It is very vital to understand that librarians, archivists, information professionals among others, really understand the importance of knowing how to disseminate proper information as well as being responsible with their actions when addressing information. 3 Information ethics has evolved to relate to a range of fields such as computer ethics , 4 medical ethics, journalism 5 and the philosophy of information . As the use and creation of information and data form the foundation of machine learning , artificial intelligence and many areas of mathematics, information ethics also plays a central role in the ethics of artificial intelligence , big data ethics and ethics in mathematics . History The term information ethics was first coined by Robert Hauptman and used in the book Ethical Challenges in Librarianship . The field of information ethics has a relatively short but progressive history having been recognized in the United States for nearly 20 years. 6 The origins of the field are in librarianship though it has now expanded to the consideration of ethical issues in other domains including computer science, the internet, media, journalism, management information systems, and business. 6 Evidence of scholarly work on this subject can be traced to the 1980s, when an article authored by Barbara J. Kostrewski and Charles Oppenheim and published in the Journal of Information Science , discussed issues relating to the field including confidentiality, information biases, and quality control. 6 Another scholar, Robert Hauptman, has also written extensively about information ethics in the library field and founded the Journal of Information Ethics in 1992. 7 One of the first schools to introduce an Information Ethics course was the University of Pittsburgh in 1990. The course was a master's level course on the concept of Information Ethics. Soon after, Kent State University also introduced a master's level course called Ethical Concerns For Library and Information Professionals. Eventually, the term Information Ethics became more associated with the computer science and information technology disciplines in university. Still however, it is uncommon for universities to devote entire courses to the subject. Due to the nature of technology, the concept of information ethics has spread to other realms in the industry. Thus, concepts such as cyberethics, a concept which discusses topics such as the ethics of artificial intelligence and its ability to reason, and media ethics which applies to concepts such as lies, censorship, and violence in the press. Therefore, due to the advent of the internet, the concept of information ethics has been spread to other fields other than librarianship now that information has become so readily available. Information has become more relevant now than ever now that the credibility of information online is more blurry than print articles due to the ease of publishing online articles. All of these different concepts have been embraced by the International Center for Information Ethics (ICIE), established by Rafael Capurro in 1999. 8 Dilemmas regarding the life of information are becoming increasingly important in a society that is defined as the information society . The explosion of so much technology has brought information ethics to a forefront in ethical considerations. Information transmission and literacy are essential concerns in establishing an ethical foundation that promotes fair, equitable, and responsible practices. Information ethics broadly examines issues related to ownership, access, privacy, security, and community. It is also concerned with relational issues such as the relationship between information and the good of society, the relationship between information providers and the consumers of information . 9 Information technology affects common issues such as copyright protection, intellectual freedom, accountability, privacy, and security. Many of these issues are difficult or impossible to resolve due to fundamental tensions between Western moral philosophies (based on rules, democracy, individual rights, and personal freedoms) and the traditional Eastern cultures (based on relationships, hierarchy, collective responsibilities, and social harmony). 10 The multi-faceted dispute between Google and the government of the People's Republic of China reflects some of these fundamental tensions. Professional codes offer a basis for making ethical decisions and applying ethical solutions to situations involving information provision and use which reflect an organization's commitment to responsible information service. Evolving information formats and needs require continual reconsideration of ethical principles and how these codes are applied. Considerations regarding information ethics influence personal decisions, professional practice, and public policy . 11 Therefore, ethical analysis must provide a framework to take into consideration many, diverse domains (ibid.) regarding how information is distributed. Censorship Censorship is an issue commonly involved in the discussion of information ethics because it describes the inability to access or express opinions or information based on the belief it is bad for others to view this opinion or information. 12 Sources that are commonly censored include books, articles, speeches, art work, data, music and photos. 12 Censorship can be perceived both as ethical and non-ethical in the field of information ethics. Those who believe censorship is ethical say the practice prevents readers from being exposed to offensive and objectionable material. 12 Topics such as sexism, racism, homophobia, and anti-semitism are present in public works and are widely seen as unethical in the public eye. 13 There is concern regarding the exposure of these topics to the world, especially the young generation. 13 The Australian Library Journal states proponents for censorship in libraries, the practice of librarians deciphering which books/ resources to keep in their libraries, argue the act of censorship is an ethical way to provide information to the public that is considered morally sound, allowing positive ethics instead of negative ethics to be dispersed. 13 According to the same journal, librarians have an ethical duty to protect the minds, particularly young people, of those who read their books through the lens of censorship to prevent the readers from adopting the unethical ideas and behaviors portrayed in the books. 13 However, others in the field of information ethics argue the practice of censorship is unethical because it fails to provide all available information to the community of readers. British philosopher John Stuart Mill argued censorship is unethical because it goes directly against the moral concept of utilitarianism . 14 Mill believes humans are unable to have true beliefs when information is withheld from the population via censorship and acquiring true beliefs without censorship leads to greater happiness. 14 According to this argument, true beliefs and happiness (of which both concepts are considered ethical) cannot be obtained through the practice of censorship. Librarians and others who disperse information to the public also face the dilemma of the ethics of censorship through the argument that censorship harms students and is morally wrong because they are unable to know the full extent of knowledge available to the world. 13 The debate of information ethics in censorship was highly contested when schools removed information about evolution from libraries and curriculums due to the topic conflicting with religious beliefs. 13 In this case, advocates against ethics in censorship argue it is more ethical to include multiple sources information on a subject, such as creation, to allow the reader to learn and decipher their beliefs. 13 Ethics of downloading Illegal downloading has also caused some ethical concerns 15 and raised the question whether digital piracy is equivalent to stealing or not. 16 17 When asked the question Is it ethical to download copyrighted music for free? in a survey, 44 percent of a group of primarily college-aged students responded Yes. 18 Christian Barry believes that understanding illegal downloading as equivalent to common theft is problematic, because clear and morally relevant differences can be shown between stealing someone’s handbag and illegally downloading a television series . On the other hand, he thinks consumers should try to respect intellectual property unless doing so imposes unreasonable cost on them. 19 In an article titled Download This Essay: A Defence of Stealing Ebooks , Andrew Forcehimes argues that the way we think about copyrights is inconsistent, because every argument for (physical) public libraries is also an argument for illegally downloading ebooks and every argument against downloading ebooks would also be an argument against libraries. 20 In a reply, Sadulla Karjiker argues that economically, there is a material difference between permitting public libraries making physical books available and allowing such online distribution of ebooks. 21 Ali Pirhayati has proposed a thought experiment based on a high-tech library to neutralize the magnitude problem (suggested by Karjiker), and justify Forcehimes’ main idea. 22 Security and privacy Ethical concerns regarding international security, surveillance, and the right to privacy are on the rise. 23 The issues of security and privacy commonly overlap in the field of information, due to the interconnectedness of online research and the development of Information Technology (IT) . 24 Some of the areas surrounding security and privacy are identity theft , online economic transfers, medical records, and state security. 25 Companies, organizations, and institutions use databases to store, organize, and distribute user's information—with or without their knowledge. 25 Individuals are far more likely to part with personal information when it seems that they will have some sort of control over the use of the information or if the information is given to an entity that they already have an established relationship with. In these specific circumstances, subjects will be much inclined to believe that their information has been collected for pure collection's sake. An entity may also be offering goods or services in exchange for the client's personal information. This type of collection method may seem valuable to a user due to the fact that the transaction appears to be free in the monetary sense. This forms a type of social contract between the entity offering the goods or services and the client. The client may continue to uphold their side of the contract as long as the company continues to provide them with a good or service that they deem worthy. 26 The concept of procedural fairness indicates an individual's perception of fairness in a given scenario. Circumstances that contribute to procedural fairness are providing the customer with the ability to voice their concerns or input, and control over the outcome of the contract. Best practice for any company collecting information from customers is to consider procedural fairness. 27 This concept is a key proponent of ethical consumer marketing and is the basis of United States Privacy Laws, the European Union's privacy directive from 1995, and the Clinton Administration's June 1995 guidelines for personal information use by all National Information Infrastructure participants. 28 An individual being allowed to remove their name from a mailing list is considered a best information collecting practice. In a few Equifax surveys conducted in the years 1994–1996, it was found that a substantial amount of the American public was concerned about business practices using private consumer information, and that is causes more harm than good. 29 Throughout the course of a customer-company relationship, the company can likely accumulate a plethora of information from its customer. With data processing technology flourishing, it allows for the company to make specific marketing campaigns for each of their individual customers. 26 Data collection and surveillance infrastructure has allowed companies to micro-target specific groups and tailor advertisements for certain populations. 30 Medical records A recent trend of medical records is to digitize them. The sensitive information secured within medical records makes security measures vitally important. 31 The ethical concern of medical record security is great within the context of emergency wards, where any patient records can be accessed at all times. 31 Within an emergency ward, patient medical records need to be available for quick access; however, this means that all medical records can be accessed at any moment within emergency wards with or without the patient present. 31 Ironically, the donation of one's body organs to science is easier in most Western jurisdictions than donating one's medical records for research. 32 International security Warfare has also changed the security of countries within the 21st Century. After the events of 9-11 and other terrorism attacks on civilians, surveillance by states raises ethical concerns of the individual privacy of citizens. The USA PATRIOT Act 2001 is a prime example of such concerns. Many other countries, especially European nations within the current climate of terrorism, is looking for a balancing between stricter security and surveillance, and not committing the same ethical concerns associated with the USA Patriot Act. 33 International security is moving to towards the trends of cybersecurity and unmanned systems, which involve the military application of IT. 23 Ethical concerns of political entities regarding information warfare include the unpredictability of response, difficulty differentiating civilian and military targets, and conflict between state and non-state actors. 23 Journals The main, peer-reviewed, academic journals reporting on information ethics are the Journal of the Association for Information Systems , the flagship publication of the Association for Information Systems , and Ethics and Information Technology , published by Springer. Branches Bioinformatics Business ethics Computer ethics Cyberethics Information ecology Library Bill of Rights Media ethics Notes ↑ Joan, Reitz M. Information Ethics. Online Dictionary For Library And Information Science. N.p., 2010. Web. http://www.abc-clio.com/ODLIS/odlis_i.aspx >. ↑ body:not(.skin-timeless):not(.skin-minerva) Froehlich, Thomas (December 2004). A brief history of information ethics . bid.ub.edu . Kent State University. ↑ Carbo, Toni ; Almagno, Stephen. Information Ethics: The Duty, Privilege and Challenge of Educating Information Professionals (PDF) . Archived from the original (PDF) on 10 September 2021 . Retrieved 28 February 2017 . ↑ Floridi, Luciano (1999). Information Ethics: On the Theoretical Foundations of Computer Ethics (PDF) . Ethics and Information Technology . 1 (1): 37– 56. doi : 10.1023/A:1010018611096 . S2CID 1071794 . Archived from the original (PDF) on 9 November 2005. ↑ Floridi, Luciano (June 2005). Information ethics, its nature and scope . ACM SIGCAS Computers and Society . 35 (2): 3. doi : 10.1145/1111646.1111649 . hdl : 2299/3001 . S2CID 25230743 . 1 2 3 Froehlich, Thomas (December 2004). A Brief History of Information Ethics . Textos Universitaris de Biblioteconomia I Documentació . 13 . ISSN 1575-5886 . ↑ Kerr, Michael (29 March 2010). Introduction . Ethics And Information Management In The 21st Century . University of British Columbia. Archived from the original on 31 March 2012. ↑ A brief history of information ethics . BiD: textos universitaris de biblioteconomia i documentació . December 2004 . Retrieved 2019-11-25 . ↑ Moran, Barbara A.; Stueart, Robert D.; Morner, Claudia J. (2013). Library and Information Center Management . Santa Barbara, CA: Libraries Unlimited. p. 321. ↑ M.G. Martinsons and D. Ma (2009) Sub-Cultural Differences in Information Ethics across China: Focus On Chinese Management Generation Gaps , Journal of the Association for Information Systems 10.11, 957-973. ↑ E. Elrod and M. Smith (2005). Information Ethics , in Encyclopedia of Science, Technology, and Ethics , ed. by Carl Mitcham . Vol. 2: D-K (1004–1011). Detroit: Macmillan Reference USA. 1 2 3 Mathiesen, Kay (2008). Censorship and Access to Expression (PDF) . The Handbook of Information and Computer Ethics : 573– 585. 1 2 3 4 5 6 7 Duthie, Fiona (July 2013). Libraries and the Ethics of Censorship . Australian Library Journal . 53 (3): 85– 94. doi : 10.1080/00049670.2010.10735994 . S2CID 110511989 . 1 2 Fallis, Don (2007). Information Ethics for 21st Century Library Professionals . Library Hi Tech . 25 : 2– 12. doi : 10.1108/07378830710735830 . ↑ Robertson, Kirsten; McNeill, Lisa; Green, James; Roberts, Claire (1 June 2012). Illegal Downloading, Ethical Concern, and Illegal Behavior . Journal of Business Ethics . 108 (2): 215– 227. doi : 10.1007/s10551-011-1079-3 . ISSN 1573-0697 . S2CID 145311279 . ↑ The Ethical Visions of Copyright Law . ↑ Levin, Aron M.; Dato-on, Mary Conway; Rhee, Kenneth (1 January 2004). Money for Nothing and Hits for Free: The Ethics of Downloading Music from Peer-to-Peer Web Sites . Journal of Marketing Theory and Practice . 12 (1): 48– 60. doi : 10.1080/10696679.2004.11658512 . ISSN 1069-6679 . S2CID 168030746 . ↑ Is it ethical to download music for free? . cs.stanford.edu . ↑ Barry, Christian. Is downloading really stealing? The ethics of digital piracy . The Conversation . ↑ Forcehimes, Andrew T, Download This Essay: A Defence of Stealing Ebooks , Think , Volume 12, Issue 34, June 2013, pp 109–115 ↑ Karjiker, Sadulla (Autumn 2014). A Response to Forcehimes' 'download This Essay: A Defence of Stealing Ebooks' . Think . 13 (38): 51– 57. doi : 10.1017/S1477175614000086 . ISSN 1477-1756 . S2CID 146542750 . ↑ Pirhayati, Ali (Spring 2019). The Bigger Picture: A Commentary on the Forcehimes–Karjiker Debate . Think . 18 (51): 101– 105. doi : 10.1017/S1477175618000386 . ISSN 1477-1756 . S2CID 171938566 . 1 2 3 Pretorius, Joelien (April 2003). Ethics and International Security in the Information Age . Defense Security Analysis . 19 (2): 165– 175. doi : 10.1080/1475179032000083370 . hdl : 10566/5799 . S2CID 154855010 . ↑ Kernaghan, Kenneth (June 2014). Digital dilemmas: Values, ethics, and information technology . Canadian Public Administration . 57 (2): 295– 317. doi : 10.1111/capa.12069 . 1 2 Quigley, Marian (2008). Encyclopedia of Information and Ethics Security . Information Science Reference : 660. 1 2 Culnan, Mary J.; Armstrong, Pamela K. (February 1999). Information Privacy Concerns, Procedural Fairness, and Impersonal Trust: An Empirical Investigation . Organization Science . 10 (1): 104– 115. doi : 10.1287/orsc.10.1.104 . ISSN 1047-7039 . S2CID 54041604 . ↑ Lind, E. Allan; Tyler, Tom R. (1988), Introduction , The Social Psychology of Procedural Justice , Springer US, pp. 1– 6, doi : 10.1007/978-1-4899-2115-4_1 , ISBN 978-1-4899-2117-8 ↑ Kalil, Thomas. “Public Policy and the National Information Infrastructure.” Business Economics , vol. 30, no. 4, 1995, pp. 15–20. JSTOR , www.jstor.org/stable/23487729. ↑ Equifax :: Consumers :: Privacy Survey . www.frogfire.com . Archived from the original on 2015-06-02 . Retrieved 2020-11-23 . ↑ Crain, Matthew; Nadler, Anthony (2019). Political Manipulation and Internet Advertising Infrastructure . Journal of Information Policy . 9 : 370– 410. doi : 10.5325/jinfopoli.9.2019.0370 . ISSN 2381-5892 . JSTOR 10.5325/jinfopoli.9.2019.0370 . S2CID 214217187 . 1 2 3 Stahl, Bernd Carsten; Doherty, Neil F.; Shaw, Mark; Janicke, Helge (30 November 2013). Critical Theory as an Approach to the Ethics of Information Security . Science and Engineering Ethics . 20 (3): 675– 699. doi : 10.1007/s11948-013-9496-6 . PMID 24293199 . S2CID 20736985 . ↑ Shaw, David M. (2019). Defining Data Donation After Death: Metadata, Families, Directives, Guardians and the Route to Big Consent . In Krutzinna, Jenny; Floridi, Luciano (eds.). The Ethics of Medical Data Donation . Philosophical Studies Series. Vol. 137. Springer. doi : 10.1007/978-3-030-04363-6_10 . ISBN 978-3-030-04362-9 . PMID 32091678 . S2CID 58014386 . ↑ Levi, Wall, Michael, David S. (June 2004). Technologies, Security, and Privacy in the Post-9/11 European Information Society . Journal of Law and Society . 31 (2): 194– 220. doi : 10.1111/j.1467-6478.2004.00287.x . : CS1 maint: multiple names: authors list ( link ) Further reading Floridi, Luciano (2013). The Ethics of Information . Oxford: Oxford University Press. Froehlich, Thomas (2017). A Not-So-Brief Account of Current Information Ethics: The Ethics of Ignorance, Missing Information, Misinformation, Disinformation and Other Forms of Deception or Incompetence . BiD: textos universitaris de biblioteconomia i documentacio . Num. 39. Himma, Kenneth E. ; and Tavani, Herman T. (eds.) (2008). The Handbook of Information and Computer Ethics , New Jersey: John Wiley and Sons, Inc.. Moore, Adam D. ed (2005). Information Ethics: Privacy, Property, and Power , University of Washington Press. Spinello, Richard A.; and Herman T. Tavani (eds.) (2004). Readings in Cyberethics , second ed. Mass.: Jones and Bartlett Publishers. Tavani, Herman T. (2004). Ethics Technology: Ethical Issues in an Age of Information and Communication Technology . New Jersey: John Wiley and Sons, Inc.. External links Scholia has a topic profile for Information ethics . Library resources about Information ethics Resources in your library Resources in other libraries IRIE, The International Review of Information Ethics Computer Professionals for Social Responsibility IEG, the Information Ethics research Group at Oxford University Information Ethicist International Center for Information Ethics body.skin--responsive html.skin-theme-clientpref-night v t e Ethics Normative Consequentialism Deontology Care Particularism Pragmatic Role Suffering-focused Utilitarianism Virtue Applied Animal Artificial intelligence Bio Business Computer Discourse Economic Engineering Environmental Land Legal Machine Marketing Meat eating Media Medical Nursing Professional Programming Research Sexual Technology Terraforming Uncertain sentience Work Meta Absolutism Axiology Cognitivism Realism Naturalism Non-naturalism Subjectivism Ideal observer theory Divine command theory Constructivism Euthyphro dilemma Intuitionism Nihilism Non-cognitivism Emotivism Expressivism Quasi-realism Universal prescriptivism Rationalism Relativism Skepticism Universalism Value monism – Value pluralism Schools Buddhist Christian Protestant Confucian Epicurean Existentialist Feminist Islamic Jewish Kantian Rousseauian Stoic Tao Concepts Accountability Authority Autonomy Blame Common sense Compassion Conscience Consent Culture of life Desert Dignity Double standard Duty Equality Etiquette Eudaimonia Family values Fidelity Free will Good and evil Good Evil Problem of evil Greed Happiness Honour Ideal Immorality Importance Justice Liberty Loyalty Moral agency Moral circle expansion Moral courage Moral hierarchy Moral imperative Morality Norm Pacifism Political freedom Precept Punishment Rights Self-discipline Suffering Stewardship Sympathy Theodicy Torture Trust Utility Value Instrumental Intrinsic Japan Western Vice Virtue Vow Wrong Ethicists Confucius Mozi Socrates Plato Aristotle Diogenes Mencius Xunzi Cicero Augustine Valluvar Aquinas Spinoza Butler Hume Smith Kant Hegel Schopenhauer Bentham Mill Kierkegaard Sidgwick Nietzsche Moore Barth Tillich Bonhoeffer Foot Rawls Dewey Williams Mackie Anscombe Frankena MacIntyre Hare Singer Parfit Nagel Adams Taylor Azurmendi Korsgaard Nussbaum Works Nicomachean Ethics (c. 322 BC) Tirukkural (c. 450 CE) Ethics (Spinoza) (1677) Fifteen Sermons Preached at the Rolls Chapel (1726) A Treatise of Human Nature (1740) The Theory of Moral Sentiments (1759) An Introduction to the Principles of Morals and Legislation (1780) Groundwork of the Metaphysics of Morals (1785) Critique of Practical Reason (1788) Elements of the Philosophy of Right (1820) Either/Or (1843) Utilitarianism (1861) The Methods of Ethics (1874) On the Genealogy of Morality (1887) Principia Ethica (1903) A Theory of Justice (1971) Practical Ethics (1979) After Virtue (1981) Reasons and Persons (1984) Related Axiology Casuistry Descriptive ethics Ethics in religion Evolutionary ethics History of ethics Human rights Ideology Moral psychology Philosophy of law Political philosophy Population ethics Rehabilitation Secular ethics Social philosophy Category Outline Portal WikiProject v t e Philosophy Branches Branches Applied philosophy Logic Metaphilosophy Philosophical methodology Philosophy of education Philosophy of information Philosophy of language Philosophy of mathematics Philosophy of religion Philosophy of science Political philosophy Practical philosophy Social philosophy Theoretical philosophy Aesthetics Aesthetic response Formalism Institutionalism Epistemology Empiricism Fideism Naturalism Particularism Rationalism Skepticism Solipsism Ethics Consequentialism Deontology Virtue Free will Compatibilism Determinism Hard Incompatibilism Hard Libertarianism Metaphysics Atomism Dualism Idealism Monism Naturalism Realism Mind Behaviorism Eliminativism Emergentism Epiphenomenalism Functionalism Objectivism Subjectivism Normativity Absolutism Particularism Relativism Nihilism Skepticism Universalism Ontology Action Event Process Reality Anti-realism Conceptualism Idealism Materialism Naturalism Nominalism Physicalism Realism By era By era Ancient Western Medieval Renaissance Early modern Modern Contemporary Ancient Chinese Agriculturalism Confucianism Legalism Logicians Mohism Chinese naturalism Taoism Yangism Greco- Roman Presocratic Ionians Pythagoreans Eleatics Atomists Sophists Cyrenaics Cynicism Eretrian school Megarian school Academy Peripatetic school Hellenistic philosophy Pyrrhonism Stoicism Epicureanism Academic Skepticism Middle Platonism School of the Sextii Neopythagoreanism Second Sophistic Neoplatonism Church Fathers Dispositio Indian Hindu Samkhya Nyaya Vaisheshika Yoga Mīmāṃsā Ājīvika Ajñana Cārvāka Jain Anekantavada Syādvāda Buddhist Abhidharma Sarvāstivadā Pudgalavada Sautrāntika Madhyamaka Svatantrika and Prasangika Śūnyatā Yogacara Tibetan Persian Mazdakism Mithraism Zoroastrianism Zurvanism Medieval East Asian Neotaoism Tiantai Huayan Chan Zen Neo-Confucianism Korean Confucianism European Christian Byzantine Augustinianism Scholasticism Thomism Scotism Occamism Renaissance humanism Indian Vedanta Acintya bheda abheda Advaita Bhedabheda Dvaita Nimbarka Sampradaya Shuddhadvaita Vishishtadvaita Navya-Nyāya Islamic Aristotelianism Averroism Avicennism Illuminationism ʿIlm al-Kalām Sufi Jewish Judeo-Islamic Modern Anarchism Classical Realism Collectivism Conservatism Determinism Dualism Edo neo-Confucianism Empiricism Existentialism Foundationalism Historicism Holism Humanism Anti- Idealism Absolute British German Italian Objective Subjective Transcendental Individualism Kokugaku Liberalism Materialism Modernism Monism Naturalism Natural law Nihilism New Confucianism Neo-scholasticism Pessimism Pragmatism Phenomenology Positivism Reductionism Rationalism Social contract Socialism Transcendentalism Utilitarianism People Cartesianism Kantianism Neo Kierkegaardianism Krausism Hegelianism Marxism Newtonianism Nietzscheanism Spinozism Contemporary Analytic Applied ethics Analytic feminism Analytical Marxism Communitarianism Consequentialism Critical rationalism Experimental philosophy Falsificationism Foundationalism / Coherentism Internalism and externalism Logical positivism Legal positivism Meta-ethics Moral realism Quinean naturalism Normative ethics Ordinary language philosophy Postanalytic philosophy Quietism Rawlsian Reformed epistemology Systemics Scientism Scientific realism Scientific skepticism Transactionalism Contemporary utilitarianism Vienna Circle Wittgensteinian Continental Critical theory Deconstruction Existentialism Feminist Frankfurt School Hermeneutics Neo-Marxism New Historicism Phenomenology Posthumanism Postmodernism Post-structuralism Social constructionism Structuralism Western Marxism Miscellaneous Kyoto School Objectivism Postcritique Russian cosmism By region By region African Bantu Egyptian Ethiopian Africana Eastern Buddhist Chinese Indian Indonesian Japanese Korean Taiwanese Vietnamese Middle Eastern Iranian Islamic Jewish Pakistani Turkish Western ( Analytic / Continental ) American Australian British Scottish Canada Czech Danish Dutch Finland French German Greek Italian Maltese Polish Slovene Spanish Miscellaneous Amerindian Aztec Romanian Russian Yugoslav Philosophy portal Category Authority control databases : National Japan informační etika /span> '> Czech Republic",
  "cached_at": "2025-10-25T20:05:23.284057"
}