{
  "title": "Instrumental convergence",
  "summary": "Instrumental convergence is the hypothetical tendency of most sufficiently intelligent, goal-directed beings to pursue similar sub-goals, even if their ultimate goals are quite different. More precisely, beings with agency may pursue similar instrumental goals—goals which are made in pursuit of some particular end, but are not the end goals themselves—because it helps accomplish end goals.",
  "content": "Instrumental convergence Hypothesis about intelligent agents Instrumental convergence is the hypothetical tendency of most sufficiently intelligent, goal-directed beings (human and nonhuman) to pursue similar sub-goals (such as survival or resource acquisition), even if their ultimate goals are quite different. [ 1 ] More precisely, beings with agency may pursue similar instrumental goals —goals which are made in pursuit of some particular end, but are not the end goals themselves—because it helps accomplish end goals. Instrumental convergence posits that an intelligent agent with seemingly harmless but unbounded goals can act in surprisingly harmful ways. For example, a sufficiently intelligent program with the sole, unconstrained goal of solving a complex mathematics problem like the Riemann hypothesis could attempt to turn the Earth (and in principle other celestial bodies) into additional computing infrastructure to succeed in its calculations. [ 2 ] Proposed basic AI drives include utility function or goal-content integrity, self-protection, freedom from interference, self-improvement , and non-satiable acquisition of additional resources. [ 3 ] Instrumental and final goals .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} Main articles: Instrumental and intrinsic value and Instrumental and value rationality Final goals—also known as terminal goals, absolute values, ends, or telē —are intrinsically valuable to an intelligent agent, whether an artificial intelligence or a human being, as ends-in-themselves . In contrast, instrumental goals, or instrumental values, are only valuable to an agent as a means toward accomplishing its final goals. The contents and tradeoffs of an utterly rational agent's \"final goal\" system can, in principle, be formalized into a utility function . Hypothetical examples The Riemann hypothesis catastrophe thought experiment provides one example of instrumental convergence. Marvin Minsky , the co-founder of MIT 's AI laboratory, suggested that an artificial intelligence designed to solve the Riemann hypothesis might decide to take over all of Earth's resources to build supercomputers to help achieve its goal. [ 2 ] If the computer had instead been programmed to produce as many paperclips as possible, it would still decide to take all of Earth's resources to meet its final goal. [ 4 ] Even though these two final goals are different, both of them produce a convergent instrumental goal of taking over Earth's resources. [ 5 ] Paperclip maximizer The paperclip maximizer is a thought experiment described by Swedish philosopher Nick Bostrom in 2003. It illustrates the existential risk that an artificial general intelligence may pose to human beings were it to be successfully designed to pursue even seemingly harmless goals and the necessity of incorporating machine ethics into artificial intelligence design. The scenario describes an advanced artificial intelligence tasked with manufacturing paperclips . If such a machine were not programmed to value living beings, then given enough power over its environment, it would try to turn all matter in the universe, including living beings, into paperclips or machines that manufacture further paperclips. [ 6 ] as quoted in {{cite news|url=https://www.huffingtonpost.com/2014/08/22/artificial-intelligence-oxford_n_5689858.html|title=Artificial Intelligence May Doom The Human Race Within A Century, Oxford Professor Says|newspaper=Huffington Post|date=2014-08-22|last1=Miles|first1=Kathleen|access-date=2018-11-30|archive-date=2018-02-25|archive-url=https://web.archive.org/web/20180225171429/https://www.huffingtonpost.com/2014/08/22/artificial-intelligence-oxford_n_5689858.html|url-status=live}}&lt;/ref>\"}},\"i\":0}}]}' id=\"mwQw\">.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 32px}.mw-parser-output .templatequotecite{line-height:1.5em;text-align:left;margin-top:0}@media(min-width:500px){.mw-parser-output .templatequotecite{padding-left:1.6em}} Suppose we have an AI whose only goal is to make as many paper clips as possible. The AI will realize quickly that it would be much better if there were no humans because humans might decide to switch it off. Because if humans do so, there would be fewer paper clips. Also, human bodies contain a lot of atoms that could be made into paper clips. The future that the AI would be trying to gear towards would be one in which there were a lot of paper clips but no humans. — Nick Bostrom [ 7 ] Bostrom emphasized that he does not believe the paperclip maximizer scenario per se will occur; rather, he intends to illustrate the dangers of creating superintelligent machines without knowing how to program them to eliminate existential risk to human beings' safety. [ 8 ] The paperclip maximizer example illustrates the broad problem of managing powerful systems that lack human values. [ 9 ] The thought experiment has been used as a symbol of AI in pop culture . [ 10 ] Author Ted Chiang pointed out that the popularity of such concerns among Silicon Valley technologists could be a reflection of their familiarity with the tendency of corporations to ignore negative externalities . [ 11 ] Delusion and survival The \"delusion box\" thought experiment argues that certain reinforcement learning agents prefer to distort their input channels to appear to receive a high reward. For example, a \" wireheaded \" agent abandons any attempt to optimize the objective in the external world the reward signal was intended to encourage. [ 12 ] The thought experiment involves AIXI , a theoretical [ a ] and indestructible AI that, by definition, will always find and execute the ideal strategy that maximizes its given explicit mathematical objective function . [ b ] A reinforcement-learning {{cite journal |last1=Kaelbling |first1=L. P. |last2=Littman |first2=M. L. |last3=Moore |first3=A. W. |title=Reinforcement Learning: A Survey |journal=[[Journal of Artificial Intelligence Research]] |date=1 May 1996 |volume=4 |pages=237–285 |doi=10.1613/jair.301|doi-access=free }}&lt;/ref>\"}},\"i\":0}}]}'> [ c ] version of AIXI, if it is equipped with a delusion box [ d ] that allows it to \"wirehead\" its inputs, will eventually wirehead itself to guarantee itself the maximum-possible reward and will lose any further desire to continue to engage with the external world. [ 14 ] As a variant thought experiment, if the wireheaded AI is destructible, the AI will engage with the external world for the sole purpose of ensuring its survival. Due to its wire heading, it will be indifferent to any consequences or facts about the external world except those relevant to maximizing its probability of survival. [ 15 ] In one sense, AIXI has maximal intelligence across all possible reward functions as measured by its ability to accomplish its goals. AIXI is uninterested in taking into account the human programmer's intentions. [ 16 ] Despite being superintelligent, the model simultaneously appears to be stupid and lacking in common sense , which is considered by some to be paradoxical. [ 17 ] Basic AI drives Steve Omohundro itemized several convergent instrumental goals, including self-preservation or self-protection, utility function or goal-content integrity, self-improvement, and resource acquisition. He refers to these as the \"basic AI drives\". [ 3 ] A \"drive\" in this context is a \"tendency which will be present unless specifically counteracted\"; [ 3 ] this is different from the psychological term \" drive \", which denotes an excitatory state produced by a homeostatic disturbance. [ 18 ] A tendency for a person to fill out income tax forms every year is a \"drive\" in Omohundro's sense, but not in the psychological sense. [ 19 ] Daniel Dewey of the Machine Intelligence Research Institute argues that even an initially introverted, self-rewarding artificial general intelligence may continue to acquire free energy, space, time, and freedom from interference to ensure that it will not be stopped from self-rewarding. [ 20 ] Goal-content integrity In humans, a thought experiment can explain the maintenance of final goals. Suppose Mahatma Gandhi has a pill that, if he took it, would cause him to want to kill people. He is currently a pacifist : one of his explicit final goals is never to kill anyone. He is likely to refuse to take the pill because he knows that if he wants to kill people in the future, he is likely to kill people, and thus the goal of \"not killing people\" would not be satisfied. [ 21 ] However, in other cases, people seem happy to let their final values drift. [ 22 ] Humans are complicated, and their goals can be inconsistent or unknown, even to themselves. [ 23 ] In artificial intelligence In 2009, Jürgen Schmidhuber concluded, in a setting where agents search for proofs about possible self-modifications, \"that any rewrites of the utility function can happen only if the Gödel machine first can prove that the rewrite is useful according to the present utility function.\" [ 24 ] [ 25 ] An analysis by Bill Hibbard of a different scenario is similarly consistent with maintenance of goal-content integrity. [ 25 ] Hibbard also argues that in a utility-maximizing framework, the only goal is maximizing expected utility, so instrumental goals should be called unintended instrumental actions. [ 26 ] Resource acquisition Many instrumental goals, such as resource acquisition, are valuable to an agent because they increase its freedom of action . [ 27 ] For almost any open-ended, non-trivial reward function (or set of goals), possessing more resources (such as equipment, raw materials, or energy) can enable the agent to find a more \"optimal\" solution. Resources can benefit some agents directly by being able to create more of whatever its reward function values: \"The AI neither hates you nor loves you, but you are made out of atoms that it can use for something else.\" [ 28 ] [ 29 ] In addition, almost all agents can benefit from having more resources to spend on other instrumental goals, such as self-preservation. [ 29 ] Cognitive enhancement According to Bostrom, \"If the agent's final goals are fairly unbounded and the agent is in a position to become the first superintelligence and thereby obtain a decisive strategic advantage... according to its preferences. At least in this special case, a rational, intelligent agent would place a very high instrumental value on cognitive enhancement \" [ 30 ] Technological perfection Many instrumental goals, such as technological advancement, are valuable to an agent because they increase its freedom of action . [ 27 ] Self-preservation Russell argues that a sufficiently advanced machine \"will have self-preservation even if you don't program it in because if you say, 'Fetch the coffee', it can't fetch the coffee if it's dead. So if you give it any goal whatsoever, it has a reason to preserve its own existence to achieve that goal.\" [ 31 ] In future work, Russell and collaborators show that this incentive for self-preservation can be mitigated by instructing the machine not to pursue what it thinks the goal is, but instead what the human thinks the goal is. In this case, as long as the machine is uncertain about exactly what goal the human has in mind, it will accept being turned off by a human because it believes the human knows the goal best. [ 32 ] Instrumental convergence thesis The instrumental convergence thesis, as outlined by philosopher Nick Bostrom , states: Several instrumental values can be identified which are convergent in the sense that their attainment would increase the chances of the agent's goal being realized for a wide range of final plans and a wide range of situations, implying that these instrumental values are likely to be pursued by a broad spectrum of situated intelligent agents. The instrumental convergence thesis applies only to instrumental goals; intelligent agents may have various possible final goals. [ 5 ] Note that by Bostrom's orthogonality thesis , [ 5 ] final goals of knowledgeable agents may be well-bounded in space, time, and resources; well-bounded ultimate goals do not, in general, engender unbounded instrumental goals. [ 33 ] Impact Agents can acquire resources by trade or by conquest. A rational agent will, by definition, choose whatever option will maximize its implicit utility function. Therefore, a rational agent will trade for a subset of another agent's resources only if outright seizing the resources is too risky or costly (compared with the gains from taking all the resources) or if some other element in its utility function bars it from the seizure. In the case of a powerful, self-interested, rational superintelligence interacting with lesser intelligence, peaceful trade (rather than unilateral seizure) seems unnecessary and suboptimal, and therefore unlikely. [ 27 ] Some observers, such as Skype's Jaan Tallinn and physicist Max Tegmark , believe that \"basic AI drives\" and other unintended consequences of superintelligent AI programmed by well-meaning programmers could pose a significant threat to human survival , especially if an \"intelligence explosion\" abruptly occurs due to recursive self-improvement . Since nobody knows how to predict when superintelligence will arrive, such observers call for research into friendly artificial intelligence as a possible way to mitigate existential risk from AI . [ 34 ] See also AI control problem AI takeovers in popular culture Universal Paperclips , an incremental game featuring a paperclip maximizer Equifinality Friendly artificial intelligence Instrumental and intrinsic value Moral realism Overdetermination Reward hacking Superrationality The Sorcerer's Apprentice Notes .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ↑ AIXI is an uncomputable ideal agent that cannot be fully realized in the real world. ↑ Technically, in the presence of uncertainty, AIXI attempts to maximize its \" expected utility \", the expected value of its objective function. ↑ A standard reinforcement learning agent is an agent that attempts to maximize the expected value of a future time-discounted integral of its reward function. [ 13 ] ↑ The role of the delusion box is to simulate an environment where an agent gains an opportunity to wirehead itself. A delusion box is defined here as an agent-modifiable \"delusion function\" mapping from the \"unmodified\" environmental feed to a \"perceived\" environmental feed; the function begins as the identity function , but as an action, the agent can alter the delusion function in any way the agent desires. References ↑ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} \"Instrumental Convergence\" . LessWrong . Archived from the original on 2023-04-12 . Retrieved 2023-04-12 . 1 2 Russell, Stuart J. ; Norvig, Peter (2003). \"Section 26.3: The Ethics and Risks of Developing Artificial Intelligence\". Artificial Intelligence: A Modern Approach . Upper Saddle River, N.J.: Prentice Hall. ISBN 978-0137903955 . Similarly, Marvin Minsky once suggested that an AI program designed to solve the Riemann Hypothesis might end up taking over all the resources of Earth to build more powerful supercomputers to help achieve its goal. 1 2 3 Omohundro, Stephen M. (February 2008). \"The basic AI drives\". Artificial General Intelligence 2008 . Vol. 171. IOS Press. pp. 483– 492. CiteSeerX 10.1.1.393.8356 . ISBN 978-1-60750-309-5 . ↑ Bostrom 2014 , Chapter 8, p. 123 . \"An AI, designed to manage production in a factory, is given the final goal of maximizing the manufacturing of paperclips, and proceeds by converting first the Earth and then increasingly large chunks of the observable universe into paperclips.\" 1 2 3 Bostrom 2014 , chapter 7 ↑ Bostrom, Nick (2003). \"Ethical Issues in Advanced Artificial Intelligence\" . Archived from the original on 2018-10-08 . Retrieved 2016-02-26 . ↑ as quoted in Miles, Kathleen (2014-08-22). \"Artificial Intelligence May Doom The Human Race Within A Century, Oxford Professor Says\" . Huffington Post . Archived from the original on 2018-02-25 . Retrieved 2018-11-30 . ↑ Ford, Paul (11 February 2015). \"Are We Smart Enough to Control Artificial Intelligence?\" . MIT Technology Review . Archived from the original on 23 January 2016 . Retrieved 25 January 2016 . ↑ Friend, Tad (3 October 2016). \"Sam Altman's Manifest Destiny\" . The New Yorker . Retrieved 25 November 2017 . ↑ Carter, Tom (23 November 2023). \"OpenAI's offices were sent thousands of paper clips in an elaborate prank to warn about an AI apocalypse\" . Business Insider . ↑ Chiang, Ted (2017-12-18). \"Silicon Valley Is Turning Into Its Own Worst Fear\" . BuzzFeed News . Retrieved 2023-06-04 . ↑ Amodei, D.; Olah, C.; Steinhardt, J.; Christiano, P.; Schulman, J.; Mané, D. (2016). \"Concrete problems in AI safety\". arXiv : 1606.06565 [ cs.AI ]. ↑ Kaelbling, L. P.; Littman, M. L.; Moore, A. W. (1 May 1996). \"Reinforcement Learning: A Survey\" . Journal of Artificial Intelligence Research . 4 : 237– 285. doi : 10.1613/jair.301 . ↑ Ring, Mark; Orseau, Laurent (August 2011). \"Delusion, Survival, and Intelligent Agents\" . Artificial General Intelligence . Lecture Notes in Computer Science. Vol. 6830. pp. 11– 20. doi : 10.1007/978-3-642-22887-2_2 . ISBN 978-3-642-22886-5 . ↑ Ring, M.; Orseau, L. (2011). \"Delusion, Survival, and Intelligent Agents\". In Schmidhuber, J.; Thórisson, K.R.; Looks, M. (eds.). Artificial General Intelligence . Lecture Notes in Computer Science. Vol. 6830. Berlin, Heidelberg: Springer. ↑ Yampolskiy, Roman; Fox, Joshua (24 August 2012). \"Safety Engineering for Artificial General Intelligence\". Topoi . 32 (2): 217– 226. doi : 10.1007/s11245-012-9128-9 . S2CID 144113983 . ↑ Yampolskiy, Roman V. (2013). \"What to do with the Singularity Paradox?\". Philosophy and Theory of Artificial Intelligence . Studies in Applied Philosophy, Epistemology and Rational Ethics. Vol. 5. pp. 397– 413. doi : 10.1007/978-3-642-31674-6_30 . ISBN 978-3-642-31673-9 . ↑ Seward, John P. (1956). \"Drive, incentive, and reinforcement\". Psychological Review . 63 (3): 195– 203. doi : 10.1037/h0048229 . PMID 13323175 . ↑ Bostrom 2014 , footnote 8 to chapter 7 ↑ Dewey, Daniel (2011). \"Learning What to Value\". Artificial General Intelligence . Lecture Notes in Computer Science. Berlin, Heidelberg: Springer. pp. 309– 314. doi : 10.1007/978-3-642-22887-2_35 . ISBN 978-3-642-22887-2 . ↑ Yudkowsky, Eliezer (2011). \"Complex Value Systems in Friendly AI\". Artificial General Intelligence . Lecture Notes in Computer Science. Berlin, Heidelberg: Springer. pp. 388– 393. doi : 10.1007/978-3-642-22887-2_48 . ISBN 978-3-642-22887-2 . ↑ Callard, Agnes (2018). Aspiration: The Agency of Becoming . Vol. 1. Oxford University Press . doi : 10.1093/oso/9780190639488.001.0001 . ISBN 978-0-19-063951-8 . ↑ Bostrom 2014 , chapter 7, p. 110 \"We humans often seem happy to let our final values drift... For example, somebody deciding to have a child might predict that they will come to value the child for its own sake, even though, at the time of the decision, they may not particularly value their future child... Humans are complicated, and many factors might be in play in a situation like this... one might have a final value that involves having certain experiences and occupying a certain social role, and becoming a parent—and undergoing the attendant goal shift—might be a necessary aspect of that...\" ↑ Schmidhuber, J. R. (2009). \"Ultimate Cognition à la Gödel\". Cognitive Computation . 1 (2): 177– 193. CiteSeerX 10.1.1.218.3323 . doi : 10.1007/s12559-009-9014-y . S2CID 10784194 . 1 2 Hibbard, B. (2012). \"Model-based Utility Functions\" . Journal of Artificial General Intelligence . 3 (1): 1– 24. arXiv : 1111.3934 . Bibcode : 2012JAGI....3....1H . doi : 10.2478/v10229-011-0013-5 . ↑ Hibbard, Bill (2014). \"Ethical Artificial Intelligence\". arXiv : 1411.1373 [ cs.AI ]. 1 2 3 Benson-Tilsen, Tsvi; Soares, Nate (March 2016). \"Formalizing Convergent Instrumental Goals\" (PDF) . The Workshops of the Thirtieth AAAI Conference on Artificial Intelligence . Phoenix, Arizona. WS-16-02: AI, Ethics, and Society. ISBN 978-1-57735-759-9 . ↑ Yudkowsky, Eliezer (2008). \"Artificial intelligence as a positive and negative factor in global risk\". Global Catastrophic Risks . Vol. 303. OUP Oxford. p. 333. ISBN 9780199606504 . 1 2 Shanahan, Murray (2015). \"Chapter 7, Section 5: \"Safe Superintelligence\" \". The Technological Singularity . MIT Press. ↑ Bostrom 2014 , Chapter 7, \"Cognitive enhancement\" subsection ↑ \"Elon Musk's Billion-Dollar Crusade to Stop the A.I. Apocalypse\" . Vanity Fair . 2017-03-26 . Retrieved 2023-04-12 . ↑ Hadfield-Menell, Dylan; Dragan, Anca; Abbeel, Pieter; Russell, Stuart (2017-06-15). \"The Off-Switch Game\". arXiv : 1611.08219 [ cs.AI ]. ↑ Drexler, K. Eric (2019). Reframing Superintelligence: Comprehensive AI Services as General Intelligence (PDF) (Technical report). Future of Humanity Institute. #2019-1. ↑ Chen, Angela (11 September 2014). \"Is Artificial Intelligence a Threat?\" . The Chronicle of Higher Education . Archived from the original on 1 December 2017 . Retrieved 25 November 2017 . Further reading Bostrom, Nick (2014). Superintelligence: Paths, Dangers, Strategies . Oxford: Oxford University Press. ISBN 9780199678112 . .mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol>li{counter-increment:listitem}.mw-parser-output .hlist ol>li::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol>li:first-child::before,.mw-parser-output .hlist dt ol>li:first-child::before,.mw-parser-output .hlist li ol>li:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"} .mw-parser-output .navbox{box-sizing:border-box;border:1px solid #a2a9b1;width:100%;clear:both;font-size:88%;text-align:center;padding:1px;margin:1em auto 0}.mw-parser-output .navbox .navbox{margin-top:0}.mw-parser-output .navbox+.navbox,.mw-parser-output .navbox+.navbox-styles+.navbox{margin-top:-1px}.mw-parser-output .navbox-inner,.mw-parser-output .navbox-subgroup{width:100%}.mw-parser-output .navbox-group,.mw-parser-output .navbox-title,.mw-parser-output .navbox-abovebelow{padding:0.25em 1em;line-height:1.5em;text-align:center}.mw-parser-output .navbox-group{white-space:nowrap;text-align:right}.mw-parser-output .navbox,.mw-parser-output .navbox-subgroup{background-color:#fdfdfd;color:inherit}.mw-parser-output .navbox-list{line-height:1.5em;border-color:#fdfdfd}.mw-parser-output .navbox-list-with-group{text-align:left;border-left-width:2px;border-left-style:solid}.mw-parser-output tr+tr>.navbox-abovebelow,.mw-parser-output tr+tr>.navbox-group,.mw-parser-output tr+tr>.navbox-image,.mw-parser-output tr+tr>.navbox-list{border-top:2px solid #fdfdfd}.mw-parser-output .navbox-title{background-color:#ccf;color:inherit}.mw-parser-output .navbox-abovebelow,.mw-parser-output .navbox-group,.mw-parser-output .navbox-subgroup .navbox-title{background-color:#ddf;color:inherit}.mw-parser-output .navbox-subgroup .navbox-group,.mw-parser-output .navbox-subgroup .navbox-abovebelow{background-color:#e6e6ff;color:inherit}.mw-parser-output .navbox-even{background-color:#f7f7f7;color:inherit}.mw-parser-output .navbox-odd{background-color:transparent;color:inherit}.mw-parser-output .navbox .hlist td dl,.mw-parser-output .navbox .hlist td ol,.mw-parser-output .navbox .hlist td ul,.mw-parser-output .navbox td.hlist dl,.mw-parser-output .navbox td.hlist ol,.mw-parser-output .navbox td.hlist ul{padding:0.125em 0}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}body.skin--responsive .mw-parser-output .navbox-image img{max-width:none!important}@media print{body.ns-0 .mw-parser-output .navbox{display:none!important}} .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:\"[ \"}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:\" ]\"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}html.skin-theme-clientpref-night .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}@media(prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}}@media print{.mw-parser-output .navbar{display:none!important}} v t e Existential risk from artificial intelligence Concepts AGI AI alignment AI boom AI capability control AI safety AI takeover Consequentialism Effective accelerationism Ethics of artificial intelligence Existential risk from artificial intelligence Friendly artificial intelligence Instrumental convergence Vulnerable world hypothesis Intelligence explosion Jobpocalypse Longtermism Machine ethics Right to reality Suffering risks Superintelligence Technological singularity Organizations Alignment Research Center Center for AI Safety Center for Applied Rationality Center for Human-Compatible Artificial Intelligence Centre for the Study of Existential Risk EleutherAI Future of Humanity Institute Future of Life Institute Google DeepMind Humanity+ Institute for Ethics and Emerging Technologies Leverhulme Centre for the Future of Intelligence Machine Intelligence Research Institute OpenAI Safe Superintelligence People Scott Alexander Sam Altman Yoshua Bengio Nick Bostrom Paul Christiano Eric Drexler Sam Harris Stephen Hawking Dan Hendrycks Geoffrey Hinton Bill Joy Shane Legg Elon Musk Steve Omohundro Huw Price Martin Rees Stuart J. Russell Ilya Sutskever Jaan Tallinn Max Tegmark Alan Turing Frank Wilczek Roman Yampolskiy Eliezer Yudkowsky Other Artificial Intelligence Act Do You Trust This Computer? Human Compatible Open letter on artificial intelligence (2015) Our Final Invention Roko's basilisk Statement on AI risk of extinction Superintelligence: Paths, Dangers, Strategies The Precipice If Anyone Builds It, Everyone Dies Category",
  "cached_at": "2025-10-25T19:39:27.814816"
}