{
  "title": "Molecular assembler",
  "summary": "A molecular assembler, as defined by K. Eric Drexler, is a \"proposed device able to guide chemical reactions by positioning reactive molecules with atomic precision\". A molecular assembler is a molecular machine. Some biological molecules such as ribosomes fit this definition as biological machines. This is because they receive instructions from messenger RNA and then assemble specific sequences of amino acids to construct protein molecules.",
  "content": "Molecular assembler Proposed nanotechnological device A molecular assembler , as defined by K. Eric Drexler , [ citation needed ] is a \"proposed device able to guide chemical reactions by positioning reactive molecules with atomic precision\". A molecular assembler is a molecular machine . Some biological molecules such as ribosomes fit this definition as biological machines . This is because they receive instructions from messenger RNA and then assemble specific sequences of amino acids to construct protein molecules. A ribosome is a biological machine using protein domain dynamics , only visible by neutron spin echo spectroscopy .mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol>li{counter-increment:listitem}.mw-parser-output .hlist ol>li::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol>li:first-child::before,.mw-parser-output .hlist dt ol>li:first-child::before,.mw-parser-output .hlist li ol>li:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"} .mw-parser-output .sidebar{width:22em;float:right;clear:right;margin:0.5em 0 1em 1em;background:var(--background-color-neutral-subtle,#f8f9fa);border:1px solid var(--border-color-base,#a2a9b1);padding:0.2em;text-align:center;line-height:1.4em;font-size:88%;border-collapse:collapse;display:table}body.skin-minerva .mw-parser-output .sidebar{display:table!important;float:right!important;margin:0.5em 0 1em 1em!important}.mw-parser-output .sidebar-subgroup{width:100%;margin:0;border-spacing:0}.mw-parser-output .sidebar-left{float:left;clear:left;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-none{float:none;clear:both;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-outer-title{padding:0 0.4em 0.2em;font-size:125%;line-height:1.2em;font-weight:bold}.mw-parser-output .sidebar-top-image{padding:0.4em}.mw-parser-output .sidebar-top-caption,.mw-parser-output .sidebar-pretitle-with-top-image,.mw-parser-output .sidebar-caption{padding:0.2em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-pretitle{padding:0.4em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-title,.mw-parser-output .sidebar-title-with-pretitle{padding:0.2em 0.8em;font-size:145%;line-height:1.2em}.mw-parser-output .sidebar-title-with-pretitle{padding:0.1em 0.4em}.mw-parser-output .sidebar-image{padding:0.2em 0.4em 0.4em}.mw-parser-output .sidebar-heading{padding:0.1em 0.4em}.mw-parser-output .sidebar-content{padding:0 0.5em 0.4em}.mw-parser-output .sidebar-content-with-subgroup{padding:0.1em 0.4em 0.2em}.mw-parser-output .sidebar-above,.mw-parser-output .sidebar-below{padding:0.3em 0.8em;font-weight:bold}.mw-parser-output .sidebar-collapse .sidebar-above,.mw-parser-output .sidebar-collapse .sidebar-below{border-top:1px solid #aaa;border-bottom:1px solid #aaa}.mw-parser-output .sidebar-navbar{text-align:right;font-size:115%;padding:0 0.4em 0.4em}.mw-parser-output .sidebar-list-title{padding:0 0.4em;text-align:left;font-weight:bold;line-height:1.6em;font-size:105%}.mw-parser-output .sidebar-list-title-c{padding:0 0.4em;text-align:center;margin:0 3.3em}@media(max-width:640px){body.mediawiki .mw-parser-output .sidebar{width:100%!important;clear:both;float:none!important;margin-left:0!important;margin-right:0!important}}body.skin--responsive .mw-parser-output .sidebar a>img{max-width:none!important}@media screen{html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media print{body.ns-0 .mw-parser-output .sidebar{display:none!important}} Part of a series of articles on Molecular nanotechnology Mechanosynthesis Molecular assembler Molecular machine Brownian motor Productive nanosystems Nanorobotics Engines of Creation Science portal Technology portal .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:\"[ \"}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:\" ]\"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}html.skin-theme-clientpref-night .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}@media(prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}}@media print{.mw-parser-output .navbar{display:none!important}} v t e History Beginning in 2007, the British Engineering and Physical Sciences Research Council has funded development of ribosome -like molecular assemblers. Clearly, molecular assemblers are possible in this limited sense. A technology roadmap project, led by the Battelle Memorial Institute and hosted by several U.S. National Laboratories has explored a range of atomically precise fabrication technologies, including both early-generation and longer-term prospects for programmable molecular assembly; the report was released in December, 2007. [ 1 ] In 2008, the Engineering and Physical Sciences Research Council provided funding of £1.5 million over six years (£1,942,235.57, $2,693,808.00 in 2021 [ 2 ] ) for research working towards mechanized mechanosynthesis , in partnership with the Institute for Molecular Manufacturing, amongst others. [ 3 ] Likewise, the term \"molecular assembler\" has been used in science fiction and popular culture to refer to a wide range of fantastic atom-manipulating nanomachines. Much of the controversy regarding \"molecular assemblers\" results from the confusion in the use of the name for both technical concepts and popular fantasies. In 1992, Drexler introduced the related but better-understood term \"molecular manufacturing\", which he defined as the programmed \" chemical synthesis of complex structures by mechanically positioning reactive molecules, not by manipulating individual atoms\". [ 4 ] This article mostly discusses \"molecular assemblers\" in the popular sense. These include hypothetical machines that manipulate individual atoms and machines with organism-like self-replicating abilities, mobility, ability to consume food, and so forth. These are quite different from devices that merely (as defined above) \"guide chemical reactions by positioning reactive molecules with atomic precision\". Because synthetic molecular assemblers have never been constructed and because of the confusion regarding the meaning of the term, there has been much controversy as to whether \"molecular assemblers\" are possible or simply science fiction. Confusion and controversy also stem from their classification as nanotechnology , which is an active area of laboratory research which has already been applied to the production of real products; however, there had been, until recently, [ when? ] no research efforts into the actual construction of \"molecular assemblers\". Nonetheless, a 2013 paper by David Leigh 's group, published in the journal Science , details a new method of synthesizing a peptide in a sequence-specific manner by using an artificial molecular machine that is guided by a molecular strand. [ 5 ] This functions in the same way as a ribosome building proteins by assembling amino acids according to a messenger RNA blueprint. The structure of the machine is based on a rotaxane , which is a molecular ring sliding along a molecular axle. The ring carries a thiolate group, which removes amino acids in sequence from the axle, transferring them to a peptide assembly site. In 2018, the same group published a more advanced version of this concept in which the molecular ring shuttles along a polymeric track to assemble an oligopeptide that can fold into an α-helix that can perform the enantioselective epoxidation of a chalcone derivative (in a way reminiscent to the ribosome assembling an enzyme ). [ 6 ] In another paper published in Science in March 2015, chemists at the University of Illinois report a platform that automates the synthesis of 14 classes of small molecules , with thousands of compatible building blocks. [ 7 ] In 2017, David Leigh 's group reported a molecular robot that could be programmed to construct any one of four different stereoisomers of a molecular product by using a nanomechanical robotic arm to move a molecular substrate between different reactive sites of an artificial molecular machine. [ 8 ] An accompanying News and Views article, titled 'A molecular assembler', outlined the operation of the molecular robot as effectively a prototypical molecular assembler. [ 9 ] Nanofactories A nanofactory is a proposed system in which nanomachines (resembling molecular assemblers, or industrial robot arms) would combine reactive molecules via mechanosynthesis to build larger atomically precise parts. These, in turn, would be assembled by positioning mechanisms of assorted sizes to build macroscopic (visible) but still atomically-precise products. A typical nanofactory would fit in a desktop box, in the vision of K. Eric Drexler published in Nanosystems: Molecular Machinery, Manufacturing and Computation (1992), a notable work of \" exploratory engineering \". During the 1990s, others have extended the nanofactory concept, including an analysis of nanofactory convergent assembly by Ralph Merkle , a systems design of a replicating nanofactory architecture by J. Storrs Hall , Forrest Bishop's \"Universal Assembler\", the patented exponential assembly process by Zyvex , and a top-level systems design for a 'primitive nanofactory' by Chris Phoenix (director of research at the Center for Responsible Nanotechnology). All of these nanofactory designs (and more) are summarized in Chapter 4 of Kinematic Self-Replicating Machines (2004) by Robert Freitas and Ralph Merkle. The Nanofactory Collaboration, [ 10 ] founded by Freitas and Merkle in 2000, is a focused, ongoing effort involving 23 researchers from 10 organizations and 4 countries that is developing a practical research agenda [ 11 ] specifically aimed at positionally-controlled diamond mechanosynthesis and diamondoid nanofactory development. In 2005, an animated short film of the nanofactory concept was produced by John Burch, in collaboration with Drexler. Such visions have been the subject of much debate, on several intellectual levels. No one has discovered an insurmountable problem with the underlying theories and no one has proved that the theories can be translated into practice. However, the debate continues, with some of it being summarized in the molecular nanotechnology article. If nanofactories could be built, severe disruption to the world economy would be one of many possible negative impacts, though it could be argued that this disruption would have little negative effect, if everyone had such nanofactories. Great benefits also would be anticipated. Various works of science fiction have explored these and similar concepts. The potential for such devices was part of the mandate of a major UK study led by mechanical engineering professor Dame Ann Dowling . Self-replication \"Molecular assemblers\" have been confused with self-replicating machines. To produce a practical quantity of a desired product, the nanoscale size of a typical science fiction universal molecular assembler requires an extremely large number of such devices. However, a single such theoretical molecular assembler might be programmed to self-replicate , constructing many copies of itself. This would allow an exponential rate of production. Then, after sufficient quantities of the molecular assemblers were available, they would then be re-programmed for production of the desired product. However, if self-replication of molecular assemblers were not restrained then it might lead to competition with naturally occurring organisms. This has been called ecophagy or the grey goo problem. [ 12 ] One method of building molecular assemblers is to mimic evolutionary processes employed by biological systems. Biological evolution proceeds by random variation combined with culling of the less-successful variants and reproduction of the more-successful variants. Production of complex molecular assemblers might be evolved from simpler systems since \"A complex system that works is invariably found to have evolved from a simple system that worked. . . . A complex system designed from scratch never works and can not be patched up to make it work. You have to start over, beginning with a system that works.\" [ 13 ] However, most published safety guidelines include \"recommendations against developing ... replicator designs which permit surviving mutation or undergoing evolution\". [ 14 ] Most assembler designs keep the \"source code\" external to the physical assembler. At each step of a manufacturing process, that step is read from an ordinary computer file and \"broadcast\" to all the assemblers. If any assembler gets out of range of that computer, or when the link between that computer and the assemblers is broken, or when that computer is unplugged, the assemblers stop replicating. Such a \"broadcast architecture\" is one of the safety features recommended by the \"Foresight Guidelines on Molecular Nanotechnology\", and a map of the 137-dimensional replicator design space [ 15 ] recently published by Freitas and Merkle provides numerous practical methods by which replicators can be safely controlled by good design. Drexler and Smalley debate .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} Main article: Drexler–Smalley debate on molecular nanotechnology One of the most outspoken critics of some concepts of \"molecular assemblers\" was Professor Richard Smalley (1943–2005) who won the Nobel Prize for his contributions to the field of nanotechnology . Smalley believed that such assemblers were not physically possible and introduced scientific objections to them. His two principal technical objections were termed the \"fat fingers problem\" and the \"sticky fingers problem\". He believed these would exclude the possibility of \"molecular assemblers\" that worked by precision picking and placing of individual atoms. Drexler and coworkers responded to these two issues [ 16 ] in a 2001 publication. Smalley also believed that Drexler's speculations about apocalyptic dangers of self-replicating machines that have been equated with \"molecular assemblers\" would threaten the public support for development of nanotechnology. To address the debate between Drexler and Smalley regarding molecular assemblers Chemical &amp; Engineering News published a point-counterpoint consisting of an exchange of letters that addressed the issues. [ 4 ] Regulation Speculation on the power of systems that have been called \"molecular assemblers\" has sparked a wider political discussion on the implication of nanotechnology. [ citation needed ] This is in part due to the fact that nanotechnology is a very broad term and could include \"molecular assemblers\". Discussion of the possible implications of fantastic molecular assemblers has prompted calls for regulation of current and future nanotechnology. There are very real concerns with the potential health and ecological impact of nanotechnology that is being integrated in manufactured products. Greenpeace for instance commissioned a report concerning nanotechnology in which they express concern into the toxicity of nanomaterials that have been introduced in the environment. [ 17 ] However, it makes only passing references to \"assembler\" technology. The UK Royal Society and Royal Academy of Engineering also commissioned a report entitled \"Nanoscience and nanotechnologies: opportunities and uncertainties\" [ 18 ] regarding the larger social and ecological implications of nanotechnology. This report does not discuss the threat posed by potential so-called \"molecular assemblers\". Formal scientific review In 2006, the U.S. National Academy of Sciences released the report of a study of molecular manufacturing (not molecular assemblers per se) as part of a longer report, A Matter of Size: Triennial Review of the National Nanotechnology Initiative [ 19 ] The study committee reviewed the technical content of Nanosystems , and in its conclusion states that no current theoretical analysis can be considered definitive regarding several questions of potential system performance, and that optimal paths for implementing high-performance systems cannot be predicted with confidence. It recommends funding for experimental research to produce experimental demonstrations in this area: \"Although theoretical calculations can be made today, the eventually attainable range of chemical reaction cycles, error rates, speed of operation, and thermodynamic efficiencies of such bottom-up manufacturing systems cannot be reliably predicted at this time. Thus, the eventually attainable perfection and complexity of manufactured products, while they can be calculated in theory, cannot be predicted with confidence. Finally, the optimum research paths that might lead to systems which greatly exceed the thermodynamic efficiencies and other capabilities of biological systems cannot be reliably predicted at this time. Research funding that is based on the ability of investigators to produce experimental demonstrations that link to abstract models and guide long-term vision is most appropriate to achieve this goal.\" Gray goo Main article: Gray goo One potential scenario that has been envisioned is out-of-control self-replicating molecular assemblers in the form of gray goo which consumes carbon to continue its replication. If unchecked, such mechanical replication could potentially consume whole ecoregions or the whole Earth ( ecophagy ), or it could simply outcompete natural lifeforms for necessary resources such as carbon , ATP , or UV light (which some nanomotor examples run on). However, the ecophagy and 'grey goo' scenarios, like synthetic molecular assemblers, are based upon still-hypothetical technologies that have not yet been demonstrated experimentally. See also .mw-parser-output .portalbox{padding:0;margin:0.5em 0;display:table;box-sizing:border-box;max-width:175px;list-style:none}.mw-parser-output .portalborder{border:1px solid var(--border-color-base,#a2a9b1);padding:0.1em;background:var(--background-color-neutral-subtle,#f8f9fa)}.mw-parser-output .portalbox-entry{display:table-row;font-size:85%;line-height:110%;height:1.9em;font-style:italic;font-weight:bold}.mw-parser-output .portalbox-image{display:table-cell;padding:0.2em;vertical-align:middle;text-align:center}.mw-parser-output .portalbox-link{display:table-cell;padding:0.2em 0.2em 0.2em 0.3em;vertical-align:middle}@media(min-width:720px){.mw-parser-output .portalleft{margin:0.5em 1em 0.5em 0}.mw-parser-output .portalright{clear:right;float:right;margin:0.5em 0 0.5em 1em}} Science portal Technology portal .mw-parser-output .div-col{margin-top:0.3em;column-width:30em}.mw-parser-output .div-col-small{font-size:90%}.mw-parser-output .div-col-rules{column-rule:1px solid #aaa}.mw-parser-output .div-col dl,.mw-parser-output .div-col ol,.mw-parser-output .div-col ul{margin-top:0}.mw-parser-output .div-col li,.mw-parser-output .div-col dd{page-break-inside:avoid;break-inside:avoid-column} 3D printing Bioethics Biosafety Biosecurity Biotechnology Ecocide Ecophagy Molecular machine Nanotechnology Nanotechnology in fiction Santa Claus machine References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ↑ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} \"Productive Nanosystems: A Technology Roadmap\" (PDF) . Foresight Institute . Archived from the original (PDF) on 2016-10-25 . Retrieved 2008-04-01 . ↑ \"Value of 2008 British Pounds today - Inflation calculator\" . Inflation Tool . Retrieved September 5, 2021 . ↑ \"Grants on the Web\" . Archived from the original on November 4, 2011. 1 2 \"C&amp;En: Cover Story - Nanotechnology\" . ↑ Lewandowski, Bartosz; De Bo, Guillaume; Ward, John W.; Papmeyer, Marcus; Kuschel, Sonja; Aldegunde, María J.; Gramlich, Philipp M. E.; Heckmann, Dominik; Goldup, Stephen M. (2013-01-11). \"Sequence-Specific Peptide Synthesis by an Artificial Small-Molecule Machine\" (PDF) . Science . 339 (6116): 189– 193. Bibcode : 2013Sci...339..189L . doi : 10.1126/science.1229753 . ISSN 0036-8075 . PMID 23307739 . S2CID 206544961 . ↑ De Bo, Guillaume; Gall, Malcolm A. Y.; Kuschel, Sonja; Winter, Julien De; Gerbaux, Pascal; Leigh, David A. (2018-04-02). \"An artificial molecular machine that builds an asymmetric catalyst\" . Nature Nanotechnology . 13 (5): 381– 385. Bibcode : 2018NatNa..13..381D . doi : 10.1038/s41565-018-0105-3 . ISSN 1748-3395 . PMID 29610529 . S2CID 4624041 . ↑ Li, J.; Ballmer, S. G.; Gillis, E. P.; Fujii, S.; Schmidt, M. J.; Palazzolo, A. M. E.; Lehmann, J. W.; Morehouse, G. F.; Burke, M. D. (2015). \"Synthesis of many different types of organic small molecules using one automated process\" . Science . 347 (6227): 1221– 1226. Bibcode : 2015Sci...347.1221L . doi : 10.1126/science.aaa5414 . PMC 4687482 . PMID 25766227 . ↑ Kassem, S.; Lee, A. T. L..; Leigh, D. A. ; Marcos, V.; Palmer, L. I.; Pisano, S. (2017). \"Stereodivergent synthesis with a programmable molecular machine\" . Nature . 549 (7672): 374– 378. Bibcode : 2017Natur.549..374K . doi : 10.1038/nature23677 . PMID 28933436 . S2CID 205259758 . ↑ Kelly, T. R.; Snapper, M. L. (2017). \"A molecular assembler\" . Nature . 549 (7672): 336– 337. doi : 10.1038/549336a . PMID 28933435 . ↑ \"Nanofactory Collaboration\" . ↑ \"Nanofactory Technical Challenges\" . ↑ \"Nanotechnology: Grey Goo is a Small Issue\" . Archived from the original on 2014-08-29 . Retrieved 2007-08-21 . ↑ Gall, John (1978). Systemantics: How Systems Work and Especially How They Fail (1st ed.). New York: Pocket Books. pp. 80– 81. ISBN 9780671819101 – via Archive.org . ↑ \"Foresight Guidelines on Molecular Nanotechnology\" . ↑ \"Kinematic Self-Replicating Machines\" . ↑ \"Institute for Molecular ManufacturingDebate About Assemblers — Smalley Rebuttal\" . ↑ Future Technologies, Today's Choices Archived 2006-04-14 at the Wayback Machine Nanotechnology, Artificial Intelligence and Robotics; A technical, political and institutional map of emerging technologies. A report for the Greenpeace Environmental Trust ↑ \"Nanoscience and nanotechnologies:opportunities and uncertainties\" . Archived from the original on 2018-07-03 . Retrieved 2006-06-16 . ↑ Council, National Research; Sciences, Division on Engineering Physical; Board, National Materials Advisory; Initiative, Committee to Review the National Nanotechnology (2006). A Matter of Size: Triennial Review of the National Nanotechnology Initiative - The National Academies Press . doi : 10.17226/11752 . ISBN 978-0-309-10223-0 . External links Molecular Dynamics Studio (2016) free open-source multi-scale modeling and simulation program for nano-composites with special support for structural DNA nanotechnology (originally Nanoengineer-1 by Nanorex) Nano-Hive: Nanospace Simulator (2006) free software for modeling nanotech entities Foresight Guidelines for Responsible Nanotechnology Development (2006) of molecular manufacturing technologies Center for Responsible Nanotechnology (2008) Molecular Assembler website (2008) Rage Against the (Green) Machine (2003) in Wired Government launches nano study UK EducationGuardian, 11 June 2003 Unraveling the Big Debate over Small Machines (2004) from BetterHumans.com Design considerations for an assembler (1995) by Ralph Merkle Kinematic Self-Replicating Machines — online technical book: first comprehensive survey of molecular assemblers (2004) by Robert Freitas and Ralph Merkle Design of a Primitive Nanofactory (2003) Video - Nanofactory in Action (2006) Nanofactory technology Review of Molecular Manufacturing Integrated Nanosystems for Atomically Precise Manufacturing — United States Department of Energy Workshop – August 5–6, 2015 .mw-parser-output .navbox{box-sizing:border-box;border:1px solid #a2a9b1;width:100%;clear:both;font-size:88%;text-align:center;padding:1px;margin:1em auto 0}.mw-parser-output .navbox .navbox{margin-top:0}.mw-parser-output .navbox+.navbox,.mw-parser-output .navbox+.navbox-styles+.navbox{margin-top:-1px}.mw-parser-output .navbox-inner,.mw-parser-output .navbox-subgroup{width:100%}.mw-parser-output .navbox-group,.mw-parser-output .navbox-title,.mw-parser-output .navbox-abovebelow{padding:0.25em 1em;line-height:1.5em;text-align:center}.mw-parser-output .navbox-group{white-space:nowrap;text-align:right}.mw-parser-output .navbox,.mw-parser-output .navbox-subgroup{background-color:#fdfdfd;color:inherit}.mw-parser-output .navbox-list{line-height:1.5em;border-color:#fdfdfd}.mw-parser-output .navbox-list-with-group{text-align:left;border-left-width:2px;border-left-style:solid}.mw-parser-output tr+tr>.navbox-abovebelow,.mw-parser-output tr+tr>.navbox-group,.mw-parser-output tr+tr>.navbox-image,.mw-parser-output tr+tr>.navbox-list{border-top:2px solid #fdfdfd}.mw-parser-output .navbox-title{background-color:#ccf;color:inherit}.mw-parser-output .navbox-abovebelow,.mw-parser-output .navbox-group,.mw-parser-output .navbox-subgroup .navbox-title{background-color:#ddf;color:inherit}.mw-parser-output .navbox-subgroup .navbox-group,.mw-parser-output .navbox-subgroup .navbox-abovebelow{background-color:#e6e6ff;color:inherit}.mw-parser-output .navbox-even{background-color:#f7f7f7;color:inherit}.mw-parser-output .navbox-odd{background-color:transparent;color:inherit}.mw-parser-output .navbox .hlist td dl,.mw-parser-output .navbox .hlist td ol,.mw-parser-output .navbox .hlist td ul,.mw-parser-output .navbox td.hlist dl,.mw-parser-output .navbox td.hlist ol,.mw-parser-output .navbox td.hlist ul{padding:0.125em 0}.mw-parser-output .navbox .navbar{display:block;font-size:100%}.mw-parser-output .navbox-title .navbar{float:left;text-align:left;margin-right:0.5em}body.skin--responsive .mw-parser-output .navbox-image img{max-width:none!important}@media print{body.ns-0 .mw-parser-output .navbox{display:none!important}} v t e Nanotechnology Overview History Organizations Popular culture Outline Impact and applications Nanomedicine Nanotoxicology Green nanotechnology Regulation Nanomaterials Fullerenes Nanotubes Carbon Non-carbon Nanoparticles characterization Molecular self-assembly Self-assembled monolayer Supramolecular assembly DNA nanotechnology Solid lipid nanoparticle Nanoelectronics Molecular scale electronics Nanolithography Scanning probe microscopy Atomic force microscope Scanning tunneling microscope Molecular nanotechnology Molecular assembler Nanorobotics Mechanosynthesis Category Commons Science portal Technology portal v t e Emerging technologies Fields Manufacturing 3D microfabrication 3D printing 3D publishing Claytronics Molecular assembler Smart manufacturing Utility fog Materials science Aerogel Amorphous metal Artificial muscle Conductive polymer Femtotechnology Fullerene Graphene High-temperature superconductivity High-temperature superfluidity Linear acetylenic carbon Metamaterials Metamaterial cloaking Metal foam Multi-function structures Nanotechnology Carbon nanotubes Molecular nanotechnology Nanomaterials Picotechnology Programmable matter Quantum dots Silicene Synthetic diamond Robotics Domotics Nanorobotics Powered exoskeleton Self-reconfiguring modular robot Swarm robotics Uncrewed vehicle Topics Automation Collingridge dilemma Differential technological development Disruptive innovation Ephemeralization Ethics AI Bioethics Cyberethics Neuroethics Robot ethics Exploratory engineering Proactionary principle Technological change Technological unemployment Technological convergence Technological evolution Technological paradigm Technology forecasting Accelerating change Future-oriented technology analysis Horizon scanning Moore's law Technological singularity Technology scouting Technology in science fiction Technology readiness level Technology roadmap Transhumanism List",
  "cached_at": "2025-10-25T19:37:25.300002"
}