{
  "title": "Nanorobotics",
  "summary": "Nanoid robotics, or for short, nanorobotics or nanobotics, is an emerging technology field creating machines or robots, which are called nanorobots or simply nanobots, whose components are at or near the scale of a nanometer. More specifically, nanorobotics refers to the nanotechnology engineering discipline of designing and building nanorobots with devices ranging in size from 0.1 to 10 micrometres and constructed of nanoscale or molecular components. The terms nanobot, nanoid, nanite, nanomachine and nanomite have also been used to describe such devices currently under research and development",
  "content": "Nanorobotics Emerging technology field Nanobots redirects here. For the They Might Be Giants album, see Nanobots (album) . A ribosome is a biological machine . Protein domain dynamics can now be seen by neutron spin echo spectroscopy. body.skin-minerva body.skin--responsive Part of a series of articles on Nanotechnology History Organizations Popular culture Outline Impact and applications Nanomedicine Nanonetwork Nanotoxicology Green nanotechnology Hazards Regulation Nanomaterials Fullerenes Carbon nanotubes Nanoparticles Molecular self-assembly Self-assembled monolayer Supramolecular assembly DNA nanotechnology Nanoelectronics Molecular scale electronics Molecular logic gate Nanolithography Moore's law Semiconductor device fabrication Semiconductor scale examples Nanometrology Atomic force microscopy Scanning tunneling microscope Electron microscope Super-resolution microscopy Nanotribology Molecular nanotechnology Molecular assembler Nanorobotics Mechanosynthesis Molecular engineering Science portal Technology portal html.skin-theme-clientpref-night v t e Nanoid robotics , or for short, nanorobotics or nanobotics , is an emerging technology field creating machines or robots , which are called nanorobots or simply nanobots , whose components are at or near the scale of a nanometer (10 −9 meters). 1 2 3 More specifically, nanorobotics (as opposed to microrobotics ) refers to the nanotechnology engineering discipline of designing and building nanorobots with devices ranging in size from 0.1 to 10 micrometres and constructed of nanoscale or molecular components. 4 5 The terms nanobot , nanoid , nanite , nanomachine and nanomite have also been used to describe such devices currently under research and development. 6 7 Nanomachines are largely in the research and development phase, 8 but some primitive molecular machines and nanomotors have been tested. An example is a sensor having a switch approximately 1.5 nanometers across, able to count specific molecules in the chemical sample. The first useful applications of nanomachines may be in nanomedicine . For example, 9 biological machines could be used to identify and destroy cancer cells. 10 11 Another potential application is the detection of toxic chemicals, and the measurement of their concentrations, in the environment. Rice University has demonstrated a single-molecule car developed by a chemical process and including Buckminsterfullerenes (buckyballs) for wheels. It is actuated by controlling the environmental temperature and by positioning a scanning tunneling microscope tip. Another definition 12 13 14 is a robot that allows precise interactions with nanoscale objects, or can manipulate with nanoscale resolution. Such devices are more related to microscopy or scanning probe microscopy , instead of the description of nanorobots as molecular machines . Using the microscopy definition, even a large apparatus such as an atomic force microscope can be considered a nanorobotic instrument when configured to perform nanomanipulation. For this viewpoint, macroscale robots or microrobots that can move with nanoscale precision can also be considered nanorobots. Kinesin uses protein domain dynamics on nanoscales to walk along a microtubule . Swallowing the Surgeon Part of a series of articles on Molecular nanotechnology Mechanosynthesis Molecular assembler Molecular machine Brownian motor Productive nanosystems Nanorobotics Engines of Creation Science portal Technology portal v t e According to Richard Feynman , it was his former graduate student and collaborator Albert Hibbs who originally suggested to him (circa 1959) the idea of a medical use for Feynman's theoretical micro-machines (see biological machine ). Hibbs suggested that certain repair machines might one day be reduced in size to the point that it would, in theory, be possible to (as Feynman put it) swallow the surgeon . The idea was incorporated into Feynman's case study 1959 essay There's Plenty of Room at the Bottom . 15 Since nano-robots would be microscopic in size, it would probably be necessary for very large numbers of them to work together to perform microscopic and macroscopic tasks. citation needed These nano-robot swarms, both those unable to replicate (as in utility fog ) and those able to replicate unconstrained in the natural environment (as in grey goo and synthetic biology ), are found in many science fiction stories, such as the Borg nano-probes in Star Trek and The Outer Limits episode The New Breed . Some proponents of nano-robotics, in reaction to the grey goo scenarios that they earlier helped to propagate, hold the view that nano-robots able to replicate outside of a restricted factory environment do not form a necessary part of a purported productive nanotechnology, and that the process of self-replication, were it ever to be developed, could be made inherently safe. They further assert that their current plans for developing and using molecular manufacturing do not in fact include free-foraging replicators. 16 17 A detailed theoretical discussion of nanorobotics, including specific design issues such as sensing, power communication, navigation , manipulation, locomotion , and onboard computation , has been presented in the medical context of nanomedicine by Robert Freitas . 18 19 Some of these discussions which? remain at the level of unbuildable generality and do not approach the level of detailed engineering. Legal and ethical implications Open technology A document with a proposal on nanobiotech development using open design technology methods, as in open-source hardware and open-source software , has been addressed to the United Nations General Assembly . 20 According to the document sent to the United Nations , in the same way that open source has in recent years accelerated the development of computer systems, a similar approach should benefit the society at large and accelerate nanorobotics development. The use of nanobiotechnology should be established as a human heritage for the coming generations, and developed as an open technology based on ethical practices for peaceful purposes. Open technology is stated as a fundamental key for such an aim. citation needed Nanorobot race In the same ways that technology research and development drove the space race and nuclear arms race , a race for nanorobots is occurring. 21 22 23 24 25 There is plenty of ground allowing nanorobots to be included among the emerging technologies . 26 Some of the reasons are that large corporations, such as General Electric , Hewlett-Packard , Synopsys , Northrop Grumman and Siemens have been recently working in the development and research of nanorobots; 27 28 29 30 31 surgeons are getting involved and starting to propose ways to apply nanorobots for common medical procedures; 32 universities and research institutes were granted funds by government agencies exceeding $2 billion towards research developing nanodevices for medicine; 33 34 bankers are also strategically investing with the intent to acquire beforehand rights and royalties on future nanorobots commercialisation. 35 Some aspects of nanorobot litigation and related issues linked to monopoly have already arisen. 36 37 38 A large number of patents have been granted recently on nanorobots, mostly by patent agents, companies specializing solely on building patent portfolios, and lawyers. After a long series of patents and eventually litigations, see for example the invention of radio , or the war of currents , emerging fields of technology tend to become a monopoly , which normally is dominated by large corporations. 39 Approaches to manufacturing Manufacturing nanomachines assembled from molecular components is a very challenging task. Because of the level of difficulty, many engineers and scientists continue working cooperatively across multidisciplinary approaches to achieve breakthroughs in this new area of development. The following techniques are currently applied towards manufacturing nanorobots: Biochip Main article: Biochip The joint use of nanoelectronics , photolithography , and new biomaterials provides an approach to manufacturing nanorobots for common medical uses, such as surgical instrumentation, diagnosis, and drug delivery. 40 41 42 This method for manufacturing on nanotechnology scale is in use in the electronics industry since 2008. 43 So, practical nanorobots should be integrated as nanoelectronics devices, which will allow tele-operation and advanced capabilities for medical instrumentation. 44 45 Nubots Main article: DNA machine A nucleic acid robot (nubot) is an organic molecular machine at the nanoscale. 46 DNA structure can provide means to assemble 2D and 3D nanomechanical devices. DNA based machines can be activated using small molecules, proteins and other molecules of DNA. 47 48 49 Biological circuit gates based on DNA materials have been engineered as molecular machines to allow in-vitro drug delivery for targeted health problems. 50 Such material based systems would work most closely to smart biomaterial drug system delivery, 51 while not allowing precise in vivo teleoperation of such engineered prototypes. Surface-bound systems Several reports show the attachment of synthetic molecular motors to surfaces. 52 53 These primitive nanomachines have been shown to undergo machine-like motions when confined to the surface of a macroscopic material. The surface anchored motors could potentially be used to move and position nanoscale materials on a surface in the manner of a conveyor belt. Positional nanoassembly Nanofactory Collaboration, 54 founded by Robert Freitas and Ralph Merkle in 2000 and involving 23 researchers from 10 organizations and 4 countries, focuses on developing a practical research agenda 55 specifically aimed at developing positionally-controlled diamond mechanosynthesis and a diamondoid nanofactory that would have the capability of building diamondoid medical nanorobots. Biohybrids See also: Biohybrid microswimmer The emerging field of bio-hybrid systems combines biological and synthetic structural elements for biomedical or robotic applications. The constituent elements of bio-nanoelectromechanical systems (BioNEMS) are of nanoscale size, for example DNA, proteins or nanostructured mechanical parts. Thiol-ene e-beams resist allow the direct writing of nanoscale features, followed by the functionalization of the natively reactive resist surface with biomolecules. 56 Other approaches use a biodegradable material attached to magnetic particles that allow them to be guided around the body. 57 Bacteria-based See also: Bacterial motility This approach uses biological microorganisms, like the bacterium Escherichia coli 58 and Salmonella typhimurium . 59 Thus the model uses a flagellum for propulsion purposes. Electromagnetic fields normally control the motion of this kind of biological integrated device. 60 Chemists at the University of Nebraska have created a humidity gauge by fusing a bacterium to a silicon computer chip. 61 Virus-based Retroviruses can be used to attach to cells and replace DNA . They go through a process called reverse transcription to deliver genetic packaging in a vector . 62 Usually, these devices are Pol – Gag genes of the virus for the Capsid and Delivery system. This process is called retroviral gene therapy , having the ability to re-engineer cellular DNA by usage of viral vectors . 63 This approach has appeared in the form of retroviral , adenoviral , and lentiviral gene delivery systems. 64 65 These gene therapy vectors have been used in cats to send genes into the genetically modified organism (GMO), causing it to display the trait. 66 Magnetic helical nanorobots Scanning Electron Microscope image of a Helical nanomotor Research led to the creation of helical silica particles coated with magnetic materials that can be maneuvered using a rotating magnetic field. 67 Such nanorobots are not dependent on chemical reactions to fuel the propulsion. A triaxial Helmholtz coil can provide directed rotating field in space. It was shown how such nanomotors can be used to measure viscosity of non-newtonian fluids at a resolution of a few microns. 68 This technology promises creation of a viscosity map inside cells and the extracellular milieu. Such nanorobots move in blood. 69 Researchers have managed to controllably move such nanorobots inside cancer cells allowing them to trace out patterns inside a cell. 68 Nanorobots moving through the tumor microenvironment have demonstrated the presence of sialic acid in the cancer-secreted extracellular matrix . 70 Summary of helical nanorobots A magnetic helical nanorobot consists of at least two components - one being a helical body, and the other being a magnetic material. The helical body provides a structure to the nanorobot capable of translation along the helical axis. The magnetic material, on the other hand, allows the structure to rotate by following an externally applied rotating magnetic field. Helical nanorobots use magnetic actuation and helical propulsion methods. citation needed Magnetic helical nanorobots translate a rotational motion into translational movement through a fluid in low Reynolds number environments. These nanorobots have been inspired by naturally occurring microorganisms such as flagella, cilia, and Escheric coli (otherwise known as E. coli) which rotate in a helical wave. 71 Movement of magnetic helical nanorobots One approach to the wireless manipulation of helical swimmers is through externally applied gradient rotation magnetic field. This can be done through Helmholtz coil as the helical swimmers are actuated by a rotating magnetic field. All magnetized objects within an externally imposed magnetic field will have both forces and torques exerted on them. The helical swimmers can rotate due the magnetic field received by the magnetic head and the forces acting upon it. Once the whole structure feels the field then the helical shape of its body converts this rotational movement into a propulsive force. Magnetic forces (fm) are proportional to the gradient of the magnetic field (∇B) on the magnetized object, and act to move the object to local maxima. Also, magnetic torques (τ) are proportional to the magnetic field (B) and act to align the internal magnetization of an object (M) with the field. The equations that express the interactions are as follows where V is the volume of the magnetized object. 72 F = V ⋅ ( M ⋅ ∇ B ) displaystyle boldsymbol F =V cdot ( boldsymbol M cdot nabla boldsymbol B ) (Equation 1) τ = V ⋅ ( M × B ) displaystyle boldsymbol tau =V cdot ( boldsymbol M boldsymbol times boldsymbol B ) (Equation 2) Equation one indicates that, increasing the volume of the magnetic material will increase the force experienced by the material proportionally. If the volume is doubled, the force will also double, assuming the magnetization (M) and the gradient of the magnetic field (∇B) remain constant. This would be the same for the torque of the magnetic material too since it is proportional to the volume. This increase in magnetic dipoles enhances the overall magnetic response of the material to an external magnetic field, resulting in greater force and torque. Hence when the magnetic material gets bigger than the helical swimmer it can move faster. Movement of a helical swimmer with square magnetic head To use the rotation magnetic field, a permanent magnet can be planted in the helical swimmer's head, whose magnetization direction would be perpendicular to the swimmer body. When a rotating magnetic field is applied, the swimmer's head experiences a magnetic torque, causing it to rotate. The helical shape converts this rotational movement into a propulsive force. As the swimmer's head rotates, its helical tail generates a force against the surrounding fluid, propelling it forward. 73 According to equation 2, the magnetic torque around the x -axis is zero ( M × B ) ∗ u x = 0 displaystyle ( boldsymbol M boldsymbol times boldsymbol B )* boldsymbol ux =0 at the initial position. After the magnet manipulator turns 45°, the magnetic field near the head position of the square magnet turns at an angle around the x -axis, as shown in the figure below. If the square magnet stays in its initial position, it will be subject to a magnetic torque around the x -axis ( M × B ) ∗ u x ≠ 0 displaystyle ( boldsymbol M boldsymbol times boldsymbol B )* boldsymbol ux neq 0 Thus, the helical swimmer will follow the magnetic field. If the magnet manipulator rotates one turn, the magnetic field near the head position of the swimmer projected on the plane yoz rotates a whole turn around the x-axis. 74 This results in the helical shape to move, resulting in propulsion as follows: i p u s h = sin ⁡ φ i n sin ⁡ θ i n cos ⁡ φ i n cos ⁡ θ i n cos ⁡ φ i n displaystyle i_ push = sin varphi _ in sin theta _ in cos varphi _ in cos theta _ in cos varphi _ in This propulsion helps the helical structure to rotate with the angle of the force. As a result, the magnetic robot rotates around the x -axis by the action of the rotating magnetic field. Example biomedical applications Due to its small scale and helical shape providing propulsion, helical swimmers can be used in some biomedical applications such as; targeted drug delivery and targeted cell delivery. In 2018, there was a proposed biocompatible and biodegradable chistosan-based helical micro/nanoswimmer loaded with doxorubicin (DOX), a common anticancer drug that was designed to deliver its payload to a desired location. Using 3.4 × 10 –1 W/cm 2 intensity UV light radiation, when the swimmer approached the target location, a dose of 60% of the total DOX was released within 5 minutes. However, it was seen that the dosage release rate slowed down after the initial 5 minutes that were reported. This was theorized to be caused by a decreasing diffusion rate of DOX molecules coming from the center of the swimmer. 75 Another group's spirulina-based helical micro/nanoswimmer also carrying DOX used a different method for controlled drug release. Once the swimmer had reached its destination, near-infrared (NIR) laser irradiation was used to heat up the location to dissolve the swimmer into individual particles, releasing the drug in the process. Through multiple tests, it was found that weak acidic external environments led to an increase in the dosage release rate. 76 Using magnetic helical micro/nanorobots for cell transport can also lead to opportunities in solving male infertility, repairing damaged tissue, and cell assembly. In 2015, a helical micro-/nanomotor with a holding ring on the head was used to successfully capture and transport sperm cells with motion deficiencies. The helix device would approach the sperm cell's tail and confine it with the body of the micro-/nanomotor. It would then use the holding ring to loosely capture the head of the sperm cell to prevent escape. After reaching the target location, the sperm cell would be released into the membrane of the oocyte by reversing the rotation of the helix device. This strategy was considered to be an efficient strategy while also reducing risk of damage to the sperm cells. 77 3D printing Main article: 3D printing 3D printing is the process by which a three-dimensional structure is built through the various processes of additive manufacturing. Nanoscale 3D printing involves many of the same process, incorporated at a much smaller scale. To print a structure in the 5-400 μm scale, the precision of the 3D printing machine needs to be improved greatly. A two-step process of 3D printing, using a 3D printing and laser etched plates method was incorporated as an improvement technique. 78 To be more precise at a nanoscale, the 3D printing process uses a laser etching machine, which etches the details needed for the segments of nanorobots into each plate. The plate is then transferred to the 3D printer, which fills the etched regions with the desired nanoparticle . The 3D printing process is repeated until the nanorobot is built from the bottom up. This 3D printing process has many benefits. First, it increases the overall accuracy of the printing process. citation needed Second, it has the potential to create functional segments of a nanorobot. 78 The 3D printer uses a liquid resin, which is hardened at precisely the correct spots by a focused laser beam. The focal point of the laser beam is guided through the resin by movable mirrors and leaves behind a hardened line of solid polymer, just a few hundred nanometers wide. This fine resolution enables the creation of intricately structured sculptures as tiny as a grain of sand. This process takes place by using photoactive resins, which are hardened by the laser at an extremely small scale to create the structure. This process is quick by nanoscale 3D printing standards. Ultra-small features can be made with the 3D micro-fabrication technique used in multiphoton photopolymerisation. This approach uses a focused laser to trace the desired 3D object into a block of gel. Due to the nonlinear nature of photo excitation, the gel is cured to a solid only in the places where the laser was focused while the remaining gel is then washed away. Feature sizes of under 100 nm are easily produced, as well as complex structures with moving and interlocked parts. 79 Challenges in designing nanorobots Several challenges must be addressed when designing and building nanoscale machines with movable parts. The most obvious is the need to develop very fine tools and manipulation techniques capable of assembling individual nanostructures with high precision into an operational device. A less evident challenge relates to the peculiarities of adhesion and friction at the nanoscale. It is impossible to simply scale down the design of a macroscopic device with movable parts. This approach will not work because the high surface energy of nanostructures causes all contacting parts to stick together to minimize energy. The adhesion and static friction between parts can easily exceed the strength of the materials, causing them to break before any movement occurs. This necessitates designing movable structures with minimal contact area. 80 In spite of the fast development of nanorobots, those designed for drug delivery purposes have a long way to go before their commercialization and clinical applications can be achieved. 81 82 Potential uses See also: Applications of nanotechnology Nanomedicine Main article: Nanomedicine Potential uses for nanorobotics in medicine include early diagnosis and targeted drug-delivery for cancer , 83 84 85 biomedical instrumentation, 86 surgery , 87 88 pharmacokinetics , 10 monitoring of diabetes , 89 90 91 and health care. In such plans, future medical nanotechnology is expected to employ nanorobots injected into the patient to perform work at a cellular level. Such nanorobots intended for use in medicine should be non-replicating, as replication would needlessly increase device complexity, reduce reliability, and interfere with the medical mission. Nanotechnology provides a wide range of new technologies for developing customized means to optimize the delivery of pharmaceutical drugs . Today, harmful side effects of treatments such as chemotherapy are commonly a result of drug delivery methods that don't pinpoint their intended target cells accurately. 92 Researchers at Harvard and MIT , however, have been able to attach special RNA strands, measuring nearly 10 nm in diameter, to nanoparticles, filling them with a chemotherapy drug. These RNA strands are attracted to cancer cells . When the nanoparticle encounters a cancer cell, it adheres to it, and releases the drug into the cancer cell. 93 This directed method of drug delivery has great potential for treating cancer patients while avoiding negative effects (commonly associated with improper drug delivery). 92 94 The first demonstration of nanomotors operating in living organisms was carried out in 2014 at University of California, San Diego. 95 MRI-guided nanocapsules are one potential precursor to nanorobots. 96 Another useful application of nanorobots is assisting in the repair of tissue cells alongside white blood cells . 97 Recruiting inflammatory cells or white blood cells (which include neutrophil granulocytes , lymphocytes , monocytes , and mast cells ) to the affected area is the first response of tissues to injury. 98 Because of their small size, nanorobots could attach themselves to the surface of recruited white cells, to squeeze their way out through the walls of blood vessels and arrive at the injury site, where they can assist in the tissue repair process. Certain substances could possibly be used to accelerate the recovery. citation needed The science behind this mechanism is quite complex. Passage of cells across the blood endothelium , a process known as transmigration, is a mechanism involving engagement of cell surface receptors to adhesion molecules, active force exertion and dilation of the vessel walls and physical deformation of the migrating cells. By attaching themselves to migrating inflammatory cells, the robots can in effect hitch a ride across the blood vessels, bypassing the need for a complex transmigration mechanism of their own. 97 As of 2016 update , in the United States, Food and Drug Administration (FDA) regulates nanotechnology on the basis of size. 99 Nanocomposite particles that are controlled remotely by an electromagnetic field was also developed. 100 This series of nanorobots that are now enlisted in the Guinness World Records , 100 can be used to interact with the biological cells . 101 Scientists suggest that this technology can be used for the treatment of cancer . 102 70 103 Magnetic nanorobots have demonstrated capabilities to prevent and treat antimicrobial resistant bacteria. Application of nanomotor implants have been proposed to achieve thorough disinfection of the dentine. 104 105 Cultural references html body.mediawiki This subsection may contain irrelevant references to popular culture . Please help improve it by removing such content and adding citations to reliable , independent sources . ( September 2020 ) The Nanites are characters on the TV show Mystery Science Theater 3000 . They're self-replicating, bio-engineered organisms that work on the ship and reside in the SOL's computer systems. They made their first appearance in Season 8. Nanites are used in a number of episodes in the television series Travelers . They be programmed and injected into injured people to perform repairs, and first appear in season 1. Nanites also feature in the Rise of Iron 2016 expansion for the video game Destiny in which SIVA, a self-replicating nanotechnology is used as a weapon. Nanites (referred to more often as nanomachines) are often referenced in Konami 's Metal Gear series, being used to enhance and regulate abilities and body functions. In the Star Trek franchise TV shows nanites play an important plot device. Starting with Evolution in the third season of The Next Generation , Borg Nanoprobes perform the function of maintaining the Borg cybernetic systems, as well as repairing damage to the organic parts of a Borg. They generate new technology inside a Borg when needed, as well as protecting them from many forms of disease. Nanites play a role in the Deus Ex video game series, being the basis of the nano-augmentation technology which gives augmented people superhuman abilities. Nanites are also mentioned in the Arc of a Scythe book series by Neal Shusterman and are used to heal all nonfatal injuries, regulate bodily functions, and considerably lessen pain. Nanites are also an integral part of Stargate SG1 and Stargate Atlantis , where grey goo scenarios are portrayed. Nanomachines are central to the plot of the Silo book series , in which they are used as a weapon of mass destruction propagated via the air, and enter undetected into the human body where, when receiving a signal, they kill the recipient. They are then used to wipe out the majority of the human race. See also Diamondoid Microswimmer Molecular machine Nanoelectromechanical systems Nanomotors Programmable matter References ↑ body:not(.skin-timeless):not(.skin-minerva) Vaughn JR (2006). Over the Horizon: Potential Impact of Emerging Trends in Information and Communication Technology on Disability Policy and Practice . National Council on Disability, Washington DC : 1– 55. ↑ Ghosh, A.; Fischer, P. (2009). Controlled Propulsion of Artificial Magnetic Nanostructured Propellers . Nano Letters . 9 (6): 2243– 2245. Bibcode : 2009NanoL...9.2243G . doi : 10.1021/nl900186w . PMID 19413293 . ↑ Sierra, D. P.; Weir, N. A.; Jones, J. F. (2005). A review of research in the field of nanorobotics (PDF) . U.S. Department of Energy – Office of Scientific and Technical Information Oak Ridge, TN . SAND2005-6808: 1– 50. doi : 10.2172/875622 . OSTI 875622 . ↑ Tarakanov, A. O.; Goncharova, L. B.; Tarakanov Y. A. (2009). Carbon nanotubes towards medicinal biochips . Wiley Interdisciplinary Reviews: Nanomedicine and Nanobiotechnology . 2 (1): 1– 10. doi : 10.1002/wnan.69 . PMID 20049826 . ↑ Ignatyev, M. B. (2010). Necessary and sufficient conditions of nanorobot synthesis . Doklady Mathematics . 82 (1): 671– 675. doi : 10.1134/S1064562410040435 . S2CID 121955001 . ↑ Cerofolini, G.; Amato, P.; Asserini, M.; Mauri, G. (2010). A Surveillance System for Early-Stage Diagnosis of Endogenous Diseases by Swarms of Nanobots . Advanced Science Letters . 3 (4): 345– 352. doi : 10.1166/asl.2010.1138 . ↑ Yarin, A. L. (2010). Nanofibers, nanofluidics, nanoparticles and nanobots for drug and protein delivery systems . Scientia Pharmaceutica Central European Symposium on Pharmaceutical Technology . 78 (3): 542. doi : 10.3797/scipharm.cespt.8.L02 . ↑ Wang, J. (2009). Can Man-Made Nanomachines Compete with Nature Biomotors? . ACS Nano . 3 (1): 4– 9. doi : 10.1021/nn800829k . PMID 19206241 . ↑ Amrute-Nayak, M.; Diensthuber, R. P.; Steffen, W.; Kathmann, D.; Hartmann, F. K.; Fedorov, R.; Urbanke, C.; Manstein, D. J.; Brenner, B.; Tsiavaliaris, G. (2010). Targeted Optimization of a Protein Nanomachine for Operation in Biohybrid Devices . Angewandte Chemie . 122 (2): 322– 326. Bibcode : 2010AngCh.122..322A . doi : 10.1002/ange.200905200 . PMID 19921669 . 1 2 Patel, G. M.; Patel, G. C.; Patel, R. B.; Patel, J. K.; Patel, M. (2006). Nanorobot: A versatile tool in nanomedicine . Journal of Drug Targeting . 14 (2): 63– 67. doi : 10.1080/10611860600612862 . PMID 16608733 . S2CID 25551052 . ↑ Balasubramanian, S.; Kagan, D.; Jack Hu, C. M.; Campuzano, S.; Lobo-Castañon, M. J.; Lim, N.; Kang, D. Y.; Zimmerman, M.; Zhang, L.; Wang, J. (2011). Micromachine-Enabled Capture and Isolation of Cancer Cells in Complex Media . Angewandte Chemie International Edition . 50 (18): 4161– 4164. doi : 10.1002/anie.201100115 . PMC 3119711 . PMID 21472835 . ↑ Langer, Robert (2010). Nanotechnology in Drug Delivery and Tissue Engineering: From Discovery to Applications . Nano Lett . 10 (9): 3223– 30. Bibcode : 2010NanoL..10.3223S . doi : 10.1021/nl102184c . PMC 2935937 . PMID 20726522 . ↑ Callaway DJ, Nicholl ID, Shi B, Reyes G, Farago B, Bu Z (2024). Nanoscale dynamics of the cadherin-catenin complex bound to vinculin revealed by neutron spin echo spectroscopy . Proceedings of the National Academy of Sciences of the United States of America . 129 (39). doi : 10.1073/pnas.2408459121 . PMC 11441495 . PMID 39298480 . ↑ Ehud Gazit, Plenty of room for biology at the bottom: An introduction to bionanotechnology. Imperial College Press, 2007, ISBN 978-1-86094-677-6 ↑ Feynman, Richard P. (December 1959). There's Plenty of Room at the Bottom . Archived from the original on 2010-02-11 . Retrieved 2016-04-14 . ↑ Zyvex: Self replication and nanotechnology : artificial self replicating systems will only function in carefully controlled artificial environments ... While self replicating systems are the key to low cost, there is no need (and little desire) to have such systems function in the outside world. Instead, in an artificial and controlled environment, they can manufacture simpler and more rugged systems that can then be transferred to their final destination. ... The resulting medical device will be simpler, smaller, more efficient and more precisely designed for the task at hand than a device designed to perform the same function and self replicate. ... A single device able to do both would be harder to design and less efficient. ↑ Foresight Guidelines for Responsible Nanotechnology Development Archived 2019-06-06 at the Wayback Machine Autonomous self-replicating assemblers are not necessary to achieve significant manufacturing capabilities. The simplest, most efficient, and safest approach to productive nanosystems is to make specialized nanoscale tools and put them together in factories big enough to make what is needed. ... The machines in this would work like the conveyor belts and assembly robots in a factory, doing similar jobs. If you pulled one of these machines out of the system, it would pose no risk, and be as inert as a light bulb pulled from its socket. ↑ NMI Table of Contents Page . www.nanomedicine.com . Retrieved 2025-01-10 . ↑ NMIIA . www.nanomedicine.com . Retrieved 2025-01-10 . ↑ Cavalcanti, A. (2009). Nanorobot Invention and Linux: The Open Technology Factor – An Open Letter to UNO General Secretary (PDF) . CANNXS Project . 1 (1): 1– 4. ↑ Huilgol, N.; Hede, S. (2006). S.; Gates, A. J.; Abdu, H. A.; Rose, G. S.; Picconatto, C. A.; Ellenbogen, J. C. (2007). Designs for Ultra-Tiny, Special-Purpose Nanoelectronic Circuits . IEEE Transactions on Circuits and Systems I: Regular Papers . 54 (11): 2528– 2540. doi : 10.1109/TCSI.2007.907864 . S2CID 13575385 . ↑ Solomon, N., Nanorobotics System , WIPO Patent WO/2008/063473, 2008. ↑ Kurzweil, R., Systems and Methods for Generating Biological Material , WIPO Patent WO/2007/001962, 2007. ↑ Rosso, F.; Barbarisi, M.; Barbarisi, A. (2011). Technology for Biotechnology . Biotechnology in Surgery . pp. 61– 73. doi : 10.1007/978-88-470-1658-3_4 . ISBN 978-88-470-1657-6 . ↑ Challacombe, B.; Althoefer, K.; Stoianovici, D. (2010). Emerging Robotics . New Technologies in Urology . Vol. 7. pp. 49– 56. doi : 10.1007/978-1-84882-178-1_7 . ISBN 978-1-84882-177-4 . ↑ Murday, J. S.; Siegel, R. W.; Stein, J.; Wright, J. F. (2009). Translational nanomedicine: Status assessment and opportunities . Nanomedicine: Nanotechnology, Biology and Medicine . 5 (3): 251– 273. doi : 10.1016/j.nano.2009.06.001 . PMID 19540359 . ↑ Hogg, T. (2007). Coordinating Microscopic Robots in Viscous Fluids . Autonomous Agents and Multi-Agent Systems . 14 (3): 271– 305. doi : 10.1007/s10458-006-9004-3 . S2CID 72083 . ↑ Ispir, M., Oktem, L., Method and apparatus for using entropy in ant colony optimization circuit design from high level synthesis , US Patent US8296711 B2, 2010. ↑ Ball, H. H., Lucas, M. R., Goutzoulis, A. P. U.S. patent 7,783,994 Method for providing secure and trusted ASICs using 3D integration , 2010. ↑ Pfister, M. U.S. patent 20,110,048,433 Method for forming an interventional aid with the aid of self-organizing nanorobots consisting of catoms and associated system unit , 2011. ↑ Cuschieri, A. (2005). Laparoscopic surgery: current status, issues and future developments . Surgeon . 3 (3): 125– 138. doi : 10.1016/S1479-666X(05)80032-0 . PMID 16075996 . ↑ Roco, M. C. (2003). Nanotechnology: convergence with modern biology and medicine . Current Opinion in Biotechnology (Submitted manuscript). 14 (3): 337– 346. doi : 10.1016/S0958-1669(03)00068-5 . PMID 12849790 . ↑ Scheufele, D. A.; Lewenstein, B. V. (2005). The Public and Nanotechnology: How Citizens Make Sense of Emerging Technologies . Journal of Nanoparticle Research . 7 (6): 659– 667. Bibcode : 2005JNR.....7..659S . doi : 10.1007/s11051-005-7526-2 . S2CID 136549696 . ↑ Smith, D. M.; Goldstein, D. S.; Heideman, J. (2007). Reverse Mergers and Nanotechnology . Nanotechnology Law Business . 4 (3). ↑ Morrison, S. (2008). The Unmanned Voyage: An Examination of Nanorobotic Liability (PDF) . Albany Law Journal of Science Technology . 18 (229). Archived from the original (PDF) on 2010-12-05. ↑ Craig Tyler, Patent Pirates Search For Texas Treasure Archived 2017-07-02 at the Wayback Machine , Texas Lawyer, September 20, 2004 ↑ Jaffe, A. B.; Lerner, J. (2004). Innovation and Its Discontents: How Our Broken Patent System is Endangering Innovation and Progress, and What to Do About It . Princeton University Press. ISBN 978-0-691-11725-6 . ↑ Gilbert, R. J.; Newbery, D. M. G. (June 1982). Preemptive Patenting and the Persistence of Monopoly . American Economic Review . 72 (3): 514– 526. JSTOR 1831552 . ↑ Fisher, B. (2008). Biological Research in the Evolution of Cancer Surgery: A Personal Perspective . Cancer Research . 68 (24): 10007– 10020. doi : 10.1158/0008-5472.CAN-08-0186 . PMID 19074862 . ↑ Cavalcanti, A.; Shirinzadeh, B.; Zhang, M.; Kretly, L. C. (2008). Nanorobot Hardware Architecture for Medical Defense . Sensors . 8 (5): 2932– 2958. Bibcode : 2008Senso...8.2932C . doi : 10.3390/s8052932 . PMC 3675524 . PMID 27879858 . ↑ Hill, C.; Amodeo, A.; Joseph, J. V.; Patel, H. R. (2008). Nano- and microrobotics: How far is the reality? . Expert Review of Anticancer Therapy . 8 (12): 1891– 1897. doi : 10.1586/14737140.8.12.1891 . PMID 19046109 . S2CID 29688647 . ↑ Cale, T. S.; Lu, J. Q.; Gutmann, R. J. (2008). Three-Dimensional Integration in Microelectronics: Motivation, Processing, and Thermomechanical Modeling . Chemical Engineering Communications . 195 (8): 847– 888. doi : 10.1080/00986440801930302 . S2CID 95022083 . ↑ Couvreur, P.; Vauthier, C. (2006). Nanotechnology: Intelligent Design to Treat Complex Disease . Pharmaceutical Research . 23 (7): 1417– 1450. doi : 10.1007/s11095-006-0284-8 . PMI",
  "cached_at": "2025-10-25T20:04:19.552007"
}