{
  "title": "Risk assessment",
  "summary": "Risk assessment is a process for identifying hazards, potential (future) events which may negatively impact on individuals, assets, and/or the environment because of those hazards, their likelihood and consequences, and actions which can mitigate these effects. The output from such a process may also be called a risk assessment. Hazard analysis forms the first stage of a risk assessment process. Judgments \"on the tolerability of the risk on the basis of a risk analysis\" also form part of the process. The results of a risk assessment process may be expressed in a quantitative or qualitative fashion.",
  "content": "Risk assessment Estimation of risk associated with exposure to a given set of hazards .mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}@media print{body.ns-0 .mw-parser-output .ambox{display:none!important}} This article's lead section may be too short to adequately summarize the key points . Please consider expanding the lead to provide an accessible overview of all important aspects of the article. ( February 2021 ) Risk assessment is a process for identifying hazards, potential (future) events which may negatively impact on individuals, assets, and/or the environment because of those hazards, their likelihood and consequences, and actions which can mitigate these effects. The output from such a process may also be called a risk assessment. Hazard analysis forms the first stage of a risk assessment process. Judgments \"on the tolerability of the risk on the basis of a risk analysis\" (i.e. risk evaluation) also form part of the process. [ 1 ] [ 2 ] The results of a risk assessment process may be expressed in a quantitative or qualitative fashion. [ 3 ] Risk assessment forms a key part of a broader risk management strategy to help reduce any potential risk-related consequences. [ 1 ] [ 2 ] Categories Individual risk assessment Risk assessment and risk management Venn diagram Risk assessments can be undertaken in individual cases, including in patient and physician interactions. [ 4 ] In the narrow sense chemical risk assessment is the assessment of a health risk in response to environmental exposures. [ 5 ] The ways statistics are expressed and communicated to an individual, both through words and numbers impact his or her interpretation of benefit and harm. For example, a fatality rate may be interpreted as less benign than the corresponding survival rate . [ 4 ] A systematic review of patients and doctors from 2017 found that overstatement of benefits and understatement of risks occurred more often than the alternative. [ 4 ] [ 6 ] A systematic review from the Cochrane collaboration suggested \"well-documented decision aids\" are helpful in reducing effects of such tendencies or biases. [ 4 ] [ 7 ] Aids may help people come to a decision about their care based on evidence informed information that align with their values. [ 7 ] Decision aids may also help people understand the risks more clearly, and they empower people to take an active role when making medical decisions. [ 7 ] The systematic review did not find a difference in people who regretted their decisions between those who used decision aids and those who had the usual standard treatment. [ 7 ] An individual's own risk perception may be affected by psychological, ideological, religious or otherwise subjective factors, which impact rationality of the process. [ 4 ] Individuals tend to be less rational when risks and exposures concern themselves as opposed to others. [ 4 ] There is also a tendency to underestimate risks that are voluntary or where the individual sees themselves as being in control, such as smoking. [ 4 ] Systems risk assessment Risk assessment can also be made on a much larger systems theory scale, for example assessing the risks of an ecosystem or an interactively complex mechanical, electronic, nuclear, and biological system or a hurricane (a complex meteorological and geographical system). Systems may be defined as linear and nonlinear (or complex), where linear systems are predictable and relatively easy to understand given a change in input, and non-linear systems unpredictable when inputs are changed. [ 8 ] As such, risk assessments of non-linear/complex systems tend to be more challenging. In the engineering of complex systems , sophisticated risk assessments are often made within safety engineering and reliability engineering when it concerns threats to life, natural environment , or machine functioning. The agriculture, nuclear, aerospace, oil, chemical, railroad, and military industries have a long history of dealing with risk assessment. [ 9 ] Also, medical, hospital, social service , [ 10 ] and food industries control risks and perform risk assessments on a continual basis. Methods for assessment of risk may differ between industries and whether it pertains to general financial decisions or environmental, ecological, or public health risk assessment. [ 9 ] Concept Rapid technological change, increasing scale of industrial complexes, increased system integration, market competition , and other factors have been shown to increase societal risk in the past few decades. [ 1 ] As such, risk assessments become increasingly critical in mitigating accidents, improving safety, and improving outcomes. Risk assessment consists of an objective evaluation of risk in which assumptions and uncertainties are clearly considered and presented. This involves identification of risk (what can happen and why), the potential consequences, the probability of occurrence , the tolerability or acceptability of the risk, and ways to mitigate or reduce the probability of the risk. [ 2 ] Optimally, it also involves documentation of the risk assessment and its findings, implementation of mitigation methods, and review of the assessment (or risk management plan), coupled with updates when necessary. [ 1 ] Sometimes risks can be deemed acceptable, meaning the risk \"is understood and tolerated ... usually because the cost or difficulty of implementing an effective countermeasure for the associated vulnerability exceeds the expectation of loss.\" [ 11 ] Mild versus wild risk Benoit Mandelbrot distinguished between \"mild\" and \"wild\" risk and argued that risk assessment and risk management must be fundamentally different for the two types of risk. [ 12 ] Mild risk follows normal or near-normal probability distributions , is subject to regression to the mean and the law of large numbers , and is therefore relatively predictable. Wild risk follows fat-tailed distributions , e.g., Pareto or power-law distributions , is subject to regression to the tail (infinite mean or variance, rendering the law of large numbers invalid or ineffective), and is therefore difficult or impossible to predict. A common error in risk assessment and management is to underestimate the wildness of risk, assuming risk to be mild when in fact it is wild, which must be avoided if risk assessment and management are to be valid and reliable, according to Mandelbrot. Mathematical conceptualization Risk assessment from a financial point of view To see the risk management process expressed mathematically, one can define expected risk as the sum over individual risks, R i {\\displaystyle R_{i}} , which can be computed as the product of potential losses, L i {\\displaystyle L_{i}} , and their probabilities, p ( L i ) {\\displaystyle p(L_{i})} : R i = L i p ( L i ) {\\displaystyle R_{i}=L_{i}p(L_{i})\\,\\!} R e x p = ∑ i L i p ( L i ) {\\displaystyle R_{exp}=\\sum _{i}L_{i}p(L_{i})\\,\\!} Even though for some risks R i , R j {\\displaystyle R_{i},R_{j}} , we might have R i = R j {\\displaystyle R_{i}=R_{j}} , if the probability p ( L j ) {\\displaystyle p(L_{j})} is small compared to p ( L i ) {\\displaystyle p(L_{i})} , its estimation might be based only on a smaller number of prior events, and hence, more uncertain. On the other hand, since R i = R j {\\displaystyle R_{i}=R_{j}} , L j {\\displaystyle L_{j}} must be larger than L i {\\displaystyle L_{i}} , so decisions based on this uncertainty would be more consequential, and hence, warrant a different approach. This becomes important when we consider the variance of risk R v a r = ∑ i L i 2 p ( L i ) − ( ∑ i R i ) 2 {\\displaystyle R_{var}=\\sum _{i}L_{i}^{2}p(L_{i})-\\left(\\sum _{i}R_{i}\\right)^{2}} as a large L i {\\displaystyle L_{i}} changes the value. Financial decisions, such as insurance, express loss in terms of dollar amounts. When risk assessment is used for public health or environmental decisions, the loss can be quantified in a common metric such as a country's currency or some numerical measure of a location's quality of life. For public health and environmental decisions, the loss is simply a verbal description of the outcome, such as increased cancer incidence or incidence of birth defects. In that case, the \"risk\" is expressed as R i = p ( L i ) {\\displaystyle R_{i}=p(L_{i})\\,\\!} If the risk estimate takes into account information on the number of individuals exposed, it is termed a \"population risk\" and is in units of expected increased cases per time period. If the risk estimate does not take into account the number of individuals exposed, it is termed an \"individual risk\" and is in units of incidence rate per time period. Population risks are of more use for cost/benefit analysis; individual risks are of more use for evaluating whether risks to individuals are \"acceptable\". Quantitative risk assessment .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} Further information: Quantitative risk assessment software In quantitative risk assessment, an annualized loss expectancy (ALE) may be used to justify the cost of implementing countermeasures to protect an asset. This may be calculated by multiplying the single loss expectancy (SLE), which is the loss of value based on a single security incident, with the annualized rate of occurrence (ARO), which is an estimate of how often a threat would be successful in exploiting a vulnerability. The usefulness of quantitative risk assessment has been questioned, however. Barry Commoner , Brian Wynne and other critics have expressed concerns that risk assessment tends to be overly quantitative and reductive. For example, they argue that risk assessments ignore qualitative differences among risks. Some charge that assessments may drop out important non-quantifiable or inaccessible information, such as variations among the classes of people exposed to hazards, or social amplification. [ 13 ] Furthermore, Commoner [ 14 ] and O'Brien [ 15 ] claim that quantitative approaches divert attention from precautionary or preventative measures. [ 16 ] Others, like Nassim Nicholas Taleb consider risk managers little more than \"blind users\" of statistical tools and methods. [ 17 ] Risk engineering Risk engineering is central to the assessment phase, where risks are not only identified but rigorously analyzed, quantified, and modeled. In the context of financial systems—particularly credit risk—risk engineering involves understanding the dynamic behavior of risk parameters such as probability of default, exposure at default, and loss given default. [ 18 ] These are not treated as isolated figures but as interconnected components that respond to systemic and idiosyncratic changes. As individual risks aggregate into portfolios or larger systems, risk engineers deploy statistical models and simulation techniques to uncover dependencies and potential cascade effects. This systems-level view enables the modeling of stress scenarios and rare, high-impact events—what some refer to as \"wild risk.\" It also supports the design of robust structures capable of absorbing shocks and preventing systemic collapse. [ 19 ] Regulatory frameworks add another layer to the assessment process, requiring that risk engineering efforts not only reflect real-world complexity but also align with institutional constraints. Process Older textbooks distinguish between the term risk analysis and risk evaluation ; a risk analysis includes the following 4 steps: [ 1 ] establish the context, which restricts the range of hazards to be considered. It is also necessary to identify the potential parties or assets which may be affected by the threat, and the potential consequences to them if the hazard is activated. hazard identification , an identification of visible and implied hazards and determining the qualitative nature of the potential adverse consequences of each hazard. Without a potential adverse consequence, there is no hazard. frequency analysis If a consequence is dependent on dose, i.e. the amount of exposure, the relationship between dose and severity of consequence must be established, and the risk depends on the probable dose, which may depend on concentration or amplitude and duration or frequency of exposure. This is the general case for many health hazards where the mechanism of injury is toxicity or repetitive injury, particularly where the effect is cumulative . consequence analysis. For other hazards, the consequences may either occur or not, and the severity may be extremely variable even when the triggering conditions are the same. This is typical of many biological hazards as well as a large range of safety hazards. Exposure to a pathogen may or may not result in actual infection, and the consequences of infection may also be variable. Similarly, a fall from the same place may result in minor injury or death, depending on unpredictable details. In these cases, estimates must be made of reasonably likely consequences and associated probability of occurrence. A risk evaluation means that judgements are made on the tolerability of the identified risks, leading to risk acceptance. When risk analysis and risk evaluation are made at the same time, it is called risk assessment. [ 1 ] As of 2023, chemical risk assessment follows these 4 steps: [ 5 ] hazard characterization exposure assessment dose-response modeling risk characterization. There is tremendous variability in the dose-response relationship between a chemical and human health outcome in particularly susceptible subgroups, such as pregnant women, developing fetuses, children up to adolescence, people with low socioeconomic status, those with preexisting diseases, disabilities, genetic susceptibility , and those with other environmental exposures . [ 5 ] The process of risk assessment may be somewhat informal at the individual social level, assessing economic and household risks, [ 20 ] [ 21 ] or a sophisticated process at the strategic corporate level. However, in both cases, ability to anticipate future events and create effective strategies for mitigating them when deemed unacceptable is vital. At the individual level, identifying objectives and risks, weighing their importance, and creating plans, may be all that is necessary. At the strategic organisational level, more elaborate policies are necessary, specifying acceptable levels of risk, procedures to be followed within the organisation, priorities, and allocation of resources. [ 22 ] : 10 At the strategic corporate level, management involved with the project produce project level risk assessments with the assistance of the available expertise as part of the planning process and set up systems to ensure that required actions to manage the assessed risk are in place. At the dynamic level, the personnel directly involved may be required to deal with unforeseen problems in real time. The tactical decisions made at this level should be reviewed after the operation to provide feedback on the effectiveness of both the planned procedures and decisions made in response to the contingency. Dose dependent risk Food risk assessment nomogram This section does not cite any sources . Please help improve this section by adding citations to reliable sources . Unsourced material may be challenged and removed . ( March 2023 ) ( Learn how and when to remove this message ) Dose-Response Analysis , is determining the relationship between dose and the type of adverse response and/or probability or the incidence of effect (dose-response assessment). The complexity of this step in many contexts derives mainly from the need to extrapolate results from experimental animals (e.g. mouse , rat ) to humans, and/or from high to lower doses, including from high acute occupational levels to low chronic environmental levels. In addition, the differences between individuals due to genetics or other factors mean that the hazard may be higher for particular groups, called susceptible populations. An alternative to dose-response estimation is to determine a concentration unlikely to yield observable effects, that is, a no effect concentration . In developing such a dose, to account for the largely unknown effects of animal to human extrapolations, increased variability in humans, or missing data, a prudent approach is often adopted by including safety or uncertainty factors in the estimate of the \"safe\" dose, typically a factor of 10 for each unknown step. Exposure Quantification , aims to determine the amount of a contaminant (dose) that individuals and populations will receive, either as a contact level (e.g., concentration in ambient air) or as intake (e.g., daily dose ingested from drinking water). This is done by examining the results of the discipline of exposure assessment . As a different location, lifestyle, and other factors likely influence the amount of contaminant that is received, a range or distribution of possible values is generated in this step. Particular care is taken to determine the exposure of the susceptible population(s). The results of these steps are combined to produce an estimate of risk. Because of the different susceptibilities and exposures, this risk will vary within a population. An uncertainty analysis is usually included in a health risk assessment. Dynamic risk assessment During an emergency response, the situation and hazards are often inherently less predictable than for planned activities (non-linear). In general, if the situation and hazards are predictable (linear), standard operating procedures should deal with them adequately. In some emergencies, this may also hold true, with the preparation and trained responses being adequate to manage the situation. In these situations, the operator can manage risk without outside assistance, or with the assistance of a backup team who are prepared and available to step in at short notice. Other emergencies occur where there is no previously planned protocol, or when an outsider group is brought in to handle the situation, and they are not specifically prepared for the scenario that exists but must deal with it without undue delay. Examples include police, fire department, disaster response, and other public service rescue teams. In these cases, ongoing risk assessment by the involved personnel can advise appropriate action to reduce risk. [ 22 ] HM Fire Services Inspectorate has defined dynamic risk assessment (DRA) as: {{cite journal| vauthors = Lock G | veditors = Phillips M |title=Public Safety Diving-Dynamic Risk Assessment|journal=PS Diver Magazine|date=June 2017|issue=116|page=9|url=http://psdiver.com/images/PSDiver_Issue_116_-_SECURE.pdf|access-date=20 June 2017}}&lt;/ref>\"}},\"i\":0}}]}' id=\"mwAUY\">.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 32px}.mw-parser-output .templatequotecite{line-height:1.5em;text-align:left;margin-top:0}@media(min-width:500px){.mw-parser-output .templatequotecite{padding-left:1.6em}} The continuous assessment of risk in the rapidly changing circumstances of an operational incident, in order to implement the control measures necessary to ensure an acceptable level of safety. [ 22 ] Dynamic risk assessment is the final stage of an integrated safety management system that can provide an appropriate response during changing circumstances. It relies on experience, training and continuing education, including effective debriefing to analyse not only what went wrong, but also what went right, and why, and to share this with other members of the team and the personnel responsible for the planning level risk assessment. [ 22 ] Fields of application The application of risk assessment procedures is common in a wide range of fields, and these may have specific legal obligations, codes of practice, and standardised procedures. Some of these are listed here. General human health There are many resources that provide human health risk information: The National Library of Medicine provides risk assessment and regulation information tools for a varied audience. [ 23 ] These include: TOXNET (databases on hazardous chemicals, environmental health, and toxic releases), [ 24 ] the Household Products Database (potential health effects of chemicals in over 10,000 common household products), [ 25 ] TOXMAP (maps of the U.S. Environmental Protection Agency Superfund and Toxics Release Inventory data). The United States Environmental Protection Agency provides basic information about environmental health risk assessments for the public for a wide variety of possible environmental exposures. [ 26 ] The Environmental Protection Agency began actively using risk assessment methods to protect drinking water in the United States after the passage of the Safe Drinking Water Act of 1974. The law required the National Academy of Sciences to conduct a study on drinking water issues, and in its report, the NAS described some methodologies for doing risk assessments for chemicals that were suspected carcinogens, recommendations that top EPA officials have described as perhaps the study's most important part. [ 27 ] Considering the increase in junk food and its toxicity, FDA required in 1973 that cancer-causing compounds must not be present in meat at concentrations that would cause a cancer risk greater than 1 in a million over a lifetime. The US Environmental Protection Agency provides extensive information about ecological and environmental risk assessments for the public via its risk assessment portal. [ 28 ] The Stockholm Convention on persistent organic pollutants (POPs) supports a qualitative risk framework for public health protection from chemicals that display environmental and biological persistence, bioaccumulation , toxicity (PBT) and long range transport; most global chemicals that meet this criterion have been previously assessed quantitatively by national and international health agencies. [ 29 ] For non-cancer health effects, the terms reference dose (RfD) or reference concentration (RfC) are used to describe the safe level of exposure in a dichotomous fashion. Newer ways of communicating the risk is the probabilistic risk assessment . [ 30 ] Small sub-populations When risks apply mainly to small sub-populations, it can be difficult to determine when intervention is necessary. For example, there may be a risk that is very low for everyone, other than 0.1% of the population. It is necessary to determine whether this 0.1% is represented by: all infants younger than X days or recreational users of a particular product. If the risk is higher for a particular sub-population because of abnormal exposure rather than susceptibility, strategies to further reduce the exposure of that subgroup are considered. If an identifiable sub-population is more susceptible due to inherent genetic or other factors, public policy choices must be made. The choices are: to set policies for protecting the general population that are protective of such groups, e.g. for children when data exists, the Clean Air Act for populations such as asthmatics or not to set policies, because the group is too small, or the costs too high. Acceptable risk criteria \"Acceptable risk\" redirects here. For the television show, see Acceptable Risk (TV series) . For the book, see Acceptable Risk (novel) . Acceptable risk is a risk that is understood and tolerated usually because the cost or difficulty of implementing an effective countermeasure for the associated vulnerability exceeds the expectation of loss. [ 31 ] The idea of not increasing lifetime risk by more than one in a million has become commonplace in public health discourse and policy. [ 32 ] It is a heuristic measure. It provides a numerical basis for establishing a negligible increase in risk. Environmental decision making allows some discretion for deeming individual risks potentially \"acceptable\" if less than one in ten thousand chance of increased lifetime risk. Low risk criteria such as these provide some protection for a case where individuals may be exposed to multiple chemicals e.g. pollutants, food additives, or other chemicals. [ citation needed ] In practice, a true zero-risk is possible only with the suppression of the risk-causing activity. [ citation needed ] Stringent requirements of 1 in a million may not be technologically feasible or may be so prohibitively expensive as to render the risk-causing activity unsustainable, resulting in the optimal degree of intervention being a balance between risks vs. benefit. [ citation needed ] For example, emissions from hospital incinerators result in a certain number of deaths per year. However, this risk must be balanced against the alternatives. There are public health risks, as well as economic costs, associated with all options. The risk associated with no incineration is the potential spread of infectious diseases or even no hospitals. Further investigation identifies options such as separating noninfectious from infectious wastes, or air pollution controls on a medical incinerator. Intelligent thought about a reasonably full set of options is essential. Thus, it is not unusual for there to be an iterative process between analysis, consideration of options, and follow up analysis. [ citation needed ] Public health In the context of public health , risk assessment is the process of characterizing the nature and likelihood of a harmful effect to individuals or populations from certain human activities. Health risk assessment can be mostly qualitative or can include statistical estimates of probabilities for specific populations. In most countries, the use of specific chemicals or the operations of specific facilities (e.g. power plants, manufacturing plants) is not allowed unless it can be shown that they do not increase the risk of death or illness above a specific threshold. For example, the American Food and Drug Administration (FDA) regulates food safety through risk assessment, while the EFSA does the same in EU. [ 33 ] An occupational risk assessment is an evaluation of how much potential danger a hazard can have to a person in a workplace environment. The assessment takes into account possible scenarios in addition to the probability of their occurrence and the results. [ 34 ] The six types of hazards to be aware of are safety (those that can cause injury), chemicals , biological , physical , psychosocial (those that cause stress, harassment) and ergonomic (those that can cause musculoskeletal disorders ). [ 35 ] To appropriately access hazards there are two parts that must occur. Firstly, there must be an \" exposure assessment \" which measures the likelihood of worker contact and the level of contact. Secondly, a \"risk characterization\" must be made which measures the probability and severity of the possible health risks. [ 36 ] Human settlements The importance of risk assessments to manage the consequences of climate change and variability is recalled in the global frameworks for disaster risk reduction , adopted by the member countries of the United Nations at the end of the World Conferences held in Kobe (2005) and Sendai (2015). The Sendai Framework for Disaster Risk Reduction brings attention to the local scale and encourages a holistic risk approach, which should consider all the hazards to which a community is exposed, the integration of technical-scientific knowledge with local knowledge, and the inclusion of the concept of risk in local plans to achieve a significant disaster reduction by 2030. Taking these principles into daily practice poses a challenge for many countries. The Sendai framework monitoring system highlights how little is known about the progress made from 2015 to 2019 in local disaster risk reduction. [ 37 ] Sub-Saharan Africa As of 2019, in the South of the Sahara, risk assessment is not yet an institutionalized practice. The exposure of human settlements to multiple hazards (hydrological and agricultural drought, pluvial, fluvial and coastal floods) is frequent and requires risk assessments on a regional, municipal, and sometimes individual human settlement scale. The multidisciplinary approach and the integration of local and technical-scientific knowledge are necessary from the first steps of the assessment. Local knowledge remains unavoidable to understand the hazards that threaten individual communities, the critical thresholds in which they turn into disasters, for the validation of hydraulic models , and in the decision-making process on risk reduction . On the other hand, local knowledge alone is not enough to understand the impacts of future changes and climatic variability and to know the areas exposed to infrequent hazards. The availability of new technologies and open access information (high resolution satellite images, daily rainfall data) allow assessment today with an accuracy that only 10 years ago was unimaginable. The images taken by unmanned vehicle technologies allow to produce very high resolution digital elevation models and to accurately identify the receptors. [ 38 ] Based on this information, the hydraulic models allow the identification of flood areas with precision even at the scale of small settlements. [ 39 ] The information on loss and damages and on cereal crop at individual settlement scale allow to determine the level of multi-hazard risk on a regional scale.The multi-temporal high-resolution satellite images allow to assess the hydrological drought and the dynamics of human settlements in the flood zone. [ 40 ] Risk assessment is more than an aid to informed decision making about risk reduction or acceptance. [ 41 ] It integrates early warning systems by highlighting the hot spots where disaster prevention and preparedness are most urgent. [ 42 ] When risk assessment considers the dynamics of exposure over time, it helps to identify risk reduction policies that are more appropriate to the local context. Despite these potentials, the risk assessment is not yet integrated into the local planning in the South of the Sahara which, in the best of cases, uses only the analysis of vulnerability to climate change and variability. [ 42 ] Auditing For audits performed by an outside audit firm, risk assessment is a crucial stage before accepting an audit engagement. According to ISA315 Understanding the Entity and its Environment and Assessing the Risks of Material Misstatement , \"the auditor should perform risk assessment procedures to obtain an understanding of the entity and its environment, including its internal control\". Evidence relating to the auditor's risk assessment of a material misstatement in the client's financial statements. Then, the auditor obtains initial evidence regarding the classes of transactions at the client and the operating effectiveness of the client's internal controls. Audit risk is defined as the risk that the auditor will issue a clean unmodified opinion regarding the financial statements, when in fact the financial statements are materially misstated, and therefore do not qualify for a clean unmodified opinion. As a formula, audit risk is the product of two other risks: Risk of Material Misstatement and Detection Risk. This formula can be further broken down as follows: inherent risk × control risk × detection risk . Project management In project management , risk assessment is an integral part of the risk management plan, studying the probability, the impact, and the effect of every known risk on the project, as well as the corrective action to take should an incident be implied by a risk occur. [ 43 ] Of special consideration in this area are the relevant codes of practice that are enforced in the specific jurisdiction. Understanding the regime of regulations that risk management must abide by is integral to formulating safe and compliant risk assessment practices. Information security Main article: IT risk management § Risk assessment Information technology risk assessment can be performed by a qualitative or quantitative approach, following different methodologies. One important difference [ clarification needed ] in risk assessments in information security is modifying the threat model to account for the fact that any adversarial system connected to the Internet has access to threaten any other connected system. [ 44 ] Risk assessments may therefore need to be modified to account for the threats from all adversaries, instead of just those with reasonable access as is done in other fields. NIST Definition: The process of identifying risks to organizational operations (including mission, functions, image, reputation), organizational assets, individuals, other organizations, and the Nation, resulting from the operation of an information system. Part of risk management incorporates threat and vulnerability analyses and considers mitigations provided by security controls planned or in place. [ 45 ] There are various risk assessment methodologies and frameworks available which include NIST Risk Management Framework (RMF), [ 46 ] Control Objectives for Information and Related Technologies (COBIT), [ 47 ] Factor Analysis of Information Risk (FAIR), [ 48 ] Operationally Critical Threat, Asset, and Vulnerability Evaluation (OCTAVE), [ 49 ] The Center for Internet Security Risk Assessment Method (CIS RAM), [ 50 ] and The Duty of Care Risk Analysis (DoCRA) Standard, [ 51 ] which helps define 'reasonable' security. Cybersecurity Main article: cybersecurity The Threat and Risk Assessment (TRA) process is part of risk management referring to risks related to cyber threats . The TRA process will identify cyber risks, assess risks' severities, and may recommend activities to reduce risks to an acceptable level. There are different methodologies for performing TRA (e.g., Harmonized TRA Methodology [ 52 ] ), all utilize the following elements: [ 53 ] [ 54 ] [ 55 ] identifying of assets (what should be protected), identifying and assessing of the threats and vulnerabilities for the identified assets, determining the exploitability of the vulnerabilities, determining the levels of risk associated with the vulnerabilities (what are the implications if the assets were damaged or lost), and recommending a risk mitigation program. Megainvestment projects Megaprojects (sometimes also called \"major programs\") are extremely large-scale investment projects, typically costing more than US$1 billion per project. They include bridges, tunnels, highways, railways, airports, seaports, power plants, dams, wastewater projects, coastal flood protection, oil and natural gas extraction projects, public buildings, information technology systems, aerospace projects, and defence systems. Megaprojects have been shown to be particularly risky in terms of finance, safety, and social and environmental impacts . Software evolution Studies have shown that early parts of the system development cycle such as requirements and design specifications are especially prone to error. This effect is particularly notorious in projects involving multiple stakeholders with different points of view. Evolutionary software processes offer an iterative approach to requirement engineering to alleviate the problems of uncertainty, ambiguity, and inconsistency inherent in software developments, including uncertainty, ambiguity, and inconsistency inherent in software developments. [ clarification needed ] Shipping industry In July 2010, shipping companies agreed to use standardized procedures in order to assess risk in key shipboard operations. These procedures were implemented as part of the amended ISM Code . [ 56 ] Underwater diving See also: List of diving hazards and precautions Formal risk assessment is a required component of most professional dive planning , but the format and methodology may vary. Consequences of an incident due to an identified hazard are generally chosen from a small number of standardised categories, and probability is estimated based on statistical data on the rare occasions when it is available, and on a best guess estimate based on personal experience and company policy in most cases. A simple risk matrix is often used to transform these inputs into a level of risk, generally expressed as unacceptable, marginal or acceptable. If unacceptable, measures must be taken to reduce the risk to an acceptable level, and the outcome of the risk assessment must be accepted by the affected parties before a dive commences. Higher levels of risk may be acceptable in special circumstances, such as military or search and rescue operations when there is a chance of recovering a survivor. Diving supervisors are trained in the procedures of hazard identification and risk assessment , and it is part of their planning and operational responsibility. Both health and safety hazards must be considered. Several stages may be identified. There is risk assessment done as part of the diving project planning, on site risk assessment which takes into account the specific conditions of the day, and dynamic risk assessment which is ongoing during the operation by the members of the dive team, particularly the supervisor and the working diver. [ 57 ] [ 58 ] In recreational scuba diving , the extent of risk assessment expected of the diver is relatively basic and is included in the pre-dive checks . Several mnemonics have been developed by diver certification agencies to remind the diver to pay some attention to risk, but the training is rudimentary. Diving service providers are expected to provide a higher level of care for their customers, and diving instructors and divemasters are expected to assess risk on behalf of their customers and warn them of site-specific hazards and the competence considered appropriate for the planned dive. Technical divers are expected to make a more thorough assessment of risk, but as they will be making an informed choice for a recreational activity, the level of acceptable risk may be considerably higher than that permitted for occupational divers under the direction of an employer. [ 59 ] [ 60 ] Outdoor and wilderness adventure In outdoor activities including commercial outdoor education, wilderness expeditions, and outdoor recreation , risk assessment refers to the analysis of the probability and magnitude of unfavorable outcomes such as injury, illness, or property damage due to environmental and related causes, compared to the human development or other benefits of outdoor activity. This is of particular importance as school programs and others weigh the benefits of youth and adult participation in various outdoor learning activities against the inherent and other hazards present in those activities. Schools, corporate entities seeking team-building experiences, parents/guardians, and others considering outdoor experiences expect or require [ 61 ] organizations to assess the hazards and risks of different outdoor activities—such as sailing, target shooting, hunting, mountaineering, or camping—and select activities with acceptable risk profiles. Outdoor education, wilderness adventure, and other outdoor-related organizations should, and are in some jurisdictions required, to conduct risk assessments prior to offering programs for commercial purposes. [ 62 ] [ 63 ] [ 64 ] Such organizations are given guidance on how to provide their risk assessments. [ 65 ] Risk assessments for led outdoor activities form only one component of a comprehensive risk management plan, as many risk assessments use a basic linear-style thinking that does not employ more modern risk management practice employing complex socio-technical systems theory. [ 66 ] [ 67 ] Environment Environmental Risk Assessment (ERA) aims to assess the effects of stressors, usually chemicals, on the local environment. A risk is an integrated assessment of the likelihood and severity of an undesired event. In ERA, the undesired event often depends on the chemical of interest and on the risk assessment scenario. [ 68 ] This undesired event is usually a detrimental effect on organisms, populations or ecosystems . Current ERAs usually compare an exposure to a no-effect level, such as the Predicted Environmental Concentration / Predicted No-Effect Concentration (PEC/PNEC) ratio in Europe. Although this type of ratio is useful and often used in regulation purposes, it is only an indication of an exceeded apparent threshold. [ 69 ] New approaches start to be developed in ERA in order to quantify this risk and to communicate effectively on it with both the managers and the general public. [ 68 ] Ecological risk assessment is complicated by the fact that there are many nonchemical stressors that substantially influence ecosystems, communities, and individual plants and animals, as well as across landscapes and regions. [ 70 ] [ 71 ] Defining the undesired (adverse) event is a political or policy judgment, further complicating applying traditional risk analysis tools to ecological systems. Much of the policy debate surrounding ecological risk assessment is over defining precisely what is an adverse event. [ 72 ] Biodiversity Biodiversity Risk Assessments evaluate risks to biological diversity , specially the risk of species extinction or the risk of ecosystem collapse . The units of assessments are the biological (species, subspecies or populations ) or ecological entities ( habitats , ecosystems , etc.), and the risk are often related to human actions and interventions (threats and pressures). Regional and national protocols have been proposed by multiple academic or governmental institutions and working groups, [ 73 ] but global standards such as the Red List of Threatened Species and the IUCN Red List of Ecosystems have been widely adopted, and are recognized or proposed as official indicators of progress toward international policy targets and goals, such as the Aichi targets and the Sustainable Development Goals . [ 74 ] [ 75 ] Law Risk assessments are used in numerous stages during the legal process and are developed to measure a wide variety of items, such as recidivism rates, potential pretrial issues, probation/parole, and to identify potential interventions for defendants. [ 76 ] Clinical psychologists, forensic psychologists, and other practitioners are responsible for conducting risk assessments. [ 76 ] [ 77 ] [ 78 ] Depending on the risk assessment tool, practitioners are required to gather a variety of background information on the defendant or individual being assessed. This information includes their previous criminal history (if applicable) and other records (i.e. Demographics, Education, Job Status, Medical History), which can be accessed through direct interview with the defendant or on-file records. [ 76 ] In the pre-trial stage, a widely used risk assessment tool is the Public Safety Assessment, [ 79 ] which predicts failure to appear in court, likelihood of a new criminal arrest while on pretrial release, and likelihood of a new violent criminal arrest while on pretrial release. Multiple items are observed and taken into account based on which aspect of the PSA is being focused, and like all other actuarial risk assessments, each item is assigned a weighted amount to produce a final score. [ 76 ] Detailed information such as transparency on the items the PSA factors and how scores are distributed are accessible online. [ 80 ] For defendants who have been incarcerated, risk assessments are used to determine their likelihood of recidivism and inform sentence length decisions. Risk assessments also aid parole/probation officers in determining the level of supervision a probationer should be subjected to and what interventions could be implemented to improve offender risk status. [ 77 ] The Correctional Offender Management Profiling for Alternative Sanctions (COMPAS) is a risk assessment too designed to measure pretrial release risk, general recidivism risk, and violent recidivism risk. Detailed information on scoring and algorithms for COMPAS are not accessible to the general public. See also .mw-parser-output .div-col{margin-top:0.3em;column-width:30em}.mw-parser-output .div-col-small{font-size:90%}.mw-parser-output .div-col-rules{column-rule:1px solid #aaa}.mw-parser-output .div-col dl,.mw-parser-output .div-col ol,.mw-parser-output .div-col ul{margin-top:0}.mw-parser-output .div-col li,.mw-parser-output .div-col dd{page-break-inside:avoid;break-inside:avoid-column} Acceptable loss – Military euphemism Benefit shortfall – When the actual benefits of a venture are less than the projected or estimated benefits Control self-assessment – Technique to assess process effectiveness Cost overrun – Unexpected incurred costs in excess of budgeted amounts Digital continuity Duty of care – Type of legal obligation Edwards v National Coal Board Extreme risk – Low-probability risk of very bad outcomes Environmental impact assessment – Assessment of the environmental consequences of a decision before action Flood risk assessment – Type of risk assessment with respect to floods Form 696 – Metropolitan Police risk assessment Global catastrophic risk – Hypothetical global-scale disaster risk Hazard analysis – Method for assessing risk Hazard analysis and critical control points ( HACCP ) – Systematic preventive approach to food safety risk assessment in food Health impact assessment – Type of public health document Horizon scanning – Methodology in futures studies Information assurance – Multi-disciplinary methods for decision support systems security Index of auditing-related articles ISO 28000 – Management system standard ISO 31000 – Set of international standards for risk management ISSOW Megaprojects and Risk – 2003 book by Bent Flyvbjerg, Nils Bruzelius and Werner Rothengatter Network theory in risk assessment Occupational exposure banding – Process to assign chemicals into categories corresponding to permissible exposure concentrations Optimism bias – Type of cognitive bias PIMEX a video exposure monitoring method Planning fallacy – Cognitive bias of underestimating time needed Probabilistic risk assessment – Methodology for evaluating risks Probit model – Statistical regression where the dependent variable can take only two values Project risk management Reference class forecasting – Method of predicting the future Reliability engineering – Sub-discipline of systems engineering that emphasizes dependability Risk assessment using qualifiers Risk-based auditing Risk management tools Risk matrix – Risk assessment comparing the likelihood of a risk to its severity Safety engineering – Engineering discipline Security risk – Possibility of something bad happening Pages displaying short descriptions of redirect targets Statistical risk Strategic misrepresentation – Cognitive bias of underestimating time needed Pages displaying short descriptions of redirect targets Gordon–Loeb model for cyber security investments References References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} 1 2 3 4 5 6 .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-pa",
  "cached_at": "2025-10-25T19:37:39.340189"
}