{
  "title": "Service robot",
  "summary": "Service robots assist human beings, typically by performing a job that is dirty, dull, distant, dangerous or repetitive. They typically are autonomous and/or operated by a built-in control system, with manual override options. The term service robot does not have a strict technical definition. The International Organization for Standardization defines a “service robot” as a robot “that performs useful tasks for humans or equipment excluding industrial automation applications”",
  "content": "Service robot Robot that assists humans Video: A type of service robot which became popular with the rise of the smart home technology is the robotic lawn mower , here applied in a small garden Service robots assist human beings, typically by performing a job that is dirty, dull, distant, dangerous or repetitive (four Ds of robotization). They typically are autonomous and/or operated by a built-in control system, with manual override options. The term service robot does not have a strict technical definition. The International Organization for Standardization defines a “service robot” as a robot “that performs useful tasks for humans or equipment excluding industrial automation applications”. 1 The first industrial robot arm, Unimate, was developed by Joseph F. Engelberger, known as the father of the robot arm, using George Devel. 2 According to ISO 8373 robots require “a degree of autonomy”, which is the “ability to perform intended tasks based on current state and sensing, without human intervention”. For service robots this ranges from partial autonomy - including human-robot interaction - to full autonomy - without active human robot intervention. The International Federation of Robotics (IFR) statistics for service robots therefore include systems based on some degree of human robot interaction or even full tele-operation as well as fully autonomous systems. Service robots are categorized according to personal or professional use. They have many forms and structures as well as application areas. Types The possible applications of robots to assist in human chores is widespread. At present there are a few main categories that these robots fall into. Industrial Industrial service robots can be used to carry out simple tasks, such as examining welding, as well as more complex, harsh-environment tasks, such as aiding in the dismantling of nuclear power stations. Industrial robots have been defined by the International Federation of Robotics as an automatically controlled, reprogrammable, multipurpose manipulator programmable in three or more axes, which may be either fixed in place or mobile for use in industrial automation applications . 3 Frontline Service Robots Service robots are system-based autonomous and adaptable interfaces that interact, communicate and deliver service to an organization's customers. 4 Domestic Main article: Domestic robot The Roomba vacuum cleaner is one of the most popular domestic service robots. citation needed Domestic robots perform tasks that humans regularly perform in non-industrial environments, like people's homes such as for cleaning floors, mowing the lawn and pool maintenance. 5 People with disabilities, as well as people who are older, may soon be able to use service robots to help them live independently. 6 It is also possible to use certain robots as assistants or butlers citation needed . Scientific Robotic systems perform many functions such as repetitive tasks performed in research. These range from the multiple repetitive tasks made by gene samplers and sequencers, to systems which can almost replace the scientist in designing and running experiments, analysing data and even forming hypotheses. Autonomous scientific robots perform tasks which humans would find difficult or impossible, from the deep sea to outer space. The Woods Hole Sentry can descend to 4,500 metres and allows a higher payload as it does not need a support ship or the oxygen and other facilities demanded by human piloted vessels . 7 Robots in space include the Mars rovers which could carry out sampling and photography in the harsh environment of the atmosphere on Mars. Food Delivery Robots Food delivery robots are a type of service robot. In addition to delivering ordered meals from a restaurant ’s kitchen to customers’ tables, these robots can also collect leftover dishes and trays after the meal. Food delivery robots first emerged in China in the mid-2010s. During the COVID-19 pandemic in 2019, their use quickly spread across various regions to reduce human contact in customer service. Although primarily used in restaurants, food delivery robots are also employed in other environments such as hospitals and hotels, where they are used to transport various items. Their main function is to deliver freshly prepared dishes from the kitchen to customers. After restaurant staff designate the delivery location, the robot navigates to the customer's seat to complete the delivery. These robots are typically capable of autonomous movement. While some rely on magnetic tape on the floor to navigate, others utilize cameras or LiDAR sensors to map indoor routes and determine their position using SLAM (Simultaneous Localization and Mapping). 8 In factory settings, mobile robots generally follow pre-defined routes, where magnetic tape alone is sufficient. However, in restaurants, the frequent cleaning of floors may cause the tape to peel off, and foot traffic patterns tend to be less predictable. Therefore, robots equipped with SLAM technology often perform more efficiently in such environments. Some delivery robots use cameras to determine their location—by placing special markers or stickers on the ceiling, the robots can use infrared sensors to identify their position through reflected signals. These robots may also be equipped with ultrasonic sensors to detect obstacles. In some cases, food delivery robots are integrated with tabletop tablets, allowing customers to place orders directly. Certain models are even equipped with basic emotional expression capabilities. 9 Examples of service robot PatrolBot CoroBot Gita Rollin' Justin Roomba Sanbot (robot) Cognitive Service Robot Cosero 10 See also Domestic robot Home automation for the elderly and disabled Personal robot Robot kit Social robot Agricultural robot References ↑ body:not(.skin-timeless):not(.skin-minerva) Service Robots - Definition . IFR International Federation of Robotics . 9 October 2002. ↑ J.F, Engelberger (1961). Robotics in Service . Industrial Management Review . 2 (2): 1– 9. ↑ Industrial Robots - Definition . International Federation of Robotics . ↑ Wirtz, Jochen; Patterson, Paul G.; Kunz, Werner H.; Gruber, Thorsten; Lu, Vinh Nhat; Paluch, Stefanie; Martins, Antje (26 September 2018). Brave new world: service robots in the frontline . Journal of Service Management . 29 (5). Emerald: 907– 931. doi : 10.1108/josm-04-2018-0119 . hdl : 1885/281633 . ISSN 1757-5818 . S2CID 62889871 . ↑ Mettler, Tobias; Sprenger, Michaela; Winter, Robert (2017). Service robots in hospitals: new perspectives on niche evolution and technology affordances . European Journal of Information Systems . 26 (5): 451– 468. doi : 10.1057/s41303-017-0046-1 . S2CID 27579290 . ↑ Graf, Birgit; Hans, Matthias; Schraft, Rolf D. (2004). Care-O-bot II—Development of a Next Generation Robotic Home Assistant . Autonomous Robots . 16 (2): 193– 205. doi : 10.1023/B:AURO.0000016865.35796.e9 . S2CID 6423156 . ↑ AUV Sentry . Woods Hole Oceanographic Institution . Retrieved 31 January 2011 . ↑ Khairuddin, Alif Ridzuan; Talib, Mohamad Shukor; Haron, Habibollah (2015). Review on simultaneous localization and mapping (SLAM) . 2015 IEEE International Conference on Control System, Computing and Engineering (ICCSCE) . IEEE. pp. 85– 90. doi : 10.1109/ICCSCE.2015.7482163 . ISBN 978-1-4799-8252-3 . ↑ Kwon, Dong-Soo; Kwak, Yoon Keun; Park, Jong C.; Chung, Myung Jin; Jee, Eun-Sook; Park, Kyung-Sook; Kim, Hyoung-Rock; Kim, Young-Min; Park, Jong-Chan; Kim, Eun Ho; Hyun, Kyung Hak; Min, Hye-Jin; Lee, Hui Sung; Park, Jeong Woo; Jo, Su Hun (2007). Emotion Interaction System for a Service Robot . RO-MAN 2007 - the 16th IEEE International Symposium on Robot and Human Interactive Communication . pp. 351– 356. doi : 10.1109/ROMAN.2007.4415108 . ISBN 978-1-4244-1634-9 . ↑ Behnke, Sven; Schwarz, Max; Stückler, Jörg (2016). Mobile Manipulation, Tool Use, and Intuitive Interaction for Cognitive Service Robot Cosero . Frontiers in Robotics and AI . 3 . doi : 10.3389/frobt.2016.00058 . ISSN 2296-9144 . Further reading H Haidegger, Tamás; Barreto, Marcos; Gonçalves, Paulo; Habib, Maki K.; Ragavan, Sampath Kumar Veera; Li, Howard; Vaccarella, Alberto; Perrone, Roberta; Prestes, Edson (2013). Applied ontologies and standards for service robots . Robotics and Autonomous Systems . 61 (11). Elsevier BV: 1215– 1223. doi : 10.1016/j.robot.2013.05.008 . ISSN 0921-8890 . Sprenger, Michaela; Mettler, Tobias (22 May 2015). Service Robots . Business Information Systems Engineering . 57 (4). Springer Science and Business Media LLC: 271– 274. doi : 10.1007/s12599-015-0389-x . ISSN 2363-7005 . S2CID 37048765 . Wirtz, Jochen; Patterson, Paul G.; Kunz, Werner H.; Gruber, Thorsten; Lu, Vinh Nhat; Paluch, Stefanie; Martins, Antje (26 September 2018). Brave new world: service robots in the frontline . Journal of Service Management . 29 (5). Emerald: 907– 931. doi : 10.1108/josm-04-2018-0119 . hdl : 1885/281633 . ISSN 1757-5818 . body.skin--responsive html.skin-theme-clientpref-night v t e Robotics Main articles Outline Glossary Index History Geography Hall of Fame Ethics Laws Competitions AI competitions Types Aerobot Anthropomorphic Humanoid Android Cyborg Gynoid Claytronics Companion Automaton Animatronic Audio-Animatronics Industrial Articulated arm Domestic Educational Entertainment Juggling Military Medical Service Disability Agricultural Food service Retail BEAM robotics Soft robotics Classifications Biorobotics Cloud robotics Continuum robot Unmanned vehicle aerial ground Mobile robot Microbotics Nanorobotics Necrobotics Robotic spacecraft Space probe Swarm Telerobotics Underwater remotely-operated Robotic fish Locomotion Tracks Walking Hexapod Climbing Electric unicycle Robotic fins Navigation and mapping Motion planning Simultaneous localization and mapping Visual odometry Vision-guided robot systems Research Evolutionary Kits Simulator Suite Open-source Software Adaptable Developmental Human–robot interaction Paradigms Perceptual Situated Ubiquitous Companies ABB Amazon Robotics Anybots Barrett Technology Boston Dynamics Doosan Robotics Energid Technologies FarmWise FANUC Figure AI Foster-Miller Harvest Automation HD Hyundai Robotics Honeybee Robotics Intuitive Surgical IRobot KUKA Rainbow Robotics Starship Technologies Symbotic Universal Robotics Wolf Robotics Yaskawa Related Critique of work Powered exoskeleton Workplace robotics safety Robotic tech vest Technological unemployment Terrainability Fictional robots Category Outline Authority control databases : National servisní roboty /span> '> Czech Republic",
  "cached_at": "2025-10-25T20:01:40.218090"
}