{
  "title": "Speech recognition",
  "summary": "Speech recognition is a sub-field of computational linguistics concerned with methods and technologies that translate spoken language into text or other interpretable forms.",
  "content": "Speech recognition Automatic conversion of spoken language into text .mw-parser-output .hatnote{font-style:italic}.mw-parser-output div.hatnote{padding-left:1.6em;margin-bottom:0.5em}.mw-parser-output .hatnote i{font-style:normal}.mw-parser-output .hatnote+link+.hatnote{margin-top:-0.5em}@media print{body.ns-0 .mw-parser-output .hatnote{display:none!important}} For the human linguistic concept, see Speech perception . .mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}@media print{body.ns-0 .mw-parser-output .ambox{display:none!important}} .mw-parser-output .multiple-issues-text{width:95%;margin:0.2em 0}.mw-parser-output .multiple-issues-text>.mw-collapsible-content{margin-top:0.3em}.mw-parser-output .compact-ambox .ambox{border:none;border-collapse:collapse;background-color:transparent;margin:0 0 0 1.6em!important;padding:0!important;width:auto;display:block}body.mediawiki .mw-parser-output .compact-ambox .ambox.mbox-small-left{font-size:100%;width:auto;margin:0}.mw-parser-output .compact-ambox .ambox .mbox-text{padding:0!important;margin:0!important}.mw-parser-output .compact-ambox .ambox .mbox-text-span{display:list-item;line-height:1.5em;list-style-type:disc}body.skin-minerva .mw-parser-output .multiple-issues-text>.mw-collapsible-toggle,.mw-parser-output .compact-ambox .ambox .mbox-image,.mw-parser-output .compact-ambox .ambox .mbox-imageright,.mw-parser-output .compact-ambox .ambox .mbox-empty-cell,.mw-parser-output .compact-ambox .hide-when-compact{display:none} This article has multiple issues. Please help improve it or discuss these issues on the talk page . ( Learn how and when to remove these messages ) This article needs additional citations for verification . Please help improve this article by adding citations to reliable sources . Unsourced material may be challenged and removed. Find sources: \"Speech recognition\" – news · newspapers · books · scholar · JSTOR ( July 2025 ) ( Learn how and when to remove this message ) This article may be too technical for most readers to understand . Please help improve it to make it understandable to non-experts , without removing the technical details. ( July 2025 ) ( Learn how and when to remove this message ) ( Learn how and when to remove this message ) Speech recognition ( automatic speech recognition ( ASR ), computer speech recognition , or speech-to-text ( STT )) is a sub-field of computational linguistics concerned with methods and technologies that translate spoken language into text or other interpretable forms. [ 1 ] Speech recognition applications include voice user interfaces , where the user speaks to a device, which \"listens\" and processes the audio. Common voice applications include interpreting commands for calling, call routing, home automation, and aircraft control. This is called direct voice input . Productivity applications including searching audio recordings, creating transcripts, and dictation. Speech recognition can be used to analyse speaker characteristics, such as identifying native language using pronunciation assessment . [ 2 ] Voice recognition [ 3 ] [ 4 ] [ 5 ] ( speaker identification ) [ 6 ] [ 7 ] [ 8 ] refers to identifying the speaker, rather than speech contents. Recognizing the speaker can simplify the task of translating speech in systems trained on a specific person's voice. It can also be used to authenticate the speaker as part of a security process. History Speech recognition developed over many decades, with progress accelerated due to advances in deep learning and the use of big data . These advances are reflected in an increase in academic papers, [ 9 ] and greater system adoption. [ 10 ] Key areas of growth include vocabulary size, more accurate recognition for unfamiliar speakers (speaker independence), and faster processing speed. Pre-1970 1952 – Bell Labs researchers, Stephen Balashek, [ 11 ] R. Biddulph, and K. H. Davis, built Audrey [ 12 ] for single-speaker digit recognition. Their system located the formants in the power spectrum of each utterance. [ 13 ] 1960 – Gunnar Fant developed and published the source-filter model of speech production . [ 14 ] 1962 – IBM 's 16-word \"Shoebox\" machine's speech recognition debuted at the 1962 World's Fair . [ 15 ] 1966 – Linear predictive coding , a speech coding method, was proposed by Fumitada Itakura of Nagoya University and Shuzo Saito of Nippon Telegraph and Telephone . [ 16 ] 1969 – Funding at Bell Labs came to a halt for several years after the company's head engineer, John R. Pierce , wrote an open letter criticizing speech recognition research. [ 17 ] This defunding lasted until Pierce retired and James L. Flanagan took over. Raj Reddy was the first person to work on continuous speech recognition, [ 18 ] as a graduate student at Stanford University in the late 1960s. Previous systems required users to pause after each word. Reddy's system issued spoken commands for playing chess . Around this time, Soviet researchers invented the dynamic time warping (DTW) algorithm [ 19 ] and used it to create a recognizer capable of operating on a 200-word vocabulary. [ 20 ] DTW processed speech by dividing it into short frames (e.g. 10 ms segments) and treating each frame as a unit. Speaker independence, however, remained unsolved. 1970–1990 1971 – DARPA funded a five-year speech recognition research project, Speech Understanding Research, seeking a minimum vocabulary size of 1,000 words. The project considered speech understanding a key to achieving progress in speech recognition, which was later disproved. [ 21 ] BBN , IBM, Carnegie Mellon (CMU), and Stanford Research Institute participated. [ 22 ] [ 23 ] 1972 – The IEEE Acoustics, Speech, and Signal Processing group held a conference in Newton, Massachusetts. 1976 – The first ICASSP was held in Philadelphia , which became a major venue for publishing on speech recognition. [ 24 ] During the late 1960s, Leonard Baum developed the mathematics of Markov chains at the Institute for Defense Analysis . A decade later, at CMU, Raj Reddy's students James Baker and Janet M. Baker began using the hidden Markov model (HMM) for speech recognition. [ 25 ] James Baker had learned about HMMs while at the Institute for Defense Analysis . [ 26 ] HMMs enabled researchers to combine sources of knowledge, such as acoustics , language, and syntax , in a unified probabilistic model. By the mid-1980s, Fred Jelinek's team at IBM created a voice-activated typewriter called Tangora, which could handle a 20,000-word vocabulary. [ 27 ] Jelinek's statistical approach placed less emphasis on emulating human brain processes in favor of statistical modelling. (Jelinek's group independently discovered the application of HMMs to speech. [ 26 ] ) This was controversial among linguists since HMMs are too simplistic to account for many features of human languages. [ 28 ] However, the HMM proved to be a highly useful way for modelling speech and replaced dynamic time warping as the dominant speech recognition algorithm in the 1980s. [ 29 ] [ 30 ] 1982 – Dragon Systems , founded by James and Janet M. Baker, [ 31 ] was one of IBM's few competitors. Practical speech recognition The 1980s also saw the introduction of the n-gram language model. 1987 – The back-off model enabled language models to use multiple-length n-grams , and CSELT [ 32 ] used HMM to recognize languages (in software and hardware, e.g. RIPAC ). At the end of the DARPA program in 1976, the best computer available to researchers was the PDP-10 with 4 MB of RAM . [ 33 ] It could take up to 100 minutes to decode 30 seconds of speech. [ 34 ] Practical products included: 1984 – the Apricot Portable was released with up to 4096 words support, of which only 64 could be held in RAM at a time. [ 35 ] 1987 – a recognizer from Kurzweil Applied Intelligence 1990 – Dragon Dictate, a consumer product released in 1990. [ 36 ] [ 37 ] AT&amp;T deployed the Voice Recognition Call Processing service in 1992 to route telephone calls without a human operator. [ 38 ] The technology was developed by Lawrence Rabiner and others at Bell Labs. By the early 1990s, the vocabulary of the typical commercial speech recognition system had exceeded the average human vocabulary. [ 33 ] Reddy's former student, Xuedong Huang , developed the Sphinx-II system at CMU. Sphinx-II was the first to do speaker-independent, large vocabulary, continuous speech recognition, and it won DARPA's 1992 evaluation. Handling continuous speech with a large vocabulary was a major milestone. Huang later founded the speech recognition group at Microsoft in 1993. Reddy's student Kai-Fu Lee joined Apple, where, in 1992, he helped develop the Casper speech interface prototype. Lernout &amp; Hauspie , a Belgium-based speech recognition company, acquired other companies, including Kurzweil Applied Intelligence in 1997 and Dragon Systems in 2000. L&amp;H was used in Windows XP . L&amp;H was an industry leader until an accounting scandal destroyed it in 2001. L&amp;H speech technology was bought by ScanSoft, which became Nuance in 2005. Apple licensed Nuance software for its digital assistant Siri . [ 39 ] 2000s In the 2000s, DARPA sponsored two speech recognition programs: Effective Affordable Reusable Speech-to-Text (EARS) in 2002, followed by Global Autonomous Language Exploitation (GALE) in 2005. Four teams participated in EARS: IBM; a team led by BBN with LIMSI and the University of Pittsburgh ; Cambridge University ; and a team composed of ICSI , SRI , and the University of Washington . EARS funded the collection of the Switchboard telephone speech corpus , which contained 260 hours of recorded conversations from over 500 speakers. [ 40 ] The GALE program focused on Arabic and Mandarin broadcast news. Google 's first effort at speech recognition came in 2007 after recruiting Nuance researchers. [ 41 ] Its first product, GOOG-411 , was a telephone-based directory service. Since at least 2006, the U.S. National Security Agency has employed keyword spotting , allowing analysts to index large volumes of recorded conversations and identify speech containing \"interesting\" keywords. [ 42 ] Other government research programs focused on intelligence applications, such as DARPA's EARS program and IARPA 's Babel program . In the early 2000s, speech recognition was dominated by hidden Markov models combined with feed-forward artificial neural networks (ANN). [ 43 ] Later, speech recognition was taken over by long short-term memory (LSTM), a recurrent neural network (RNN) published by Sepp Hochreiter &amp; Jürgen Schmidhuber in 1997. [ 44 ] LSTM RNNs avoid the vanishing gradient problem and can learn \"Very Deep Learning\" tasks [ 45 ] that require memories of events that happened thousands of discrete time steps earlier, which is important for speech. Around 2007, LSTMs trained with Connectionist Temporal Classification (CTC) [ 46 ] began to outperform. [ 47 ] In 2015, Google reported a 49 percent error‑rate reduction in its speech recognition via CTC‑trained LSTM. [ 48 ] Transformers , a type of neural network based solely on attention , were adopted in computer vision [ 49 ] [ 50 ] and language modelling, [ 51 ] [ 52 ] and then to speech recognition. [ 53 ] [ 54 ] [ 55 ] Deep feed-forward (non-recurrent) networks for acoustic modelling were introduced in 2009 by Geoffrey Hinton and his students at the University of Toronto , and by Li Deng [ 56 ] and colleagues at Microsoft Research. [ 57 ] [ 58 ] [ 59 ] [ 60 ] In contrast to the prioer incremental improvements, deep learning decreased error rates by 30%. [ 60 ] Both shallow and deep forms (e.g., recurrent nets) of ANNs had been explored since the 1980s. [ 61 ] [ 62 ] [ 63 ] However, these methods never defeated non-uniform internal-handcrafting Gaussian mixture model / hidden Markov model (GMM-HMM) technology. [ 64 ] Difficulties analyzed in the 1990s, included gradient diminishing [ 65 ] and weak temporal correlation structure. [ 66 ] [ 67 ] All these difficulties combined with insufficient training data and computing power. Most speech recognition pursued generative modelling approaches until deep learning won the day. Hinton et al. and Deng et al. [ 58 ] [ 59 ] [ 68 ] [ 69 ] 2010s By early the 2010s, speech recognition [ 70 ] [ 71 ] [ 72 ] was differentiated from speaker recognition, and speaker independence was considered a major breakthrough. Until then, systems required a \"training\" period for each voice. [ 15 ] In 2017, Microsoft researchers reached the human parity milestone of transcribing conversational speech on the widely benchmarked Switchboard task. Multiple deep learning models were used to improve accuracy. The error rate was reported to be as low as 4 professional human transcribers working together on the same benchmark. [ 73 ] Models, methods, and algorithms Both acoustic modeling and language modeling are important parts of statistically-based speech recognition algorithms. Hidden Markov models (HMMs) are widely used in many systems. Language modelling is also used in many other natural language processing applications, such as document classification or statistical machine translation . [ 74 ] Hidden Markov models Main article: Hidden Markov model Speech recognition systems are based on HMMs. These are statistical models that output a sequence of symbols or quantities. HMMs are used in speech recognition because a speech signal can be viewed as a piecewise stationary signal or a short-time stationary signal. In a short time scale (e.g. 10 milliseconds), speech can be approximated as a stationary process . Speech can be thought of as a Markov model for many stochastic purposes. HMMs are popular because they can be trained automatically and are simple and computationally feasible. An HMM outputs a sequence of n -dimensional real-valued vectors (where n is an integer such as 10), outputting one every 10 milliseconds. The vectors consist of cepstral coefficients, obtained by a Fourier transform of a short window of speech and decorrelating the spectrum using a cosine transform , then taking the first (most significant) coefficients. The HMM tends to have, in each state, a statistical distribution that is a mixture of diagonal covariance Gaussians , which give a likelihood for each observed vector. Each word, or (for more general speech recognition systems), each phoneme , has a different output distribution; an HMM for a sequence of words or phonemes is made by concatenating the individual trained HMMs for the separate words and phonemes. Speech recognition systems use combinations of standard techniques to improve results. A typical large-vocabulary system applies context dependency for the phonemes (so that phonemes with different left and right context have different realizations as HMM states). It uses cepstral normalization to handle speaker and recording conditions. It might use vocal tract length normalization (VTLN) for male-female normalization and maximum likelihood linear regression (MLLR) for more general adaptation. The features use delta and delta-delta coefficients to capture speech dynamics, and in addition might use heteroscedastic linear discriminant analysis (HLDA); or might use splicing and LDA -based projection, followed by HLDA or a global semi-tied covariance transform (also known as maximum likelihood linear transform (MLLT)). Many systems use discriminative training techniques that dispense with a purely statistical approach to HMM parameter estimation and instead optimize some classification-related measure of the training data. Examples are maximum mutual information (MMI), minimum classification error (MCE), and minimum phone error (MPE). Dynamic time warping (DTW)-based speech recognition Main article: Dynamic time warping Dynamic time warping was historically used for speech recognition, but was later displaced by HMM. Dynamic time warping measures similarity between two sequences that may vary in time or speed. For instance, similarities in walking patterns could be detected, even if in one video a person was walking slowly and in another was walking more quickly, or even if accelerations and decelerations came during one observation. DTW has been applied to video, audio, and graphics – any data that can be turned into a linear representation can be analyzed with DTW. This could handle speech at different speaking speeds. In general, it allows an optimal match between two sequences (e.g., time series) with certain restrictions. The sequences are \"warped\" non-linearly to match each other. This sequence alignment method is often used in the context of HMMs. Neural networks Main article: Artificial neural network Neural networks became interesting in the late 1980s before beginning to dominate in the 2010s. Neural networks have been used in many aspects of speech recognition, such as phoneme classification, [ 75 ] phoneme classification through multi-objective evolutionary algorithms, [ 76 ] isolated word recognition, [ 77 ] audiovisual speech recognition , audiovisual speaker recognition, and speaker adaptation. Neural networks make fewer explicit assumptions about feature statistical properties than HMMs. When used to estimate the probabilities of a speech segment, neural networks allow natural and efficient discriminative training. However, in spite of their effectiveness in classifying short-time units such as individual phonemes and isolated words, [ 78 ] early neural networks were rarely successful for continuous recognition because of their limited ability to model temporal dependencies. One approach was to use neural networks for feature transformation, or dimensionality reduction. [ 79 ] However, more recently, LSTM and related recurrent neural networks (RNNs), [ 44 ] [ 48 ] [ 80 ] [ 81 ] Time Delay Neural Networks (TDNN's), [ 82 ] and transformers [ 53 ] [ 54 ] [ 55 ] demonstrated improved performance. Deep feedforward and recurrent neural networks Main article: Deep learning Researchers are exploring deep neural networks (DNNs) and denoising autoencoders [ 83 ] .A DNN is a type of artificial neural network that includes multiple hidden layers between the input and output. [ 58 ] Like simpler neural networks, DNNs can model complex, non-linear relationships. However, their deeper architecture allows them to build more sophisticated representations that combine features from earlier layers. This gives them a powerful ability to learn and recognize complex patterns in speech data. [ 84 ] A major breakthrough in using DNNs for large vocabulary speech recognition came in 2010. In a collaboration between industry and academia, researchers used DNNs with large output layers based on context-dependent HMM states that were created using decision trees. [ 85 ] [ 86 ] [ 87 ] This approach significantly improved performanc. [ 88 ] [ 89 ] [ 90 ] A core idea behind deep learning is to eliminate the need for manually designed features and instead learn directly from input data. This was first demonstrated using deep autoencoders trained on raw spectrograms or linear filter-bank features. [ 91 ] These models outperformed traditional Mel-Cepstral features, which rely on fixed transformations. More recently, researchers showed that waveforms can achieve excellent results in large-scale speech recognition. [ 92 ] End-to-end learning Since 2014, much research has considered \"end-to-end\" ASR. Traditional phonetic-based (i.e., all HMM -based model) approaches required separate components and training for pronunciation, acoustic, and language . End-to-end models learn from all the components at once. This simplifies the training and deployment processes. For example, an n-gram language model is required for all HMM-based systems, and a typical 2025-era n-gram language model often takes gigabytes in memory, making them impractical to deploy on mobile devices. [ 93 ] Consequently, ASR systems from Google and Apple ( as of 2017 [ update ] ) deploy on servers and required a network connection to operate. [ citation needed ] The first attempt at end-to-end ASR was the Connectionist Temporal Classification (CTC)-based system introduced by Alex Graves of Google DeepMind and Navdeep Jaitly of the University of Toronto in 2014. [ 94 ] The model consisted of RNNs and a CTC layer. Jointly, the RNN-CTC model learns the pronunciation and acoustic model together, however, it is incapable of learning the language model due to conditional independence assumptions, similar to an HMM. Consequently, CTC models can directly learn to map speech acoustics to English characters, but the models make many common spelling mistakes and must rely on a separate language model to finalize transcripts. Later, Baidu expanded on the work with extremely large datasets and demonstrated some commercial success in Mandarin and English. [ 95 ] In 2016, the University of Oxford presented LipNet , [ 96 ] the first end-to-end sentence-level lipreading model, using spatiotemporal convolutions coupled with an RNN-CTC architecture, surpassing human-level performance in a restricted dataset. [ 97 ] A large-scale convolutional -RNN-CTC architecture was presented in 2018 by Google DeepMind, achieving 6 times better performance than human experts. [ 98 ] In 2019, Nvidia launched two CNN-CTC ASR models, Jasper and QuarzNet, with an overall performance word error rate (WER) of 3%. [ 99 ] [ 100 ] Similar to other deep learning applications, transfer learning and domain adaptation are important strategies for reusing and extending the capabilities of deep learning models, particularly due to the small size of available corpora in many languages and/or specific domains. [ 101 ] [ 102 ] [ 103 ] In 2018, researchers at MIT Media Lab announced preliminary work on AlterEgo, a device that uses electrodes to read the neuromuscular signals users make as they subvocalize . [ 104 ] They trained a convolutional neural network to translate the electrode signals into words. [ 105 ] Attention-based models Attention-based ASR models were introduced by Chan et al. of Carnegie Mellon University and Google Brain , and Bahdanau et al. of the University of Montreal in 2016. [ 106 ] [ 107 ] The model named \"Listen, Attend and Spell\" (LAS), literally \"listens\" to the acoustic signal, pays \"attention\" to all parts of the signal and \"spells\" out the transcript one character at a time. Unlike CTC-based models, attention-based models require conditional-independence assumptions and can learn all the components of a speech recognizer directly. This means that during deployment, no a priori language model is required, making it less demanding for applications with limited memory. Attention-based models immediately outperformed CTC models (with or without an external language model) and continued improving. [ 108 ] Latent Sequence Decomposition (LSD) was proposed by Carnegie Mellon University, MIT, and Google Brain to directly emit sub-word units that are more natural than English characters. [ 109 ] The University of Oxford and Google DeepMind extended LAS to \"Watch, Listen, Attend and Spell\" (WLAS) to handle lip reading and surpassed human-level performance. [ 110 ] Applications In-car systems Voice commands may be used to initiate phone calls, select radio stations, or play music. Voice recognition capabilities vary across car make and model. Some models offer natural-language speech recognition, allowing the driver to use full sentences and common phrases in a conversational style. With such systems, fixed commands are not required. [ 111 ] Education Main article: Pronunciation assessment Automatic pronunciation assessment is the use of speech recognition to verify the correctness of speech, [ 112 ] as distinguished from assessment by a person. [ 113 ] Also called speech verification, pronunciation evaluation, and pronunciation scoring, the main application of this technology is computer-aided pronunciation teaching (CAPT) when combined with computer-aided instruction for computer-assisted language learning (CALL), speech remediation , or accent reduction . Pronunciation assessment does not determine unknown speech (as in dictation or automatic transcription ) but instead, compares speech to a reference model for the words spoken, [ 114 ] [ 115 ] sometimes with inconsequential prosody such as intonation , pitch , tempo , rhythm , and stress . [ 116 ] Pronunciation assessment is also used in reading tutoring , for example in products such as Microsoft Teams [ 117 ] and Amira Learning. [ 118 ] Pronunciation assessment can also be used to help diagnose and treat speech disorders such as apraxia . [ 119 ] Assessing intelligibility is essential for avoiding inaccuracies from accent bias, especially in high-stakes assessments, [ 120 ] [ 121 ] [ 122 ] from words with multiple correct pronunciations, [ 123 ] and from phoneme coding errors in digital pronunciation dictionaries. [ 124 ] In 2022, researchers found that some newer speech to text systems, based on end-to-end reinforcement learning to map audio signals directly into words, produce word and phrase confidence scores closely correlated with listener intelligibility. [ 125 ] In the Common European Framework of Reference for Languages (CEFR) assessment criteria for \"overall phonological control\", intelligibility outweighs formally correct pronunciation at all levels. [ 126 ] Health care Medical documentation In the health care sector, speech recognition can be implemented in front-end or back-end medical documentation processes. In front-end speech recognition, the provider dictates into a speech-recognition engine, words are displayed as they are recognized, and the speaker is responsible for editing and signing off on the document. In back-end or deferred speech recognition the provider speaks into a digital dictation system, the voice is routed through a speech-recognition machine, and a draft document is routed along with the voice file to an editor, who edits/finalizes the draft and final report. [ citation needed ] A major issue is that the American Recovery and Reinvestment Act of 2009 ( ARRA ) provides substantial financial benefits to physicians who utilize an Electronic Health Record (EHR) that complies with \"Meaningful Use\" standards. These standards require that substantial data be maintained by the EHR. The use of speech recognition is more naturally suited to the generation of narrative text, as part of a radiology/pathology interpretation, progress note or discharge summary; the ergonomic gains of using speech recognition to enter structured discrete data (e.g., numeric values or codes from a list or a controlled vocabulary ) are relatively minimal for people who are sighted and who can operate a keyboard and mouse. A more significant issue is that most EHRs have not been expressly tailored to take advantage of voice-recognition capabilities. A large part of a clinician's interaction with EHR involves navigation through the user interface that is heavily dependent on keyboard and mouse; voice-based navigation provides only modest ergonomic benefits. By contrast, many highly customized systems for radiology or pathology dictation implement voice \"macros\", where the use of certain phrases – e.g., \"normal report\", will automatically fill in a large number of default values and/or generate boilerplate, which vary with the type of exam – e.g., a chest X-ray vs. a gastrointestinal contrast series for a radiology system. Therapeutic use Prolonged use of speech recognition software in conjunction with word processors has shown benefits to short-term-memory restrengthening in brain AVM patients who have been treated with resection . Further research needs to be conducted to determine cognitive benefits for individuals whose AVMs have been treated using radiologic techniques. [ 127 ] Military Aircraft Substantial efforts have been devoted to the test and evaluation of speech recognition in fighter aircraft . Of particular note have been the US programme in speech recognition for the Advanced Fighter Technology Integration (AFTI) / F-16 aircraft ( F-16 VISTA ), the programme in France for Mirage aircraft, and UK programmes dealing with a variety of aircraft platforms. In these programmes, speech recognizers have been operated successfully, with applications including setting radio frequencies, commanding an autopilot system, setting steer-point coordinates and weapons release parameters, and controlling flight display. Working with Swedish pilots flying the JAS-39 Gripen, Englund (2004) reported that recognition deteriorated with increasing g-loads . The study concluded that adaptation greatly improved the results in all cases and that the introduction of models for breathing was shown to improve recognition scores significantly. Contrary to what might have been expected, no effects of the broken English of the speakers were found. Spontaneous speech caused problems for the recognizer, as might have been expected. A restricted vocabulary, and above all, a proper syntax, could thus be expected to improve recognition accuracy substantially. [ 128 ] The Eurofighter Typhoon employs a speaker-dependent system, requiring each pilot to create a template. The system is not used for safety-critical or weapon-critical tasks, such as weapon release or lowering of the undercarriage, but is used for many cockpit functions. Voice commands are confirmed by visual and/or aural feedback. The system is seen as a major benefit in the reduction of pilot workload , [ 129 ] and allows the pilot to assign targets with two voice commands or to a wingman with only five commands. [ 130 ] Speaker-independent systems are under test for the F-35 Lightning II (JSF) and the Alenia Aermacchi M-346 Master lead-in fighter trainer. These systems have produced word accuracy scores in excess of 98%. [ 131 ] [ 132 ] Helicopters The problems of achieving high recognition accuracy under stress and noise are particularly relevant in the helicopter environment as well as in the fighter environment. The acoustic noise problem is actually more severe in the helicopter environment, because of the high noise levels, and because helicopter pilots, in general, do not wear a facemask , which would reduce acoustic noise in the microphone . Substantial test and evaluation programmes, notably by the U.S. Army Avionics Research and Development Activity (AVRADA) and by the Royal Aerospace Establishment ( RAE ) in the UK. Work in France included speech recognition in the Puma helicopter . Voice applications include control of communication radios, navigation systems, and an automated target handover system. The overriding issue for voice is the impact on pilot effectiveness. Encouraging results are reported for the AVRADA tests, although these represent only a feasibility demonstration in a test environment. Much remains to be done both in speech recognition and in overall speech technology in order to consistently achieve performance improvements in operational settings. Air traffic control Training for air traffic controllers (ATC) represents an excellent application for speech recognition systems. Many ATC training systems currently require a trainer to act as a \"pseudo-pilot\", engaging in a voice dialog with the trainee controller, which simulates the dialog that the controller would have with real pilots. Speech recognition and synthesis techniques offer the potential to eliminate the need for a person to act as a pseudo-pilot, thus reducing training and support personnel. In theory, air controller tasks are characterized by highly structured speech as the primary output, reducing the difficulty of the speech recognition task. In practice, this is rarely the case. FAA document 7110.65 details the phrases that should be used by air traffic controllers. While this document gives less than 150 examples of such phrases, the number of phrases supported by one of the simulation vendors speech recognition systems is in excess of 500,000. The USAF, USMC, US Army, US Navy, and FAA as well as international ATC training organizations such as the Royal Australian Air Force and Civil Aviation Authorities in Italy, Brazil, and Canada use ATC simulators with speech recognition. [ 133 ] People with disabilities Speech recognition programs can provide many benefit to those with disabilities. For individuals who are deaf or hard of hearing , speech recognition software can be used to generate captions of conversations. [ 134 ] Additionally, individuals who are blind (see blindness and education ) or have poor vision can benefit from listening to textual content, as well as garner more functionality from a computer by issuing commands with their voice. [ 135 ] The use of voice recognition software, in conjunction with a digital audio recorder and a personal computer running word-processing software, has proven useful for restoring damaged short-term memory capacity in individuals who have suffered a stroke or have undergone a craniotomy . [ citation needed ] Speech recognition has proven very useful for those who have difficulty using their hands due to causes ranging from mild repetitive stress injuries to disabilities that preclude the use of conventional computer input devices. Individuals with physical disabilities can use voice commands and transcription to navigate electronics hands-free. [ 135 ] In fact, people who developed RSI from keyboard use became an early and urgent market for speech recognition. [ 136 ] [ 137 ] Speech recognition is used in deaf telephony , such as voicemail to text, relay services , and captioned telephone . Individuals with learning disabilities who struggle with thought-to-paper communication may benefit from the software, but the product's fallibility remains a significant consideration for many. [ 138 ] In addition, speech to text technology is only an effective aid for those with intellectual disabilities if the proper training and resources are provided (e.g. in the classroom setting). [ 139 ] This type of technology can help those with dyslexia, but the potential benefits regarding other disabilities are still in question. Mistakes made by the software hinder its effectiveness, since misheard words take more time to fix. [ 140 ] Other domains This section needs additional citations for verification . Please help improve this article by adding citations to reliable sources in this section. Unsourced material may be challenged and removed. ( July 2025 ) ( Learn how and when to remove this message ) ASR is now commonplace in the field of telephony . In telephony systems, ASR is predominantly used in contact centers by integrating it with IVR systems. It is becoming more widespread in computer gaming and simulation. Despite the high level of integration with word processing in general personal computing, in the field of document production, ASR has not seen the expected increases in use. The improvement of mobile processor speeds has made speech recognition practical in smartphones . Speech is used mostly as a part of a user interface, for creating predefined or custom speech commands. Aerospace , e.g., NASA's Mars Polar Lander used speech recognition technology from Sensory, Inc. in the Mars microphone on the lander [ 141 ] Automatic subtitling with speech recognition Automatic emotion recognition [ 142 ] Automatic shot listing in audiovisual production Automatic translation E-discovery Hands-free computing Home automation Interactive voice response Mobile telephony , including mobile email Multimodal interaction [ 69 ] Real-time captioning [ 143 ] Robotics Security, including usage with other biometric scanners for multi-factor authentication [ 144 ] Speech to text Telematics , e.g., vehicle navigation systems Transcription Video games like Tom Clancy's EndWar and Lifeline Virtual assistant such as Siri Performance The performance of speech recognition systems is usually evaluated in terms of accuracy and speed. [ 145 ] [ 146 ] Accuracy is usually rated with word error rate (WER), whereas speed is measured in elapsed time. Other measures of accuracy include Single Word Error Rate (SWER) and Command Success Rate (CSR). Speech recognition is complicated by many properties of speech. Vocalizations vary in terms of accent, pronunciation, articulation, roughness, dialect, nasality, pitch, volume, and speed. Speech is distorted by background noise, echoes, and recording characteristics. Accuracy of speech recognition may vary with the following: [ 147 ] [ 148 ] Vocabulary size and confusability Speaker dependence versus independence Isolated, discontinuous, or continuous speech Task and language constraints Read versus spontaneous speech Adverse conditions Accuracy The accuracy of speech recognition may vary depending on the following factors: Error rates increase as the vocabulary size grows: e.g. the 10 digits \"zero\" to \"nine\" can be recognized essentially perfectly, but vocabulary sizes of 200, 5000, or 100000 may have error rates of 3%, 7%, or 45% respectively. Vocabulary is hard to recognize if it contains confusing letters: e.g. the 26 letters of the English alphabet are difficult to discriminate because they are confusing words (most notoriously, the E-set: \"B, C, D, E, G, P, T, V, Z (when \"Z\" is pronounced \"zee\" rather than \"zed\", depending on region); an 8% error rate is considered good for this vocabulary. [ 149 ] Speaker dependence vs. independence: A speaker-dependent system is intended for use by a single speaker. A speaker-independent system is intended for use by any speaker (more difficult). [ 150 ] Isolated, discontinuous or continuous speech With isolated speech, single words are used, which is easier to recognize. With discontinuous speech, full sentences separated by silence are used. The silence is easier to recognize similar to isolated speech. With continuous speech naturally spoken sentences are used, which are harder to recognize. Task and language constraints can inform the recognition The requesting application may dismiss the hypothesis \"The apple is red.\" Constraints may be semantic; rejecting \"The apple is angry.\" Syntactic; rejecting \"Red is apple the.\" Constraints are often represented by grammar. Read vs. spontaneous speech When a person reads it's usually in a context that has been previously prepared. When a person speaks spontaneously, recognition must deal with disfluencies such as \"uh\" and \"um\", false starts, incomplete sentences, stuttering, coughing, and laughter) and limited vocabulary. Adverse conditions environmental noise (e.g., in a car or factory). Acoustic distortions (e.g. echoes, room acoustics) Speech recognition is a multi-level pattern recognition task. Acoustic signals are structured into a hierarchy of units, e.g. phonemes , words, phrases, and sentences; Each level provides additional constraints; e.g., known word pronunciations or legal word sequences, which can compensate for errors or uncertainties at a lower level; This hierarchy of constraints improves accuracy. By combining decisions probabilistically at all lower levels, and making ultimate decisions only at the highest level, speech recognition is broken into several phases. Computationally, it is a problem in which a sound pattern has to be recognized or classified into a category that represents a meaning to a human. Every acoustic signal can be broken into smaller sub-signals. As the more complex sound signal is divided, different levels are created, where at the top level are complex sounds made of simpler sounds on the lower level, etc. At the lowest level, simple and more probabilistic rules apply. These sounds are put together into more complex sounds on upper level, a new set of more deterministic rules predicts what the complex sound represents. The upper level of a deterministic rule should figure out the meaning of complex expressions. In order to expand our knowledge about speech recognition, we need to take into consideration neural networks. Neural network approaches use the following steps: Digitize the speech – for telephone speech, 8000 samples per second are captured; [ 151 ] Compute features of spectral-domain of the speech (with Fourier transform); computed every 10ms, with one 10ms section called a frame; Sound is produced by air (or some other medium) vibration. Sound creates a wave that has two measures: amplitude (strength), and frequency (vibrations per second). [ 152 ] Accuracy can be computed with the help of WER, which is calculated by aligning the recognized word and referenced word using dynamic string alignment. The problem may occur while computing the WER due to the difference between the sequence lengths of the recognized word and referenced word. The formula to compute the word error rate (WER) is: W E R = ( s + d + i ) n {\\displaystyle WER={(s+d+i) \\over n}} where s is the number of substitutions, d is the number of deletions, i is the number of insertions, and n is the number of word references. [ 153 ] While computing, the word recognition rate (WRR) is used. The formula is: W R R = 1 − W E R = ( n − s − d − i ) n = h − i n {\\displaystyle WRR=1-WER={(n-s-d-i) \\over n}={h-i \\over n}} where h is the number of correctly recognized words: h = n − ( s + d ) . {\\displaystyle h=n-(s+d).} Security Speech recognition can become a means of attack, theft, or accidental operation. For example, activation words like \"Alexa\" spoken in an audio or video broadcast can cause devices in homes and offices to start listening for input inappropriately, or possibly take an unwanted action. [ 154 ] Voice-controlled devices may be accessible to unauthorized users. Attackers may be able to gain access to personal information, like calendars, address book contents, private messages, and documents. They may also be able to impersonate the user to send messages or make online purchases. Two attacks have been demonstrated that use artificial sounds. One transmits ultrasound and attempts to send commands without people noticing. [ 155 ] The other adds small, inaudible distortions to other speech or music that are specially crafted to confuse the specific speech recognition system into recognizing music as speech, or to make what sounds like one command to a human sound like a different command to the system. [ 156 ] Further information Conferences Regular conferences include SpeechTEK and SpeechTEK Europe, ICASSP , Interspeech/Eurospeech, and the IEEE ASRU. Conferences in the field of natural language processing , such as ACL , NAACL , EMNLP, and HLT, include papers on speech processing . Journal The main journal is IEEE/ACM Transactions on Audio, Speech and Language Processing . Books Fundamentals of Speech Recognition by Lawrence Rabiner (1993) Statistical Methods for Speech Recognition by Frederick Jelinek Spoken Language Processing by Xuedong Huang et al. (2001) Computer Speech by Manfred R. Schroeder (2004) Speech Processing: A Dynamic and Optimization-Oriented Approach by Li Deng and Doug O'Shaughnessey (2003). Speech and Language Processing by Jurafsky and Martin (2008) Fundamentals of Speaker Recognition – in depth source for up to date details on the theory and practice. [ 157 ] The Voice in the Machine. Building Computers That Understand Speech by Roberto Pieraccini (2012) – Introduction Automatic Speech Recognition: A Deep Learning Approach by Microsoft researchers D. Yu and L. Deng (2014) – mathematically-oriented treatment of deep learning methods are [ 88 ] Deep Learning: Methods and Applications by L. Deng and D. Yu (2014) – methodology-focused overview of DNN-based speech recognition [ 84 ] Projects The largest speech recognition-related project ongoing as of 2007 was the GALE project, which involves both speech recognition and translation components. Software Sphinx toolkit is one starting point for experimenting with speech recognition. HTK book and accompanying toolkit Kaldi toolkit can be used. [ 158 ] Common Voice [ 159 ] [ 160 ] (uses TensorFlow ). [ 161 ] Coqui STT [ 162 ] (derived from Common Voice, using the same open-source license) [ 163 ] [ 164 ] Gboard supports speech recognition on all Android applications. [ 165 ] Speech recognition is available in Microsoft Windows operating systems. [ 166 ] Commercial cloud based speech recognition APIs are broadly available. See also .mw-parser-output .div-col{margin-top:0.3em;column-width:30em}.mw-parser-output .div-col-small{font-size:90%}.mw-parser-output .div-col-rules{column-rule:1px solid #aaa}.mw-parser-output .div-col dl,.mw-parser-output .div-col ol,.mw-parser-output .div-col ul{margin-top:0}.mw-parser-output .div-col li,.mw-parser-output .div-col dd{page-break-inside:avoid;break-inside:avoid-column} AI effect ALPAC Application Language Tags for speech recognition Articulatory speech recognition Audio mining Audio-visual speech recognition Automatic Language Translator Automotive head unit Braina Cache language model Dragon NaturallySpeaking Fluency Voice Technology Google Voice Search IBM ViaVoice Keyword spotting Kinect Mondegreen Multimedia information retrieval Origin of speech Phonetic search technology Speaker diarisation Speaker recognition Speech analytics Speech interface guideline Speech recognition software for Linux Speech synthesis Speech verification Subtitle (captioning) VoiceXML VoxForge Windows Speech Recognition Lists List of speech recognition software List of emerging technologies Outline of artificial intelligence Timeline of speech and voice recognition References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} ↑ .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} \"What Is Speech Recognition? | IBM\" . www.ibm.com . 28 September 2021 . Retrieved 28 August 2025 . ↑ P. ",
  "cached_at": "2025-10-25T19:35:17.357091"
}