{
  "title": "Ethics of technology",
  "summary": "The ethics of technology is a sub-field of ethics addressing ethical questions specific to the technology age, the transitional shift in society wherein personal computers and subsequent devices provide for the quick and easy transfer of information. Technology ethics is the application of ethical thinking to growing concerns as new technologies continue to rise in prominence",
  "content": "Ethics of technology Ethical questions specific to the technology age The ethics of technology is a sub-field of ethics addressing ethical questions specific to the technology age , the transitional shift in society wherein personal computers and subsequent devices provide for the quick and easy transfer of information. Technology ethics is the application of ethical thinking to growing concerns as new technologies continue to rise in prominence. The topic has evolved as technologies have developed. Technology poses an ethical dilemma on producers and consumers alike. The subject of technoethics, or the ethical implications of technology, have been studied by different philosophers such as Hans Jonas and Mario Bunge . Technoethics Technoethics ( TE ) is an interdisciplinary research area that draws on theories and methods from multiple knowledge domains (such as communications, social sciences, information studies, technology studies, applied ethics, and philosophy) to provide insights on ethical dimensions of technological systems and practices for advancing a technological society. 1 Technoethics views technology and ethics as socially embedded enterprises and focuses on discovering the ethical uses for technology, protecting against the misuse of technology, 2 3 and devising common principles to guide new advances in technological development and application to benefit society. Typically, scholars in technoethics have a tendency to conceptualize technology and ethics as interconnected and embedded in life and society. 4 Technoethics denotes a broad range of ethical issues revolving around technology – from specific areas of focus affecting professionals working with technology to broader social, ethical, and legal issues concerning the role of technology in society and everyday life. 1 Technoethical perspectives are constantly in transition as technology advances in areas unseen by creators and as users change the intended uses of new technologies. Humans cannot be separated from these technologies because it is an inherent part of consciousness . 5 The short term and longer term ethical considerations for technologies engage the creator, producer, user, and governments. With the increasing impact emerging technologies have on society, the importance of assessing ethical and social issues constantly becomes more important. 6 While such technologies provide opportunities for novel applications and the potential to transform the society on a global scale, their rise is accompanied by new ethical challenges and problems that must be considered. 7 This becomes more difficult with the increasing pace at which technology is progressing and the increasing impact it has on the societal understanding by seemingly outrunning human control. 8 The concept of technoethics focuses on expanding the knowledge of existing research in the areas of technology and ethics in order to provide a holistic construct for the different aspects and subdisciplines of ethics related to technology-related human activity like economics, politics, globalization, and scientific research. 6 It is also concerned with the rights and responsibilities that designers and developers have regarding the outcomes of the respective technology. 6 9 This is of particular importance with the emergence of algorithmic technology capable of making decisions autonomously and the related issues of developer or data bias influencing these decisions. 9 To work against the manifestation of these biases, the balance between human and technology accountability for ethical failure has to be carefully evaluated and has shifted the view from technology as a merely positive tool towards the perception of technology as inherently neutral. 8 10 Technoethics thus has to focus on both sides of the human technology equation when confronted with upcoming technology innovations and applications. 9 With technology continuing to advance over time, there are new technoethical issues that come into play. For instance, discussions on genetically modified organisms (GMOs) have brought about a huge concern for technology, ethics, and safety. 11 There is also a huge question of whether or not artificial intelligence (AI) should be trusted and relied upon. These are just some examples of how the advancements in technology will affect the ethical values of humans in the future. Technoethics finds application in various areas of technology. The following key areas are mentioned in the literature: 6 Computer ethics: Focuses on the use of technology in areas including visual technology, artificial intelligence, and robotics. Engineering ethics: Dealing with professional standards of engineers and their moral responsibilities to the public. Internet ethics and cyberethics : Concerning the guarding against unethical Internet activity. Media and communication technoethics: Concerning ethical issues and responsibilities when using mass media and communication technology. Professional technoethics: Concerning all ethical considerations that revolve around the role of technology within professional conduct like in engineering, journalism, or medicine. Educational technoethics: Concerning the ethical issues and outcomes associated with using technology for educational aims. Biotech ethics: Linked to advances in bioethics and medical ethics like considerations arising in cloning, human genetic engineering, and stem cell research. Environmental technoethics: Concerning technological innovations that impact the environment and life. Nanoethics: Concerning ethical and social issues associated with developments in the alteration of matter at the level of atoms and molecules in various disciplines including computer science, engineering, and biology. Military technoethics: Concerning ethical issues associated with technology use in military action. Definitions Ethics address the issues of what is 'right', what is 'just', and what is 'fair'. 12 Ethics describe moral principles influencing conduct; accordingly, the study of ethics focuses on the actions and values of people in society (what people do and how they believe they should act in the world). 13 Technology is the branch of knowledge that deals with the creation and use of technical means and their interrelation with life, society, and the environment; it may draw upon a variety of fields, including industrial arts , engineering, applied science , and pure science. 14 Technology is core to human development and a key focus for understanding human life, society and human consciousness . 13 Using theories and methods from multiple domains, technoethics provides insights on ethical aspects of technological systems and practices, examines technology-related social policies and interventions, and provides guidelines for how to ethically use new advancements in technology. 13 Technoethics provides a systems theory and methodology to guide a variety of separate areas of inquiry into human-technological activity and ethics. 13 Moreover, the field unites both technocentric and bio-centric philosophies, providing conceptual grounding to clarify the role of technology to those affected by it and to help guide ethical problem solving and decision making in areas of activity that rely on technology. 13 As a bio-techno-centric field, technoethics has a relational orientation to both technology and human activity ; 13 it provides a system of ethical reference that justifies that profound dimension of technology as a central element in the attainment of a 'finalized' perfection of man. 15 Fundamental problems Technology is merely a tool like a device or gadget. With this thought process of technology just being a device or gadget, it is not possible for technology to possess a moral or ethical quality. Going by this thought process the tool maker or end user would be the one who decides the morality or ethicality behind a device or gadget. Ethics of technology refers to two basic subdivisions: The ethics involved in the development of new technology—whether it is always, never, or contextually right or wrong to invent and implement a technological innovation. The ethical questions that are exacerbated by the ways in which technology extends or curtails the power of individuals—how standard ethical questions are changed by the new powers. In the former case, ethics of such things as computer security and computer viruses asks whether the very act of innovation is an ethically right or wrong act. Similarly, does a scientist have an ethical obligation to produce or fail to produce a nuclear weapon ? What are the ethical questions surrounding the production of technologies that waste or conserve energy and resources? What are the ethical questions surrounding the production of new manufacturing processes that might inhibit employment, or might inflict suffering in the third world ? In the latter case, the ethics of technology quickly break down into the ethics of various human endeavors as they are altered by new technologies. For example, bioethics is now largely consumed with questions that have been exacerbated by the new life-preserving technologies, new cloning technologies, and new technologies for implantation. In law , the right of privacy is being continually attenuated by the emergence of new forms of surveillance and anonymity. The old ethical questions of privacy and free speech are given new shape and urgency in an Internet age. 16 Such tracing devices as RFID , biometric analysis and identification, genetic screening , all take old ethical questions and amplify their significance. As you can see, the fundamental problem is as society produces and advances technology that we use in all areas of our life from work, school, medicine, surveillance, etc. we receive great benefits, but there are underlying costs to these benefits. As technology evolves even more, some of the technological innovations can be seen as inhumane and those same technological innovations can be seen by others as creative, life changing, and innovative. History of technoethics Though the ethical consequences of new technologies have existed since Socrates' attack on writing in Plato 's dialogue Phaedrus , the formal field of technoethics had only existed for a few decades. The first traces of TE can be seen in Dewey and Peirce's pragmatism . With the advent of the Industrial Revolution , it was easy to see that technological advances were going to influence human activity. This is why they put emphasis on the responsible use of technology. The term technoethics was coined in 1977 by the philosopher Mario Bunge to describe the responsibilities of technologists and scientists to develop ethics as a branch of technology. Bunge argued that the current state of technological progress was guided by ungrounded practices based on limited empirical evidence and trial-and-error learning. citation needed He recognized that the technologist must be held not only technically but also morally responsible for whatever he designs or executes: not only should his artifacts be optimally efficient but, far from being harmful, they should be beneficial, and not only in the short run but also in the long term. He recognized a pressing need in society to create a new field called 'technoethics' to discover rationally grounded rules for guiding science and technological progress. 17 With the spurt in technological advances came technological inquiry. Societal views of technology were changing; people were becoming more critical of the developments that were occurring and scholars were emphasizing the need to understand and to take a deeper look and study the innovations. Associations were uniting scholars from different disciplines to study the various aspects of technology. The main disciplines being philosophy , social sciences and science and technology studies (STS). Though many technologies were already focused on ethics, each technology discipline was separated from each other, despite the potential for the information to intertwine and reinforce itself. As technologies became increasingly developed in each discipline, their ethical implications paralleled their development, and became increasingly complex. Each branch eventually became united, under the term technoethics, so that all areas of technology could be studied and researched based on existing, real-world examples and a variety of knowledge, rather than just discipline-specific knowledge. Technology and ethics Ethics theories Technoethics involves the ethical aspects of technology within a society that is shaped by technology. This brings up a series of social and ethical questions regarding new technological advancements and new boundary crossing opportunities. Before moving forward and attempting to address any ethical questions and concerns, it is important to review the three major ethical theories to develop a perspective foundation: 18 Utilitarianism ( Bentham ) is an ethical theory which attempts to maximize happiness and reduce suffering for the greatest number of people. Utilitarianism focused on results and consequences rather than rules. Duty ethics ( Kant ) notes the obligations that one has to society and follows society's universal rules. It focuses on the rightness of actions instead of the consequences, focusing on what an individual should do. 6 Virtue ethics is another main perspective in normative ethics. It highlights the role and virtues that an individual's character contains to be able to determine or evaluate ethical behaviour in society. By practicing honing honest and generous behavior, Aristotle, the philosopher of this theory believes that people will then make the right choice when faced with an ethical decision. 19 Relationship ethics states that care and consideration are both derived from human communication. Therefore, ethical communication is the core substance to maintain healthy relationships. 6 Historical framing of technology – four main periods Greek civilization defined technology as techné . Techné is the set principles, or rational method, involved in the production of an object or the accomplishment of an end; the knowledge such as principles of method; art. 20 This conceptualization of technology used during the early Greek and Roman period to denote the mechanical arts, construction, and other efforts to create, in Cicero's words, a second nature within the natural world. 6 Modern conceptualization of technology as invention materialized in the 17th century in Bacon's futuristic vision of a perfect society governed by engineers and scientists in Saloman's House, to raise the importance of technology in society. 6 The German term Technik was used in the 19th-20th century. Technik is the totality of processes, machines, tools and systems employed in the practical arts and Engineering. Webber popularized it when it was used in broader fields. Mumford said it was underlying a civilization. Known as: before 1750: Eotechnic, in 1750-1890: Paleoethnic and in 1890: Neoethnic. Place it at the center of social life in close connection to social progress and societal change. Mumford says that a machine cannot be divorced from its larger social pattern, for it is the pattern that gives it meaning and purpose. Rapid advances in technology provoked a negative reaction from scholars who saw technology as a controlling force in society with the potential to destroy how people live ( Technological Determinism ). Heidegger warned people that technology was dangerous in that it exerted control over people through its mediating effects, thus limiting authenticity of experience in the world that defines life and gives life meaning. 6 It is an intimate part of the human condition, deeply entrenched in all human history, society and mind. 6 Significant technoethical developments in society Many advancements within the past decades have added to the field of technoethics. There are multiple concrete examples that have illustrated the need to consider ethical dilemmas in relation to technological innovations. Beginning in the 1940s influenced by the British eugenic movement, the Nazis conduct racial hygiene experiments causing widespread, global anti-eugenic sentiment. In the 1950s the first satellite Sputnik 1 orbited the Earth, the Obninsk Nuclear Power Plant was the first nuclear power plant to be opened, the American nuclear tests take place . The 1960s brought about the first crewed Moon landing , ARPANET created which leads to the later creation of the Internet , first heart transplantation completed, and the Telstar communications satellite is launched. The 70s , 80s , 90s , 2000s and 2010s also brought multiple developments. Technological consciousness Technological consciousness is the relationship between humans and technology. Technology is seen as an integral component of human consciousness and development. Technology, consciousness and society are intertwined in a relational process of creation that is key to human evolution. Technology is rooted in the human mind, and is made manifest in the world in the form of new understandings and artifacts. The process of technological consciousness frames the inquiry into ethical responsibility concerning technology by grounding technology in human life. The structure of technological consciousness is relational but also situational, organizational, aspectual and integrative. Technological consciousness situates new understandings by creating a context of time and space. As well, technological consciousness organizes disjointed sequences of experience under a sense of unity that allows for a continuity of experience. The aspectual component of technological consciousness recognizes that individuals can only be conscious of aspects of an experience, not the whole thing. For this reason, technology manifests itself in processes that can be shared with others. The integrative characteristics of technological consciousness are assimilation, substitution and conversation. Assimilation allows for unfamiliar experiences to be integrated with familiar ones. Substitution is a metaphorical process allowing for complex experiences to be codified and shared with others — for example, language. Conversation is the sense of an observer within an individual's consciousness, providing stability and a standpoint from which to interact with the process. 13 Misunderstandings of consciousness and technology According to Rocci Luppicini, the common misunderstandings about consciousness and technology are listed as follows. The first misunderstanding is that consciousness is only in the head when according to Luppicini, consciousness is not only in the head meaning that c onsciousness is responsible for the creation of new conscious relations wherever imagined, be it in the head, on the street or in the past. 13 The second misunderstanding is technology is not a part of consciousness. Technology is a part of consciousness as the conceptualization of technology has gone through drastic changes. The third misunderstanding is that technology controls society and consciousness, by which Luppicini means that technology is rooted in consciousness as an integral part of mental life for everyone. This understanding will most likely alter how both patients and psychologists deal with the trials and tribunes of living with technology. 13 The last misunderstanding is society controls technology and consciousness. …(other) accounts fail to acknowledge the complex relational nature of technology as an operation within mind and society. This realization shifts the focus on technology to its origins within the human mind as explained through the theory of technological consciousness. 13 Consciousness (C) is only a part of the head: C is responsible for the creation of new conscious relations Technology (T) is not part of C: Humans cannot be separated from technology T controls society and C: Technology cannot control the mind Society controls T and C: Society fails to take in account the consideration of society shaping what technology gets developed? Types of technology ethics Technology ethics are principles that can be used to govern technology including factors like risk management and individual rights. 21 They are basically used to understand and resolve moral issues that have to do with the development and application of technology of different types. 22 There are many types of technology ethics: Access rights: access to empowering technology as a right 21 Accountability: decisions made for who is responsible when considering success or harm in technological advancements 21 Digital rights: protecting intellectual property rights and privacy rights 21 Environment: how to produce technology that could harm the environment 21 Existential risk: technologies that represent a threat to the global quality of life pertaining to extinction 21 Freedom: technology that is used to control a society raising questions related to freedom and independence 21 Health and safety: health and safety risks that are increased and imposed by technologies 21 Human Enhancement: human genetic engineering and human-machine integration 21 Human judgement: when can decisions be judged by automation and when do they acquire a reasonable human? 21 Over-automation: when does automation decrease quality of life and start affecting society? 21 Precaution principle: Who decides that developing this new technology is safe for the world? 21 Privacy: protection of privacy rights 21 Security: Is due diligence required to ensure information security? 21 Self replicating technology: should self replicating be the norm? 21 Technology transparency: clearly explaining how a technology works and what its intentions are 21 Terms of service: ethics related to legal agreements 21 Ethical challenges Ethical challenges arise in many different situations: Human knowledge processes Workplace discrimination Strained work-life balance in technologically enhanced work environments: Many people find that simply having the technology allowing one to do work while at home increases stress levels. In a recent study 70% of respondents said that since technology, work has crept into their personal lives. 23 Digital divide : Inequalities in information access for parts of the population Unequal opportunities for scientific and technological development further explanation needed Norris says access to information and knowledge resources within a knowledge society tend to favour the economically privileged who have greater access to technological tools needed to access information and knowledge resources disseminated online and the privatization of knowledge 24 Inequality in terms of how scientific and technological knowledge is developed around the globe. Developing countries do not have the same opportunities as developed countries to invest in costly large-scale research and expensive research facilities and instrumentation Organizational responsibility and accountability issues Intellectual property ownership issues 25 Information overload : Information processing theory asserts that working memory that has a limited capacity and too much information can lead to cognitive overload resulting in loss of information from short-term memory 6 Knowledge society is intertwined with changing technology requiring new skills of its workforce. Cutler says that there is the perception that older workers lack experience with new technology and that retaining programs may be less effective and more expensive for older workers. Cascio says that there is a growth of virtual organizations . Saetre Sornes say that it is a blurring of the traditional time and space boundaries has also led to many cases in the blurring of work and personal life 6 verification needed Negative impacts of many scientific and technological innovations have on humans and the environment has led to some skepticism and resistance to increasing dependence on technology within the Knowledge Society. Doucet calls for city empowerment to have the courage and foresight to make decisions that are acceptable to its inhabitants rather that succumb to global consumer capitalism and the forces of international corporations on national and local governments 6 verification needed Scientific and technological innovations that have transformed organizational life within a global economy have also supplanted human autonomy and control in work within a technologically oriented workplace The persuasive potential of technology raises the question of how sensitive ... designers and programmers should be to the ethics of the persuasive technology they design. 26 Technoethics can be used to determine the level of ethical responsibility that should be associated with outcomes of the use of technology, whether intended or unintended Rapidly changing organizational life and the history of unethical business practices have given rise to public debates concerning organizational responsibility and trust. The advent of virtual organizations and increase in remote work has bolstered ethical problems by providing more opportunities for fraud and the production of misinformation . Concerted efforts are required to uphold ethical values in advancing new knowledge and tools within societal relations which do not exclude people or limit liberties of some people at the expense of others 6 Artificial Intelligence: Artificial Intelligence seems to be one of the most talked of challenges when it comes to ethics. In order to avoid these ethical challenges some solutions have been established; first and for most it should be developed for the common good and benefit of humanity. 27 Secondly, it should operate on principles of intelligibility and fairness. 27 It should also not be used to diminish the data rights or privacy of individuals, families, or communities. 27 It is also believed that all citizens should have the right to be educated on artificial intelligence in order to be able to understand it. 27 Finally, the autonomous power to hurt, destroy, or deceive humans should never be vested in artificial intelligence. 27 Current issues Copyrights Digital copyrights are a complicated issue because there are multiple sides to the discussion. There are ethical considerations surrounding the artist, producer, and end user. Not to mention the relationships with other countries and the impact on the use of content housed in their countries. In Canada , national laws such as the Copyright Act and the history behind Bill C-32 are just the beginning of the government's attempt to shape the wild west of Canadian Internet activities. 28 The ethical considerations behind Internet activities such a peer-to-peer file sharing involve every layer of the discussion – the consumer, artist, producer, music/movie/software industry, national government, and international relations. Overall, technoethics forces the big picture approach to all discussions on technology in society. Although time-consuming, this big picture approach offers some level of reassurance when considering that any law put in place could drastically alter the way we interact with our technology and thus the direction of work and innovation in the country. The use of copyrighted material to create new content is a hotly debated topic. 29 The emergence of the musical mashup genre has compounded the issue of creative licensing. A moral conflict is created between those who believe that copyright protects any unauthorized use of content, and those who maintain that sampling and mash-ups are acceptable musical styles and, though they use portions of copyrighted material, the result is a new creative piece which is the property of the creator, and not of the original copyright holder. Whether or not the mashup genre should be allowed to use portions of copyrighted material to create new content is one which is currently under debate. 30 Cybercriminality Main article: Computer crime Cybercrime can consist of many subcategories and can be referred to as a big umbrella. Cyber theft such as online fraud, identity theft , and digital piracy can be classified as one sector. Another section of cybercrime can include cyber-violence which can be defined as online behavior that can be anywhere from hate speeches, harassment, cyberstalking, to behavior that leads to physical, psychological, or emotional assault against the well-being of an individual. Cyber obscenity is another section when child sexual exploitation materials are involved. Cyber trespass is when there is unauthorized computer system access. Cybercrime can encompass many other sections where technology and computers are used to assist and commit various forms of crimes. For many years vague , new technologies took an important place in social, cultural, political, and economic life. Thanks to the democratization of informatics access and the network's globalization , the number of exchanges and transaction is in perpetual progress. In the article, The Dark Figure of Online Property Crime: Is Cyberspace Hiding a Crime Wave? , 31 the authors analyze evidence that reveals cyber criminality rates are increasing as the typical street crimes gradually decrease. With the increase in cyber criminality, it is imperative to research more information on how to increase cyber security. The issue with increasing cyber security is that the more laws to protect people, the more citizens would feel threatened that their freedom is being compromised. One way to avoid making people feel threatened by all the security measures and protocols is by being as clear and straightforward as possible. Gregory Nojeim in his article Cybersecurity and Freedom on the Internet 32 state, Transparency in the cybersecurity program will build the confidence and trust that is essential to industry and public support for cybersecurity measures. It is important to create ethical laws that protect privacy, innovation, and consumers' freedom. Many people vague are exploiting the facilities and anonymity that modern technologies offer in order to commit multiple criminal activities. Cybercrime is one of the fastest growing areas of crime. The problem is that some laws that profess to protect people from those who would do wrong things via digital means also threaten to take away people's freedom. 33 Privacy vs. security: Full-body airport scanners Since the introduction of full body X-ray scanners to airports in 2007, many concerns over traveler privacy have arisen. Individuals are asked to step inside a rectangular machine that takes an alternate wavelength image of the person's naked body for the purpose of detecting metal and non-metal objects being carried under the clothes of the traveler. This screening technology comes in two forms, millimeter wave technology (MM-wave technology) or backscatter X-rays (similar to x-rays used by dentists). Full-body scanners were introduced into airports to increase security and improve the quality of screening for objects such as weapons or explosives due to an increase of terrorist attacks involving airplanes occurring in the early 2000s . Ethical concerns of both travelers and academic groups include fear of humiliation due to the disclosure of anatomic or medical details, exposure to a low level of radiation (in the case of backscatter X-ray technology), violation of modesty and personal privacy , clarity of operating procedures, the use of this technology to discriminate against groups, and potential misuse of this technology for reasons other than detecting concealed objects. Also people with religious beliefs that require them to remain physically covered (arms, legs, face etc.) at all times will be unable and morally opposed to stepping inside of this virtually intrusive scanning technology. The Centre for Society, Science and Citizenship have discussed their ethical concerns including the ones mentioned above and suggest recommendations for the use of this technology in their report titled Whole Body Imaging at airport checkpoints: the ethical and policy context (2010). 34 Privacy and GPS technologies The discourse around GPS tracking devices and geolocation technologies and this contemporary technology's ethical ramifications on privacy is growing 35 as the technology becomes more prevalent in society. As discussed in the New York Times ' s Sunday Review on September 22, 2012, the editorial focused on the ethical ramifications that imprisoned a drug offender because of the GPS technology in his cellphone was able to locate the criminal's position. Now that most people carry on the person a cell, the authorities have the ability to constantly know the location of a large majority of citizens. The ethical discussion now can be framed from a legal perspective. As raised in the editorial, there are stark infractions that these geolocation devices on citizens' Fourth Amendment and their protection against unreasonable searches. This reach of this issue is not just limited to the United States but affects more democratic state that uphold similar citizens' rights and freedoms against unreasonable searches. 36 These geolocation technologies are not only affecting how citizens interact with their state but also how employees interact with their workplaces. As discussed in article by the Canadian Broadcasting Company, GPS and privacy , that a growing number of employers are installing geolocation technologies in company vehicles , equipment and cellphones (Hein, 2007). Both academia and unions are finding these new powers of employers to be indirect contradiction with civil liberties . This changing relationship between employee and employer because of the integration of GPS technology into popular society is demonstrating a larger ethical discussion on what are appropriate privacy levels. This discussion will only become more prevalent as the technology becomes more popular. 37 Genetically modified organisms (GMOs) Genetically modified foods have become quite common in developed countries around the world, boasting greater yields, higher nutritional value, and greater resistance to pests, but there are still many ethical concerns regarding their use. Even commonplace genetically modified crops like corn raise questions of the ecological consequences of unintended cross pollination , potential horizontal gene transfer , and other unforeseen health concerns for humans and animals. 38 Trademarked organisms like the Glofish are a relatively new occurrence. These zebrafish , genetically modified to appear in several fluorescent colours and sold as pets in the United States, could have unforeseen effects on freshwater environments were they ever to breed in the wild. 39 Providing they receive approval from the U.S. Food and Drug Administration (FDA), another new type of fish may be arriving soon. when? The AquAdvantage salmon , engineered to reach maturity within roughly 18 months (as opposed to three years in the wild), could help meet growing global demand. There are health and environmental concerns associated with the introduction any new GMO, but more importantly this scenario highlights the potential economic impact a new product may have. The FDA does perform an economic impact analysis to weigh, for example, the consequences these new genetically modified fish may have on the traditional salmon fishing industry against the long term gain of a cheaper, more plentiful source of salmon. These technoethical assessments , which regulatory organizations like the FDA are increasingly faced with worldwide, are vitally important in determining how GMOs—with all of their potential beneficial and harmful effects—will be handled moving forward. Pregnancy screening technology For over 40 years, newborn screening has been a triumph of the 20th century public health system. 40 Through this technology, millions of parents are given the opportunity to screen for and test a number of disorders, sparing the death of their children or complications such as mental retardation. However, this technology is growing at a fast pace, disallowing researchers and practitioners from being able to fully understand how to treat diseases and provide families in need with the resources to cope. A version of pre-natal testing, called tandem mass spectrometry , is a procedure that measures levels and patterns of numerous metabolites in a single drop of blood, which are then used to identify potential diseases. Using this same drop of blood, tandem mass spectrometry enables the detection of at least four times the number of disorders than was possible with previous technologies. This allows for a cost-effective and fast method of pre-natal testing. 41 However, critics of tandem mass spectrometry and technologies like it are concerned about the adverse consequences of expanding newborn screen technology and the lack of appropriate research and infrastructure needed to provide optimum medical services to patients. Further concerns include diagnostic odysseys , a situation in which the patient aimlessly continues to search for diagnoses where none exists. Among other consequences, this technology raises the issue of whether individuals other than newborn will benefit from newborn screening practices. A reconceptualization of the purpose of this screening will have far reaching economic, health and legal impact. This discussion is only just beginning and requires informed citizenry to reach legal if not moral consensus on how far we as a society are comfortable with taking this technology. Citizen journalism Main article: Citizen journalism Citizen journalism is a concept describing citizens who wish to act as a professional journalist or media person by collecting, reporting, analyzing, and disseminating news and information 42 According to Jay Rosen , citizen journalists are the people formerly known as the audience, who were on the receiving end of a media system that ran one way, in a broadcasting pattern, with high entry fees and a few firms competing to speak very loudly while the rest of the population listened in isolation from one another—and who today are not in a situation like that at all. ... The people formerly known as the audience are simply the public made realer, less fictional, more able, less predictable . 43 The internet has provided society with a modern and accessible public space. Due to the openness of the internet, there are discernible effects on the traditional profession of journalism. Although the concept of citizen journalism is a seasoned one, the presence of online citizen journalism content in the marketplace may add to the diversity of information that citizens have access to when making decisions related to the betterment of their community or their life . 44 The emergence of online citizen journalism is fueled by the growing use of social media websites to share information about current events and issues locally, nationally and internationally. The open and instantaneous nature of the internet affects the criteria of information quality on the web. A journalistic code of ethics is not instilled for those who are practicing citizen journalism. Journalists, whether professional or citizen, have needed to adapt to new priorities of current audiences: accessibility, quantity of information, quick delivery and aesthetic appeal. 45 Thus, technology has affected the ethical code of the profession of journalism with the popular free and instant sharing qualities of the internet. Professional journalists have had to adapt to these new practices to ensure that truthful and quality reporting is being distributed. The concept can be seen as a great advancement in how society communicates freely and openly or can be seen as contributing to the decay of traditional journalistic practices and codes of ethics. Other issues to consider: Privacy concerns: location services on cell devices which tell all users where a person is should they decide to turn on this feature, social media, online banking, new capabilities of cellular devices, Wi-fi, etc. New music technology: People see more electronic music today with the new technology able to create it, as well as more advanced recording technology 46 Recent developments Despite the amassing body of scholarly work related to technoethics beginning in the 1970s, only recently has it become institutionalized and recognized as an important interdisciplinary research area and field of study. In 1998, the Epson Foundation founded the Instituto de Tecnoética in Spain under the direction of Josep Esquirol. This institute has actively promoted technoethical scholarship through awards, conferences, and publications. 47 48 This helped encourage scholarly work for a largely European audience. The major driver for the emergence of technoethics can be attributed to the publication of major reference works available in English and circulated globally. The Encyclopedia of Science, Technology, and Ethics included a section on technoethics which helped bring it into mainstream philosophy. 49 This helped to raise further interest leading to the publication of the first reference volume in the English language dedicated to the emerging field of Technoethics. The two volume Handbook of Research on Technoethics explores the complex connections between ethics and the rise of new technologies (e.g., life-preserving technologies, stem cell research , cloning technologies, new forms of surveillance and anonymity , computer networks , Internet advancement, etc.) This recent major collection provides the first comprehensive examination of technoethics and its various branches from over 50 scholars around the globe. The emergence of technoethics can be juxtaposed with a number of other innovative interdisciplinary areas of scholarship which have surfaced in recent years such as technoscience and technocriticism . 50 Technology and ethics in the music industry With all the developments we've had in technology it has created a lot advancement for the music industry both positive and negative. A main concern is piracy and illegal downloading; with all that is available through the internet a lot of music (TV shows and movies as well) have become easily accessible to download and upload for free. This does create new challenges for artist, producers, and copyright laws. The advances it has positively made for the industry is a whole new genre of music. Computers are being used to create electronic music, as well as synthesizers (computerized/electronic piano). 46 This type of music is becoming rapidly more common and listened to. These advances have allowed the industry to try new things and make new explorations. Because the internet is not controlled by a centralized power, users can maintain anonymity and find loopholes to avoid consequences for using peer-to-peer technology. The peer-to-peer network allows users to connect to a computer network and freely trade songs. Many companies, like Napster , have taken advantage of this because the protection of intellectual property is close to impossible on the internet. Digital and downloadable music has become a severe threat to major record companies. Associated digital music technologies have changed the power dynamics greatly for major record companies, music consumers, and the artists. Not only has this change in power dynamics provided more opportunities for independent music labels but also reduce costs for music. The digital environment in the music industry is always evolving. The industry is beginning to work at adapting to the digital environment and downturns in a business performance like by online distribution and sales; harnessing visibility events for sales momentum; new capabilities for artist management in the digital age and by leveraging online communities to influence product development, among others . 51 These new capabilities and new developments need strong intellectual property regulations to protect artists. Technology is a pillar in the music industry; therefore, it is imperative to have strong technology ethics. Copyright protections and legislation help artists trademark their music and protect their intellectual property. Protecting intellectual property in the music industry becomes tricky when music firms are in the process of incorporating new technologies and methodologies, which forces firms to be innovative and update the industry standards. Technology and ethics during the coronavirus pandemic As of April 20, 2020 there has been over 43 contract tracing apps available globally. Countries are in the process of creating their own methods of digitally tracing coronavirus status (symptoms, confirmed infected, exposed). Apple and Google are working together on a shared solution that helps with contract tracing around the world. Since this is a global pandemic with no end in sight, the restriction of some fundamental rights and freedoms may be ethically justifiable. It may be unethical to not use these tracing solutions to slow the spread. The European Convention on Human Rights, the United Nations International Covenant on Civil and Political Rights, and the United Nations Siracusa Principles all indicate when it is ethical to restrict the rights of the population to prevent the spread of infectious disease. All three documents cite that the circumstances for restricting rights must be time-bound, meet standards of necessity, proportionality, and scientific validity. We must evaluate if the gravity of the situation justifies the potential negative impact, if the evidence shows that the technology will work, is timely, will be adopted by enough people and yields accurate data and insights, and evaluate if the technology will only be temporary. These three documents also provide guidelines on how to ethically develop and design technologies. The development and design guidelines are important for being effective and for security reasons. 52 The development of technology has enhanced the ability to obtain, track, and share data. Technology has been mobilized by governments around the world to combat the issue of COVID-19, which has brought attention to several issues surrounding ethics. Governments have implemented technologies such as smartphone metadata and Bluetooth applications to contact trace and notify the public of any important information. There are implications for privacy as technologies such as metadata have the capacity to track every movement of an individual. Due to the Coronavirus Pandemic, contact tracing and other tracking apps have been implemented globally in order to fight against the pandemic. Countries across the globe have developing various methods of digitally tracing corona virus such as outbreak origin, symptoms, confirmed positives, and those who are potentially exposed. Governments around the world combined available technology to identify individuals and surveillance technology while still having a low impact on individuals privacy. In 2020, 53 the Australian government released a Bluetooth connected app that allows phones communicate through Bluetooth opposed to metadata. This allowed the app to connect with surrounding phones through Bluetooth opposed to metadata or GPS, which can have a bigger impact on individual privacy. The technology 53 records individuals who have been in close proximity, by connecting through their phones, and recording the data for a certain time period before deleting itself. The app does not track individual's locations but still can pinpoint if they have had close contact with those who were positive or exposed. On the other hand, some countries such as South Korea utilized metadata technology to closely surveillance their citizens. Metadata can provide a detailed description of an individual's movements by staying regularly in contact with the local cellular towers to maintain reception. In S. Korea, 53 the government utilized individuals' metadata information to convey any public health message to the public. Anonymized information would be released to the public of the locations of individuals who have tested positive for COVID-19. Similarly in Israel, the government approved emergency regulations that allowed authorities to utilize a database that tracks the movements of individuals that have tested positive for COVID-19. The rise of surveillance technologies by the government to track individuals raises many questions of ethic concerns. As lockdowns and Covid protocols continue, the focus on protecting public health can severely conflict with individual autonomy, although it can be necessary to implement certain technologies and protocols. Even though these three bodies of government can deem contact tracing ethical, all these contact tracing apps come with a price. They are collecting sensitive personal data including health data. This poses a threat to violate HIPAA and PII if not handled and processed correctly. Even if these apps are only used temporarily, they are storing permanent records of health, moveme",
  "cached_at": "2025-10-25T20:05:20.223518"
}