{
  "title": "Technology governance",
  "summary": "Technology governance means the governance, i.e., the steering between the different sectors—state, business, and NGOs—, of the development of technology. It is the idea of governance within technology and its use, as well as the practices behind them. The concept is based on the notion of innovation and of techno-economic paradigm shifts according to the theories by scholars such as Joseph A. Schumpeter, Christopher Freeman, and Carlota Perez.",
  "content": "Technology governance Governance of the development of technology .mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}@media print{body.ns-0 .mw-parser-output .ambox{display:none!important}} This article needs additional citations for verification . Please help improve this article by adding citations to reliable sources . Unsourced material may be challenged and removed. Find sources: \"Technology governance\" – news · newspapers · books · scholar · JSTOR ( August 2018 ) ( Learn how and when to remove this message ) .mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol>li{counter-increment:listitem}.mw-parser-output .hlist ol>li::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol>li:first-child::before,.mw-parser-output .hlist dt ol>li:first-child::before,.mw-parser-output .hlist li ol>li:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"} .mw-parser-output .plainlist ol,.mw-parser-output .plainlist ul{line-height:inherit;list-style:none;margin:0;padding:0}.mw-parser-output .plainlist ol li,.mw-parser-output .plainlist ul li{margin-bottom:0} .mw-parser-output .sidebar{width:22em;float:right;clear:right;margin:0.5em 0 1em 1em;background:var(--background-color-neutral-subtle,#f8f9fa);border:1px solid var(--border-color-base,#a2a9b1);padding:0.2em;text-align:center;line-height:1.4em;font-size:88%;border-collapse:collapse;display:table}body.skin-minerva .mw-parser-output .sidebar{display:table!important;float:right!important;margin:0.5em 0 1em 1em!important}.mw-parser-output .sidebar-subgroup{width:100%;margin:0;border-spacing:0}.mw-parser-output .sidebar-left{float:left;clear:left;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-none{float:none;clear:both;margin:0.5em 1em 1em 0}.mw-parser-output .sidebar-outer-title{padding:0 0.4em 0.2em;font-size:125%;line-height:1.2em;font-weight:bold}.mw-parser-output .sidebar-top-image{padding:0.4em}.mw-parser-output .sidebar-top-caption,.mw-parser-output .sidebar-pretitle-with-top-image,.mw-parser-output .sidebar-caption{padding:0.2em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-pretitle{padding:0.4em 0.4em 0;line-height:1.2em}.mw-parser-output .sidebar-title,.mw-parser-output .sidebar-title-with-pretitle{padding:0.2em 0.8em;font-size:145%;line-height:1.2em}.mw-parser-output .sidebar-title-with-pretitle{padding:0.1em 0.4em}.mw-parser-output .sidebar-image{padding:0.2em 0.4em 0.4em}.mw-parser-output .sidebar-heading{padding:0.1em 0.4em}.mw-parser-output .sidebar-content{padding:0 0.5em 0.4em}.mw-parser-output .sidebar-content-with-subgroup{padding:0.1em 0.4em 0.2em}.mw-parser-output .sidebar-above,.mw-parser-output .sidebar-below{padding:0.3em 0.8em;font-weight:bold}.mw-parser-output .sidebar-collapse .sidebar-above,.mw-parser-output .sidebar-collapse .sidebar-below{border-top:1px solid #aaa;border-bottom:1px solid #aaa}.mw-parser-output .sidebar-navbar{text-align:right;font-size:115%;padding:0 0.4em 0.4em}.mw-parser-output .sidebar-list-title{padding:0 0.4em;text-align:left;font-weight:bold;line-height:1.6em;font-size:105%}.mw-parser-output .sidebar-list-title-c{padding:0 0.4em;text-align:center;margin:0 3.3em}@media(max-width:640px){body.mediawiki .mw-parser-output .sidebar{width:100%!important;clear:both;float:none!important;margin-left:0!important;margin-right:0!important}}body.skin--responsive .mw-parser-output .sidebar a>img{max-width:none!important}@media screen{html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-night .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-list-title,html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle{background:transparent!important}html.skin-theme-clientpref-os .mw-parser-output .sidebar:not(.notheme) .sidebar-title-with-pretitle a{color:var(--color-progressive)!important}}@media print{body.ns-0 .mw-parser-output .sidebar{display:none!important}} Part of a series on Governance Models Algorithmic Collaborative Electronic Good Multistakeholder Open-source Private Public opinion By level Local Global Multi-level By field Climate Clinical Corporate Cultural Data Ecclesiastical Environmental Higher education Information Network Ocean Political party Security sector Self Simulation Soil Technology Transnational Measures World Governance Index Sustainable Governance Indicators Bertelsmann Transformation Index Policy uncertainty Related topics Chief governance officer Governance, risk management and compliance Environmental, social, and governance Market governance mechanism .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:\"[ \"}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:\" ]\"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}html.skin-theme-clientpref-night .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}@media(prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .navbar li a abbr{color:var(--color-base)!important}}@media print{.mw-parser-output .navbar{display:none!important}} v t e Technology governance means the governance , i.e., the steering between the different sectors—state, business, and NGOs —, of the development of technology . It is the idea of governance within technology and its use, as well as the practices behind them. [ 1 ] The concept is based on the notion of innovation and of techno-economic paradigm shifts according to the theories by scholars such as Joseph A. Schumpeter , Christopher Freeman , and Carlota Perez . Overview The thought is that periods in economic development are commanded by a worldview driving innovation that impacts through finance components, hierarchical change, and more prominent returns. Currently, the worldview driving innovation is information and communications technology (ICT), which has grown exponentially over the past years. Technology governance is a public policy concept; a humanitarian setting can facilitate both control and care of subjects in creating an environment aimed at reducing harms they might experience. [ 1 ] Without governance, redundant technological solutions can occur, creating more complexity as well as a potential increase in cost, compromising future investments for innovation. [ 2 ] There is a fine line between technology governance and its alternative, IT governance. It is not to be confused with inner-corporate arrangements of organization ( corporate governance ) and IT arrangements, sometimes called \"Information Technology Governance\" or Corporate governance of information technology . The difference between them is IT governance influences the governance around firm performance and information systems whereas technology governance focuses on technology itself and adapting with it. Organizations that can establish procedures and structures on public policies based on decision-making principles are at the heart of technology governance. It is a way to get people involved in these groups and allow all levels of government officials to participate. Technology governance serves as a mediator between technological innovation and controversies that surround it. Technology governance creates a balance between the political and social implications brought from new technology innovations. [ 2 ] Technology governance is a controversial topic with a wide array of stakeholders across the world. To ensure the long-term success, various organizations bring together groups and people to exchange knowledge and information, informing decisions related to technology-related public policy and regulation. Many of the technology governance organizations do not make direct policy changes, but instead aim to bring together relevant organizations and experts to exchange information and highlight key issues to influence public policy. It is still a growing area of academic focus and professional training. [ 3 ] The majority of organizations focus on Internet policies, including general organizations such as the Internet Society, [ 4 ] as well as more specific groups such as the Internet Architecture Board that serve as a \"committee of the Internet Engineering Task Force and an advisory body of the Internet Society\". [ 5 ] Larger organizations tend to focus on more overarching goals, such as development and guidance for the changing internet and technologies, while many smaller groups advise and work with and within larger groups to provide oversight and more direct examination of policies. [ 6 ] Importance Technological advancement often brings a new sense of innovation and increased convenience. These advances come with potential harm and threats if unregulated. Compliance can be breached, technology can be used to harm, and disinformation can negatively affect media while also being a potential interference in governmental/political elections. Technology governance aims to regulate that space which allows for a rather smooth evolution of technology as a whole. NGO's, committees, and unions have dedicated their efforts to the idea of technology governance as advancements become more complex and complicated. Groups like the GSCA , IGC , TTC, and the IFI divide their attention to the demand of technology governance, as well as advocate for its further presence when technological advances are made. They aim to achieve a regulated space for evolution to run its course in the tech world, free from disinformation, malpractice in use of technology, and rules/laws broken. Examples Technology innovation has a lot of beneficial effects and benefits, but it also has a lot of harmful consequences and benefits. It aids in the discovery and management of the risks and rewards associated with technology. A recurrent pattern in these breakthroughs is a shift in the industry, as well as the contentious disputes that surround them. Artificial Intelligence Nuclear Power Gene Editing Social Media Barriers Effective technology governance will involve collective action from various sectors to manage the development of breakthrough technologies. With the boundary-crossing nature of emerging technology, the need for collaborative policy-making architecture is paramount to adapt to the speed of technological change and address the variety of issues associated with introducing new technologies within our shared digital infrastructure. [ 7 ] The challenge of a collaborative policy-making architecture within governance is the inherent need for trust and cooperation among diverse stakeholder groups between innovations. [ 7 ] Among some of the barriers for governance, we see a well-known puzzle: the Collingridge dilemma , holding that early in the innovation process — when interventions and course corrections might still prove easy and cheap — the full consequences of the technology and hence the need for change might not be fully apparent. [ 8 ] The Collingridge dilemma can be described as one of the main underlying problems within the governance of emerging technologies. With new technologies like Artificial Intelligence, the implications of introducing and applying this within our digital infrastructure could prove to be dangerous and unknown. Another example is neurotechnology, with embedded devices and brain-computer interfaces that challenge existing safety and efficacy regimes and may fail to consider the potential long-term ethical questions of protecting the human agency and mental privacy. [ 9 ] In the opportunity that the need for intervention within an innovation becomes clear, changing the course to align with a collaborative policy could become expensive, complex, and time-consuming. [ 9 ] This uncertainty and unknowingness with emerging technology make the challenges within \"opening up\" or \"closing down\" development trajectories the central focus of governance debates between sectors. [ 9 ] Public acceptance introduces another aspect of challenges for technology governance. The resistance from the general acceptance within emerging innovations can fall under fundamental value conflicts, distributive concerns, or even failures of trust in governing institutions such as regulatory authorities and bodies giving technical advice. The opposition of public acceptance will require \" anticipatory governance ,\" an approach that uses participatory forms of foresight and technology assessment to work towards achieving desired future outcomes and focuses on engaging stakeholders in communicative processes with particular links to policy. [ 9 ] Within anticipatory governance and the confines of the so-called Collingridge dilemma , we envision building three capacities: anticipation or foresight; integration across disciplines; and public engagement. [ 9 ] Initiatives Global Technology Governance Summit 2021 This summit was first hosted in Japan in April 2021 by the World Economic Forum in collaboration with the Centre for the Fourth Industrial Revolution Network (C4IR). [ 10 ] The Global Technology Governance Summit has goals of becoming the leading authority on technology governance of emerging technologies by ensuring public-private collaboration. The topics covered include industry and government transformation along with technology governance and cutting edge technologies. [ 10 ] The summit was co-chaired by various industry professional and educators such as YouTube CEO Susan Wojcicki , and president of Imperial College London Alice Gast . [ 10 ] The Global Technology Governance Report 2021 was one of the reports released by the World Economic Forum during the summit. This report takes a look at how Fourth Industrial Revolution (4IR) technology is being used in a post-pandemic environment and their governance gaps. [ 11 ] This report focuses on five specific technologies of 4IR: artificial intelligence , blockchain , Internet of Things , drones, and mobility. [ 11 ] Science Technology and Innovation Policy (STI) Many organizations in the United States and even around the world adopt the STI policy to foster discoveries. It is designed for the economy to increase the public's understanding of science, technology, and innovation while simultaneously promoting the research that underpins them and allowing individuals and businesses to grow. The policy aids technology governance organizations to execute their goal and maintain a balance. Bureaus 1. Office of Science and Technology Cooperation (STC) : Science, technology, and innovation (STI) ecosystems are used by STC, which is part of the Bureau of Oceans and International Environmental and Scientific Affairs (OES) , to support US foreign and economic policy agendas. STC's role is to defend and support foreign policy advancement and the creation of new interests. 2. Office of the Science and Technology Adviser to the Secretary of State (STAS) : STAS is a focal point for integrating science, technology, and innovation into US foreign policy. The goal is to increase science while ensuring foreign policy security. 3. Office of Space Affairs (SA) : The SA's role is to carry out diplomatic initiatives in order to strengthen American leadership in space technology and other areas. By teaching and comprehending the support for US national space policies and initiatives, these affairs include space exploration, applications, and commercialization. The idea is to promote international usage of American space capabilities, systems, and services while also encountering new discoveries and innovations. [ 12 ] Largest Technology Governance Organizations Internet Governance Forum (IGF) IGF brings together people and groups to spread information to influence policy and best practices for the internet and technology. [ 13 ] The aim of the organization is to get stakeholders from across the world and of various backgrounds to be involved, as it is seen as necessary in order advance public policies in the rapidly changing area of Internet Governance. Each year, the Internet Governance Forum is hosted by a country and facilitates discussion between governments and organizations around the world, identifying the key issues and topics surrounding Internet governance and related technology topics. In addition to identifying issues, the forum also hopes to find solutions to the issues that emerge from the misuse of the internet, constantly reviewing the guidelines and principles regarding internet governance. The first IGF Conference was announced by the United Nations on July 18, 2006 and located in Athens, Greece. Since then, 12 more conferences has hosted the IGF with the website listing all 13 countries that have hosted IGF: starting from 2006 to 2018, showcasing countries such as Greece, Brazil, India, France and several others . According to the IGF, participants in the conference are usually from \"World Summit on the Information Society (WSIS) and Economic and Social Council (ECOSOC) accredited entities\" [ 14 ] as well as other organizations that have proven expertise and background that is related to Internet governance. IEEE - Advancing Technology for Humanity IEEE is the world's largest technical professional organization and aims to foster innovation and technological advancement to benefit society. [ 15 ] Although IEEE stands for the Institute of Electrical and Electronics Engineers, as one of the largest organizations in the world, the organizations is composed of more than just engineers but professionals from scientists to software developers. IEEE began in 1884 due to the increased influence of electricity in the world. The organization came from the merger of two different organizations, the American Institute of Electrical Engineers (AIEE) and the IRE. The AIEE began in 1884, formed in order to support industry professionals and their efforts to improve the standard of living in society. Although the organization was formed in New York, the first meeting was held in Philadelphia, PA, with many of the leaders coming from industries like telegraph, power, and telephone. [ 16 ] As electricity advanced and grew, the organization focused more on electric power with its initial focus on telegraph and the telephone becoming secondary. IRE on the other hand was focused on radio, and more broadly to electronics. Although its similar to the AIEE and formed in the 1940s, it grew faster and became the larger group in 1957. Due to the growth of both organizations. in January 1963, the AIEE and the IRE merged and became known as the Institute of Electrical and Electronics Engineers (IEEE). Today, the IEEE has more than 390,000 members and involved in more than 16 countries. World Wide Web Consortium (W3C) W3C is a global organization that allows groups and individuals to come together and advance Web standards. [ 17 ] The organization is led by Director, Tim Berners-Lee , and the CEO, Jeffrey Jaffe and they achieve their goals by developing the protocols and guidelines pertaining to the Web to make sure that it is successful in the long-term. In addition, there is also a W3C team called W3C Evangelists , which serves like a Business Development team by helping with identification and recruitment of new members to W3C as well as operating events in their geographical location, promoting W3C, and helping connect donors and sponsorships. The organization is mainly funded through W3C membership dues, research grants, donations, and sponsorships. The W3C also has a free service for validating web pages, which although not mandatory, is helpful in having better quality pages. According to its website, W3C was founded in October 1984 by Tim Berners-Lee at the Massachusetts Institute of Technology computer science lab. W3C collaborated with CERN and was supported by DRNA and the European Commission, hosting its first conference in April 1995. [ 18 ] Since its beginnings, there has now been four major conferences held. The second conference was hosted at Keio University of Japan in 1996 and in 2003, the third ERCIM (European Research Consortium in Informatics and Mathematics) hosted the third conference in Europe, replacing the previous European W3C host, INRIA . The fourth host was in 2013, and hosted by Beihang University in China. [ 19 ] US Technology Policy Committee (USTPC) The USTPC is a branch within the Association for Computing Machinery (ACM) that is the main committee for facilitating the interaction of matters related to policies relating to information technology. [ 20 ] One of the main ways the USTPC contributes is through providing informational reports on computing-related policy issues such as Digital Privacy , Deep Fakes, Cyber Security , and various more topics. The production of these reports and information is usually in response to requests for their expertise in technical areas, serving as a resource for decision-makers to get reliable information. The main audience groups that the USTPC provides its information to are the Congress, the Administration, and courts, helping them inform how changes in computing and technology influences public policy in the US. [ 21 ] The USTPC used to be known as USACM, was first began in 1992. [ 22 ] Since then, there have been five different committee chairs, with the committee chair being James Hendler from Rensselaer Polytechnic Institute. Hendler who works with Subcommittees of volunteers and collaborations with other organizations in order to operate and work toward their goals. The Subcommittees of the USTPC are led by chairs appointed by James Hendler and divided down into: Accessibility – Harry Hochheiser AI &amp; Algorithms – Jeanna Matthews, Jonathan Smith Digital Governance – Vacant Intellectual Property – Paul Hyland Law – Andy Grosso Privacy – Brian Dean Security – Patrick Traynor Voting – Barbara Simons [ 23 ] Recent Technology Governance Organizations Internet Governance Institute (IGI) IGI is a NGO which is focused on promoting and researching Internet Governance in the Asia Pacific region. [ 24 ] The organization consists of a small advisory group and a leadership team, collaborating to help bring together people and share resources. There is a large educational component to IGI, as they not only conduct research and development in Internet Governance topics, but also design courses and lectures to educate the public on internet governance related topics. The Institutes school offers a diploma on Internet Governance and is obtained through the completion of a 16 week course and a week long residential graduation program. [ 25 ] Its most recent report is the Nepal IGF 2018 Report. [ 26 ] In 2019, the IGI collaborated with various organizations such as the Internet Society of Nepal and ISOC Nepal to host the third Nepal IGF under the theme of \"One World, One Internet, One Vision\". [ 27 ] [ 28 ] The IGI executive team is currently led by Chairman Manohar Kumar Bhattarai, who is involved with IT Policy in Nepal and has over three decades of experience in the Information and Communication Technology sector. [ 29 ] Bhattarai is supported by six other Directors on the executive board: Upendra Keshari Neupane, Rajendra Dahal, Umesh Raghubanshi, Roshan Pokharel, Sapana Shahi, and Babu Ram Aryal who also serves as the CEO. In addition, Ananda Gautam serves as the Institutes program and policy officer. [ 30 ] G20 Global Smart Cities Alliance (GSCA) The GSCA is a global alliance that brings together municipal, regional and national governments, private-sector partners, and cities' residents through a collective understanding of smart city technologies' responsible and ethical use. [ 31 ] This Alliance will facilitate and advance global policy norms to help accelerate the use of conscientious practices, mitigate potential risks, and engage in openness to establish public trust. [ 32 ] The GSCA recently released Governing Smart Cities, a roadmap that provides cities with a benchmark to gauge the current policies for smart cities technologies, mainly concerning ICT accessibility, privacy impact assessment, cyber accountability, digital infrastructure, and open data the ethical and responsible governance. [ 33 ] International Grand Committee (IGC) The International Grand Committee is a meeting hosted to bring discussion to Big Data, Privacy, and Democracy. [ 34 ] The committee makes inquiries about topics of interest such as online safety or new developments in broadcasting. After inquiring a topic, the committee creates a report of its findings and also makes recommendations to the government. The earliest publications are from 2017 and can be found on its website. As part of its process, the IGC hosts a conference to bring discussion to its topics of inquiry. The conference has representatives from \"Argentina, Chile, Estonia, Germany, Ireland, Singapore, Ecuador, Mexico, Morocco, Trinidad and Tobago, and the United Kingdom\" and also include large companies such as Facebook, Google, Twitter, Amazon, and Apple. The organization had its first meeting on November 27, 2018 in London. University of Tokyo Institute for Future Initiatives The Institute for Future Initiatives is an organization created in 2019 as a combination of the Policy Alternatives Research Institute (PARI) and the UTIAS Integrated Research System for Sustainability Science (IR3S). [ 35 ] IFI focuses on developing recommendations for social and policy issues for a future world. Their technology Governance Policy Research Unit has completed an artificial intelligence (AI) governance project looking at various implications of AI technology and how to manage them. [ 36 ] The Institute is headed by director Hideaki Shiroyama and vice directors Toshiya Watanabe, Kensuke Fukushi, and Ichiro Sakata. [ 37 ] See also Data governance Corporate governance of information technology Horizon scanning Internet governance Internet organizations References .mw-parser-output .reflist{margin-bottom:0.5em;list-style-type:decimal}@media screen{.mw-parser-output .reflist{font-size:90%}}.mw-parser-output .reflist .references{font-size:100%;margin-bottom:0;list-style-type:inherit}.mw-parser-output .reflist-columns-2{column-width:30em}.mw-parser-output .reflist-columns-3{column-width:25em}.mw-parser-output .reflist-columns{margin-top:0.3em}.mw-parser-output .reflist-columns ol{margin-top:0}.mw-parser-output .reflist-columns li{page-break-inside:avoid;break-inside:avoid-column}.mw-parser-output .reflist-upper-alpha{list-style-type:upper-alpha}.mw-parser-output .reflist-upper-roman{list-style-type:upper-roman}.mw-parser-output .reflist-lower-alpha{list-style-type:lower-alpha}.mw-parser-output .reflist-lower-greek{list-style-type:lower-greek}.mw-parser-output .reflist-lower-roman{list-style-type:lower-roman} 1 2 .mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free.id-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited.id-lock-limited a,.mw-parser-output .id-lock-registration.id-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription.id-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-free a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-limited a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-registration a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .id-lock-subscription a,body:not(.skin-timeless):not(.skin-minerva) .mw-parser-output .cs1-ws-icon a{background-size:contain;padding:0 1em 0 0}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:var(--color-error,#d33)}.mw-parser-output .cs1-visible-error{color:var(--color-error,#d33)}.mw-parser-output .cs1-maint{display:none;color:#085;margin-left:0.3em}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}@media screen{.mw-parser-output .cs1-format{font-size:95%}html.skin-theme-clientpref-night .mw-parser-output .cs1-maint{color:#18911f}}@media screen and (prefers-color-scheme:dark){html.skin-theme-clientpref-os .mw-parser-output .cs1-maint{color:#18911f}} Jacobsen, Katja Lindskov; Fast, Larissa (2019). \"Rethinking access: how humanitarian technology governance blurs control and care\" . Disasters . 43 (S2): S151 – S168 . doi : 10.1111/disa.12333 . ISSN 0361-3666 . PMID 30821355 . S2CID 73491303 . 1 2 Wiedenhöft, Guilherme Costa; Luciano, Edimara Mezzomo (2021). \"Going the Extra Mile: Impact of Individuals' Behavior on Information Technology Governance\" . Revista de Administração Contemporânea . 25 (5). doi : 10.1590/1982-7849rac2021190237.en . hdl : 10923/18367 . ISSN 1982-7849 . S2CID 238049866 . ↑ Australian National University. \"Master of Technology Governance\" . Retrieved November 26, 2022 . ↑ \"Home\" . Internet Society . Retrieved 2019-11-13 . ↑ \"Internet Architecture Board\" , Wikipedia , 2019-10-17 , retrieved 2019-11-13 ↑ Boubaker, Karim Ben; Harguem, Saida; Nyrhinen, Mari (2021-04-17). \"IT Governance Modes Choice: An Institutional Theory Perspective\" . International Journal of Management and Data Analytics . 1 (1). ISSN 2816-9395 . 1 2 \"Global Technology Governance A Multistakeholder Approach\" (PDF) . World Economic Forum . October 2019 . Retrieved December 7, 2021 . ↑ Collingridge, David (1980). The Social Control of Technology . 1 2 3 4 5 \"Technology governance - OECD\" . www.oecd.org . Retrieved 2021-12-07 . 1 2 3 \"Global Technology Governance Summit 2021\" . Deloitte . Retrieved 2021-12-07 . 1 2 \"Global Technology Governance Report 2021\" . World Economic Forum . Retrieved 2021-12-07 . ↑ \"Science, Technology, and Innovation\" . United States Department of State . Retrieved 2021-12-07 . ↑ Anonymous (2018-11-06). \"About IGF FAQs\" . Internet Governance Forum . Retrieved 2019-11-11 . ↑ Anonymous (2018-11-06). \"About IGF FAQs\" . Internet Governance Forum . Retrieved 2019-11-20 . ↑ \"Mission &amp; Vision\" . IEEE . Retrieved 2019-11-11 . ↑ \"History of IEEE\" . IEEE . Retrieved 2019-11-20 . ↑ \"About W3C\" . www.w3.org . Retrieved 2019-11-11 . ↑ \"Facts About W3C\" . www.w3.org . Retrieved 2019-11-20 . ↑ \"Facts About W3C\" . www.w3.org . Retrieved 2019-11-20 . ↑ \"ACM US Technology Policy Committee\" . www.acm.org . Retrieved 2019-11-11 . ↑ \"ACM US Technology Policy Committee\" . www.acm.org . Retrieved 2019-11-24 . ↑ \"ACM US Technology Policy Committee History\" . www.acm.org . Retrieved 2019-11-24 . ↑ \"Subcommittees and Chairs\" . www.acm.org . Retrieved 2019-11-24 . ↑ \"Internet Governance Institute - Strengthening Grass Root Stakeholders\" . Internet Governance Institute . Retrieved 2021-10-13 . ↑ \"Diploma on Internet Governance\" . Internet Governance Institute . Retrieved 2021-10-13 . ↑ \"Internet Governance Institute\" . www.igovinstitute.org . Retrieved 2019-11-27 . ↑ \"Events\" . Internet Governance Institute . Retrieved 2021-10-13 . ↑ \"Nepal IGF 2019 - Hosted By Internet Governance Institute\" . Internet Governance Institute . Retrieved 2021-10-13 . ↑ \"Internet Governance Institute\" . www.igovinstitute.org . Retrieved 2019-11-27 . ↑ \"Our Team Archive\" . Internet Governance Institute . Retrieved 2021-10-13 . ↑ \"Global Alliance Releases Technology Governance Roadmap for Smart Cities Governance\" . IEEE . Retrieved 2021-12-08 . ↑ \"About the Alliance – GSCA v2\" . globalsmartcitiesalliance.org . Retrieved 2021-12-08 . ↑ \"Global Alliance Releases Technology Governance Roadmap for Smart Cities Governance\" . IEEE . Retrieved 2021-12-08 . ↑ \"International Grand Committee on Big Data, Privacy, and Democracy | Danielle Wollerman's ePortfolio\" . u.osu.edu . Retrieved 2019-11-18 . ↑ \"About IFI | The University of Tokyo Institute for Future Initiatives\" . ifi.u-tokyo.ac.jp (in Japanese) . Retrieved 2021-12-07 . ↑ \"AI Governance Project | The University of Tokyo Institute for Future Initiatives\" . ifi.u-tokyo.ac.jp (in Japanese) . Retrieved 2021-12-07 . ↑ \"Kensuke Fukushi | The University of Tokyo Institute for Future Initiatives\" . ifi.u-tokyo.ac.jp (in Japanese) . Retrieved 2021-12-07 . External links Technology Governance website at Tallinn University of Technology https://www.igi-global.com/article/it-governance-in-higher-education-institutions/201171",
  "cached_at": "2025-10-25T19:38:49.201744"
}