{
  "title": "Logistics automation",
  "summary": "Logistics automation is the application of computer software or automated machinery to logistics operations in order to improve its efficiency. Typically this refers to operations within a warehouse or distribution center, with broader tasks undertaken by supply chain engineering systems and enterprise resource planning systems",
  "content": "Logistics automation html body.mediawiki This article needs additional citations for verification . Please help improve this article by adding citations to reliable sources . Unsourced material may be challenged and removed. Find sources: Logistics automation – news · newspapers · books · scholar · JSTOR ( October 2014 ) ( Learn how and when to remove this message ) Application of computer software or automated machinery Mail rotating sorter for ordering arriving mail in a straight line Logistics automation is the application of computer software or automated machinery to logistics operations in order to improve its efficiency. Typically this refers to operations within a warehouse or distribution center , with broader tasks undertaken by supply chain engineering systems and enterprise resource planning systems. Logistics automation systems can powerfully complement the facilities provided by these higher level computer systems . The focus on an individual node within a wider logistics network allows systems to be highly tailored to the requirements of that node. Components Factory automation with KUKA industrial robots for palletizing food products like bread and toast at a bakery in Germany Mail sorting line: mail is identified through bar-code scanning and automatically sorted by destination. Automatic wrapping machine for unit loads Automatic box labeling machine This section does not cite any sources . Please help improve this section by adding citations to reliable sources . Unsourced material may be challenged and removed . ( May 2019 ) ( Learn how and when to remove this message ) Logistics automation systems comprise a variety of hardware and software components: Fixed machinery Automated storage and retrieval systems , including: Cranes serve a rack of locations, allowing many levels of stock to be stacked vertically, and allowing for higher storage densities and better space utilization than alternatives. In systems produced by Amazon Robotics , automated guided vehicles move items to a human picker. Conveyors : Containers can enter automated conveyors in one area of the warehouse and, either through hard-coded rules or data input, be moved to a selected destination. Vertical carousels based on the paternoster lift system or using space optimization, similar to vending machines, but on a larger scale. Sortation systems: similar to conveyors but typically with higher capacity and able to divert containers more quickly. Typically used to distribute high volumes of small cartons to a large set of locations. Industrial robots : four- to six-axis industrial robots, e.g. palletizing robots , are used for palletizing, depalletizing, packaging, commissioning and order picking. Typically all of these will automatically identify and track containers using barcodes or, increasingly, RFID tags. Motion check weighers may be used to reject cases or individual products that are under or over their specified weight. They are often used in kitting conveyor lines to ensure all pieces belonging in the kit are present. Mobile technology Radio data terminals : these are handheld or truck-mounted terminals which connect by radio to logistics automation software and provide instructions to operators moving throughout the warehouse. Many also have barcode scanners to allow identification of containers more quickly and accurately than manual keyboard entry. Software Integration software: this provides overall control of the automation machinery and allows cranes to be connected to conveyors for seamless stock movements. Operational control software: provides low-level decision-making, such as where to store incoming containers, and where to retrieve them when requested. Business control software: provides higher-level functionality, such as identification of incoming deliveries/stock, scheduling order fulfillment , and assignment of stock to outgoing trailers. Benefits of logistics automation A typical warehouse or distribution center will receive stock of a variety of products from suppliers and store these until the receipt of orders from customers, whether individual buyers (e.g. mail order), retail branches (e.g. chain stores ), or other companies (e.g. wholesalers ). A logistics automation system may provide the following: Automated goods in processes: Incoming goods can be marked with barcodes and the automation system notified of the expected stock. On arrival, the goods can be scanned and thereby identified, and taken via conveyors , sortation systems, and automated cranes into an automatically assigned storage location. Automated Goods Retrieval for Orders: On receipt of orders, the automation system is able to immediately locate goods and retrieve them to a pick-face location. Automated dispatch processing: Combining knowledge of all orders placed at the warehouse the automation system can assign picked goods into dispatch units and then into outbound loads. Sortation systems and conveyors can then move these onto the outgoing trailers. If needed, re packaging to ensure proper protection for further distribution or to change the package format for specific retailers/customers. A complete warehouse automation system can drastically reduce the workforce required to run a facility, with human input required only for a few tasks, such as picking units of product from a bulk packed case. 1 Even here, assistance can be provided with equipment such as pick-to-light units. Smaller systems may only be required to handle part of the process. Examples include automated storage and retrieval systems, which simply use cranes to store and retrieve identified cases or pallets , typically into a high-bay storage system which would be unfeasible to access using fork-lift trucks or any other means. The use of Automatic Guided Vehicles maximizes the output compared to humans since they can do repetitive tasks for long hours and with least to no supervision. An AGV is built and programmed for precision and accuracy thereby reducing the chances of errors in a warehouse, especially when dealing with fragile goods. 2 Automation software Software or cloud -based SaaS solutions are used for logistics automation which helps the supply chain industry in automating the workflow as well as management of the system. 3 Knowledge @ Wharton staff writers noted in 2011 that some manufacturers and retailers were weathering the Great Recession by signing up for pay-as-you-go logistics services available through the Internet 'cloud' . They identified the benefits and reduced costs which came from sharing information about shipments with suppliers, hauliers and end users. 4 There is little generalized software available in this market. This is because there is no rule to generalize the system as well as work flow even though the practice is more or less the same. Most of the commercial companies do use one or the other of the custom solutions. But there are various software solutions that are being used within the departments of logistics. There are a few departments in Logistics, namely: Conventional Department, Container Department, Warehouse, Marine Engineering, Heavy Haulage, etc. Software used in these departments Conventional department : CVT software / CTMS software. Container Trucking : CTMS software Warehouse : WMS /WCS Improving Effectiveness of Logistics Management Logistical Network Information Transportation Sound Inventory Management Warehousing, Materials Handling Packaging See also Automation Autonomous logistics Material handling equipment Self-driving truck Automated storage and retrieval system Automated guided vehicle References ↑ body:not(.skin-timeless):not(.skin-minerva) Benefits of Logistics Warehouse Automation . aeologic.com . 27 October 2022 . Retrieved 2022-10-27 . ↑ Integrated Technologies for Logistical Efficiency - SIPMM Publications . publication.sipmm.edu.sg . 13 July 2022 . Retrieved 2022-09-04 . ↑ Get Your Head Out of the Clouds ↑ Knowledge @ Wharton staff writers, Supply-chain Management: Growing Global Complexity Drives Companies into the 'Cloud' , published 12 January 2011, accessed 23 May 2024 Yam, K. L., Encyclopedia of Packaging Technology , John Wiley Sons, 2009, ISBN 978-0-470-08704-6 body.skin--responsive html.skin-theme-clientpref-night v t e Packaging General topics Active packaging Child-resistant packaging Contract packager Edible packaging Modified atmosphere/modified humidity packaging Overpackaging Package delivery Package pilferage Package testing Package theft Packaging engineering Resealable packaging Reusable packaging Reuse of bottles Shelf life Shelf-ready packaging Shelf-stable Sustainable packaging Tamper-evident Tamper resistance Wrap rage Product packages Alternative wine closure Ammunition box Banana box Beer bottle Box wine Case-ready meat Coffee bag Cosmetic packaging Currency packaging Disposable food packaging Drink can Egg carton Evidence packaging Field ration Flour sack Foam food container Food packaging Fuel container Gas cylinder Glass milk bottle Growler Juicebox Low plastic water bottle Luxury packaging Milk bag Optical disc packaging Oyster pail Popcorn bag Pharmaceutical packaging Pizza box Plastic milk container Purdue Improved Crop Storage bags Sand bag Seasonal packaging Self-heating food packaging Screw cap (wine) Single-serve coffee container Spray paint Toothpaste pump dispenser Unit dose Water bottle Wine bottle Containers Aerosol spray dispenser Aluminium bottle Aluminum can Ampoule Antistatic bag Bag-in-box Bag Barrel Biodegradable bag Blister pack Boil-in-bag Bottle Box Bulk box Cage Case Carboy Carton Chub Clamshell Corrugated box design Crate Disposable cup Drum Endcap Envelope Euro container Flexible intermediate bulk container Flexible tank Folding carton Glass bottle Gunny sack Inhaler Insulated shipping container Intermediate bulk container Jar Jerrycan Jug Keg Mesh bag Multilayered packaging Multi-pack Packet (container) Padded envelope Pail Paper bag Paper sack Plastic bag Plastic bottle Retort pouch Salvage drum Sachet Water sachet Security bag Shipping container Shipping tube Skin pack Spray bottle Squround Stand-up pouch Steel and tin cans Tetra Brik Thermal bag Tub (container) Tube Unit load Vial Wooden box Materials and components Adhesive Aluminium foil Bail handle Bioplastic Biodegradable plastic BoPET Bubble wrap Bung Cellophane Closure Coated paper Coating Coextrusion Container glass Corrugated fiberboard Corrugated plastic Cushioning Desiccant Double seam Flip-top Foam peanut Gel pack Hot-melt adhesive Humidity indicator card Kraft paper Label Lid Linear low-density polyethylene Liquid packaging board Living hinge Low-density polyethylene Meat absorbent pad Metallised film Modified atmosphere Molded pulp Nonwoven fabric Overwrap Oxygen scavenger Package handle Packaging gas Pallet Paper Paper pallet Paperboard Plastic-coated paper Plastic film Plastic pallet Plastic wrap Polyester Polyethylene Polypropylene Pressure-sensitive tape Pump dispenser Screw cap Screw cap (wine) Security printing Security tape Shock detector Shock and vibration data logger Shrink wrap Slip sheet Staple (fastener) Strapping Stretch wrap Susceptor Tamper-evident band Tear tape Temperature data logger Time temperature indicator Tinplate Velostat Processes Aseptic processing Authentication Automatic identification and data capture Blow fill seal Blow molding Calendering Canning Coating Containerization Converting Corona treatment Curtain coating Die cutting Die forming (plastics) Electronic article surveillance Extrusion Extrusion coating Flame treatment Glass production Graphic design Hazard analysis and critical control points Hermetic seal Induction sealing Injection moulding Lamination Laser cutting Molding Package tracking Papermaking Plastic extrusion Plastic welding Printing Product development Production control Quality assurance Radio-frequency identification Roll slitting Shearing (manufacturing) Thermoforming Track and trace Ultrasonic welding Vacuum forming Vacuum packaging Verification and validation Machinery Barcode printer Barcode reader Bottling line Calender Can seamer Cap torque tester Cartoning machine Case sealer Check weigher Conveyor system Drum pump Extended core stretch wrapper Filler Heat gun Heat sealer Industrial robot Injection molding machine Label printer applicator Lineshaft roller conveyor Logistics automation Material-handling equipment Mechanical brake stretch wrapper Multihead weigher Orbital stretch wrapper Packaging machinery Pallet inverter Palletizer Rotary wheel blow molding systems Seed-counting machine Shrink tunnel Staple gun Tape dispenser Turntable stretch wrapper Vertical form fill sealing machine Environment, post-use Biodegradation Can collecting Closed-loop box reuse Environmental engineering Extended producer responsibility Glass recycling Industrial ecology Life-cycle assessment Litter Packaging waste Paper recycling PET bottle recycling Plastic recycling Recycling Reusable packaging Reverse logistics Source reduction Sustainable packaging Waste management Category: Packaging",
  "cached_at": "2025-10-25T20:04:14.074063"
}